<abi-corpus path='gcc//drivers/librte_rawdev_ntb.so.20.0' architecture='elf-amd-x86_64' soname='librte_rawdev_ntb.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_rawdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <abi-instr version='1.0' address-size='64' path='../drivers/raw/ntb/ntb.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='ntb_logtype' type-id='type-id-1' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='10' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/raw/ntb/ntb_hw_intel.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='ntb_dev_ops' size-in-bits='832' is-struct='yes' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='102' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ntb_dev_init' type-id='type-id-3' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_peer_mw_addr' type-id='type-id-4' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mw_set_trans' type-id='type-id-5' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ioremap' type-id='type-id-6' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_link_status' type-id='type-id-3' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_link' type-id='type-id-7' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='spad_read' type-id='type-id-8' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='spad_write' type-id='type-id-9' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='db_read' type-id='type-id-10' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='db_clear' type-id='type-id-11' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='db_set_mask' type-id='type-id-11' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='peer_db_set' type-id='type-id-12' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='vector_bind' type-id='type-id-13' visibility='default' filepath='../drivers/raw/ntb/ntb.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_rawdev' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='263' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dev_id' type-id='type-id-15' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_ops' type-id='type-id-16' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-17' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver_name' type-id='type-id-18' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='attached' type-id='type-id-19' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='started' type-id='type-id-19' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_private' type-id='type-id-20' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name' type-id='type-id-21' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-22'/>
    <typedef-decl name='__uint16_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-23'/>
    <typedef-decl name='uint16_t' type-id='type-id-23' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-15'/>
    <class-decl name='rte_rawdev_ops' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='505' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_info_get' type-id='type-id-25' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_configure' type-id='type-id-26' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_start' type-id='type-id-27' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_stop' type-id='type-id-28' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_close' type-id='type-id-29' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_reset' type-id='type-id-30' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='queue_def_conf' type-id='type-id-31' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='queue_setup' type-id='type-id-32' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='queue_release' type-id='type-id-33' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='queue_count' type-id='type-id-34' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='enqueue_bufs' type-id='type-id-35' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dequeue_bufs' type-id='type-id-36' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dump' type-id='type-id-37' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='attr_get' type-id='type-id-38' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='attr_set' type-id='type-id-39' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xstats_get' type-id='type-id-40' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='xstats_get_names' type-id='type-id-41' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='xstats_get_by_name' type-id='type-id-42' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='xstats_reset' type-id='type-id-43' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='firmware_status_get' type-id='type-id-44' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='firmware_version_get' type-id='type-id-45' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='firmware_load' type-id='type-id-46' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='firmware_unload' type-id='type-id-47' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='dev_selftest' type-id='type-id-48' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='561' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-49'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-51'/>
    <typedef-decl name='rte_rawdev_obj_t' type-id='type-id-51' filepath='../lib/librte_rawdev/rte_rawdev.h' line='29' column='1' id='type-id-20'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='rawdev_info_get_t' type-id='type-id-53' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='148' column='1' id='type-id-25'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <typedef-decl name='rawdev_configure_t' type-id='type-id-57' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='162' column='1' id='type-id-26'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <typedef-decl name='rawdev_start_t' type-id='type-id-59' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='174' column='1' id='type-id-27'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='rawdev_stop_t' type-id='type-id-61' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='182' column='1' id='type-id-28'/>
    <typedef-decl name='rawdev_close_t' type-id='type-id-59' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='194' column='1' id='type-id-29'/>
    <typedef-decl name='rawdev_reset_t' type-id='type-id-59' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='205' column='1' id='type-id-30'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <typedef-decl name='rawdev_queue_conf_get_t' type-id='type-id-63' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='218' column='1' id='type-id-31'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-65'/>
    <typedef-decl name='rawdev_queue_setup_t' type-id='type-id-65' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='235' column='1' id='type-id-32'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-67'/>
    <typedef-decl name='rawdev_queue_release_t' type-id='type-id-67' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='248' column='1' id='type-id-33'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <typedef-decl name='rawdev_queue_count_t' type-id='type-id-69' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='267' column='1' id='type-id-34'/>
    <class-decl name='rte_rawdev_buf' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='302' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-51' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <typedef-decl name='rawdev_enqueue_bufs_t' type-id='type-id-75' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='291' column='1' id='type-id-35'/>
    <typedef-decl name='rawdev_dequeue_bufs_t' type-id='type-id-75' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='316' column='1' id='type-id-36'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-78' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-83' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-86' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-87' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-88' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-77'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-90'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-79'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-91'/>
    <typedef-decl name='__off_t' type-id='type-id-91' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-80'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-81'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-92'/>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='8' id='type-id-82'>
      <subrange length='1' type-id='type-id-92' id='type-id-93'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-49' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-83'/>
    <typedef-decl name='__off64_t' type-id='type-id-91' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-84'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-95'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-85'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-86'/>
    <typedef-decl name='size_t' type-id='type-id-92' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-87'/>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='160' id='type-id-88'>
      <subrange length='20' type-id='type-id-92' id='type-id-97'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-76' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <typedef-decl name='rawdev_dump_t' type-id='type-id-101' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='333' column='1' id='type-id-37'/>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-102'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-18'/>
    <typedef-decl name='__uint64_t' type-id='type-id-92' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-103'/>
    <typedef-decl name='uint64_t' type-id='type-id-103' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-104'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <typedef-decl name='rawdev_get_attr_t' type-id='type-id-107' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='350' column='1' id='type-id-38'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-108'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <typedef-decl name='rawdev_set_attr_t' type-id='type-id-110' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='368' column='1' id='type-id-39'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-111'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <typedef-decl name='rawdev_xstats_get_t' type-id='type-id-114' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='388' column='1' id='type-id-40'/>
    <class-decl name='rte_rawdev_xstats_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='433' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-21' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='434' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='512' id='type-id-21'>
      <subrange length='64' type-id='type-id-92' id='type-id-116'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <typedef-decl name='rawdev_xstats_get_names_t' type-id='type-id-119' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='413' column='1' id='type-id-41'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <typedef-decl name='rawdev_xstats_get_by_name_t' type-id='type-id-122' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='432' column='1' id='type-id-42'/>
    <typedef-decl name='__uint32_t' type-id='type-id-73' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-123'/>
    <typedef-decl name='uint32_t' type-id='type-id-123' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-124'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='rawdev_xstats_reset_t' type-id='type-id-128' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='394' column='1' id='type-id-43'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='rawdev_firmware_status_get_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='448' column='1' id='type-id-44'/>
    <typedef-decl name='rawdev_firmware_version_get_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='462' column='1' id='type-id-45'/>
    <typedef-decl name='rawdev_firmware_load_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='479' column='1' id='type-id-46'/>
    <typedef-decl name='rawdev_firmware_unload_t' type-id='type-id-59' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='494' column='1' id='type-id-47'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <typedef-decl name='rawdev_selftest_t' type-id='type-id-132' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='502' column='1' id='type-id-48'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-16'/>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-135' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-136' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-137' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-17' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-139' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-139'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-141' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-142' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-143' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-144'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-136'/>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-146' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-147' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-149' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-150' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-151' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-152' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-153' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-155' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-156' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-157' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-158' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-159' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-160' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-161' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-163' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-147'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-163' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-148'/>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-167' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-168'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-170' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-149'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-172' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-150'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-172' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-151'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-174' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-152'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-176' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-153'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-176' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-154'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-177' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-178'/>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-177'>
      <underlying-type type-id='type-id-178'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-179'>
      <underlying-type type-id='type-id-178'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-181' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-156'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-160' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-183' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-17' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-51' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-188'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-188' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-157'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-172' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-158'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-190' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-159'/>
    <qualified-type-def type-id='type-id-145' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-137'/>
    <class-decl name='rte_devargs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-138'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-193'/>
    <typedef-decl name='__uint8_t' type-id='type-id-193' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-194'/>
    <typedef-decl name='uint8_t' type-id='type-id-194' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-19'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-6'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-199'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-13'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-207'/>
    <var-decl name='intel_ntb_ops' type-id='type-id-207' visibility='default' filepath='../drivers/raw/ntb/ntb_hw_intel.h' line='84' column='1'/>
    <function-type size-in-bits='64' id='type-id-180'>
      <return type-id='type-id-179'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-195'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-200'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-199'/>
