<abi-corpus path='gcc//drivers/librte_pmd_ice.so.20.0' architecture='elf-amd-x86_64' soname='librte_pmd_ice.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_vdev.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-variable-symbols>
    <elf-symbol name='rte_net_ice_dynfield_proto_xtr_metadata_offs' size='4' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_net_ice_dynflag_proto_xtr_ipv4_mask' size='8' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_net_ice_dynflag_proto_xtr_ipv6_flow_mask' size='8' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_net_ice_dynflag_proto_xtr_ipv6_mask' size='8' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_net_ice_dynflag_proto_xtr_tcp_mask' size='8' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_net_ice_dynflag_proto_xtr_vlan_mask' size='8' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/ice/base/ice_common.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='ice_ctx_ele' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_lan_tx_rx.h' line='875' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_lan_tx_rx.h' line='876' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='size_of' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_lan_tx_rx.h' line='877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='width' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_lan_tx_rx.h' line='878' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lsb' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_lan_tx_rx.h' line='879' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-3'/>
    <typedef-decl name='__uint16_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-4'/>
    <typedef-decl name='uint16_t' type-id='type-id-4' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-5'/>
    <typedef-decl name='u16' type-id='type-id-5' filepath='../drivers/net/ice/base/ice_osdep.h' line='34' column='1' id='type-id-2'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-6'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-7'>
      <subrange length='infinite' id='type-id-8'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-9'/>
    <var-decl name='ice_tlan_ctx_info' type-id='type-id-9' visibility='default' filepath='../drivers/net/ice/base/ice_common.h' line='117' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/ice/ice_ethdev.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-10'/>
    <var-decl name='ice_logtype_init' type-id='type-id-10' visibility='default' filepath='../drivers/net/ice/base/../ice_logs.h' line='8' column='1'/>
    <var-decl name='ice_logtype_driver' type-id='type-id-10' visibility='default' filepath='../drivers/net/ice/base/../ice_logs.h' line='9' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/ice/ice_rxtx.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='rte_net_ice_dynfield_proto_xtr_metadata_offs' type-id='type-id-10' mangled-name='rte_net_ice_dynfield_proto_xtr_metadata_offs' visibility='default' filepath='../drivers/net/ice/rte_pmd_ice.h' line='84' column='1' elf-symbol-id='rte_net_ice_dynfield_proto_xtr_metadata_offs@@EXPERIMENTAL'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-11'/>
    <typedef-decl name='__uint64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-12'/>
    <typedef-decl name='uint64_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-13'/>
    <var-decl name='rte_net_ice_dynflag_proto_xtr_vlan_mask' type-id='type-id-13' mangled-name='rte_net_ice_dynflag_proto_xtr_vlan_mask' visibility='default' filepath='../drivers/net/ice/rte_pmd_ice.h' line='87' column='1' elf-symbol-id='rte_net_ice_dynflag_proto_xtr_vlan_mask@@EXPERIMENTAL'/>
    <var-decl name='rte_net_ice_dynflag_proto_xtr_ipv4_mask' type-id='type-id-13' mangled-name='rte_net_ice_dynflag_proto_xtr_ipv4_mask' visibility='default' filepath='../drivers/net/ice/rte_pmd_ice.h' line='88' column='1' elf-symbol-id='rte_net_ice_dynflag_proto_xtr_ipv4_mask@@EXPERIMENTAL'/>
    <var-decl name='rte_net_ice_dynflag_proto_xtr_ipv6_mask' type-id='type-id-13' mangled-name='rte_net_ice_dynflag_proto_xtr_ipv6_mask' visibility='default' filepath='../drivers/net/ice/rte_pmd_ice.h' line='89' column='1' elf-symbol-id='rte_net_ice_dynflag_proto_xtr_ipv6_mask@@EXPERIMENTAL'/>
    <var-decl name='rte_net_ice_dynflag_proto_xtr_ipv6_flow_mask' type-id='type-id-13' mangled-name='rte_net_ice_dynflag_proto_xtr_ipv6_flow_mask' visibility='default' filepath='../drivers/net/ice/rte_pmd_ice.h' line='90' column='1' elf-symbol-id='rte_net_ice_dynflag_proto_xtr_ipv6_flow_mask@@EXPERIMENTAL'/>
    <var-decl name='rte_net_ice_dynflag_proto_xtr_tcp_mask' type-id='type-id-13' mangled-name='rte_net_ice_dynflag_proto_xtr_tcp_mask' visibility='default' filepath='../drivers/net/ice/rte_pmd_ice.h' line='91' column='1' elf-symbol-id='rte_net_ice_dynflag_proto_xtr_tcp_mask@@EXPERIMENTAL'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/ice/ice_generic_flow.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_flow_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='63' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='validate' type-id='type-id-15' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create' type-id='type-id-16' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='type-id-17' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flush' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='query' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='isolate' type-id='type-id-20' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev' size-in-bits='132608' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='777' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_pkt_burst' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_pkt_burst' type-id='type-id-23' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tx_pkt_prepare' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='process_private' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_ops' type-id='type-id-27' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='device' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='intr_handle' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='link_intr_cbs' type-id='type-id-30' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='post_rx_burst_cbs' type-id='type-id-31' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='pre_tx_burst_cbs' type-id='type-id-31' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131712'>
        <var-decl name='state' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131776'>
        <var-decl name='security_ctx' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131840'>
        <var-decl name='reserved_64s' type-id='type-id-33' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132096'>
        <var-decl name='reserved_ptrs' type-id='type-id-34' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='807' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-26'/>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-37' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-39' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-13' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-37' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-40' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-13' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-37' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-41' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-42' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-40' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-43' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-44' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='infinite' id='type-id-45'>
      <subrange length='infinite' type-id='type-id-11' id='type-id-8'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-45' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-37'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-38'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-46' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-46' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_iova_t' type-id='type-id-13' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-46'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='infinite' id='type-id-47'>
      <subrange length='infinite' type-id='type-id-11' id='type-id-8'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-47' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-39'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-48'/>
    <typedef-decl name='__uint32_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-49'/>
    <typedef-decl name='uint32_t' type-id='type-id-49' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-40'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-51' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-26' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-53' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-48' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-10' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-48' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-54' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-55' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-56' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-57' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-58'/>

    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='256' id='type-id-51'>
      <subrange length='32' type-id='type-id-11' id='type-id-59'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-52'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-26' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-13' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-51' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-62' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-54' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-40' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-61'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-13' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-63'/>
    <typedef-decl name='size_t' type-id='type-id-11' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-62'/>
    <typedef-decl name='__int32_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-64'/>
    <typedef-decl name='int32_t' type-id='type-id-64' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-54'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-53'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-67' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='98304' id='type-id-67'>
      <subrange length='1536' type-id='type-id-11' id='type-id-68'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-55'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-69' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-70' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-72' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-41' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-69' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-41'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-73'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-46' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-63' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-70'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-74' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-75' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-77' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-41' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-26' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-62' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-79' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-26' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-74' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-74'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-78'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-46' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-63' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-80' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-42'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-83' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-84' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-86' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-83'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-84' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-88' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-89'/>
    <typedef-decl name='__int16_t' type-id='type-id-89' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-90'/>
    <typedef-decl name='int16_t' type-id='type-id-90' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-91'/>
    <qualified-type-def type-id='type-id-91' volatile='yes' id='type-id-88'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-87' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-84'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-43'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-44'>
      <subrange length='2' type-id='type-id-11' id='type-id-92'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <typedef-decl name='eth_rx_burst_t' type-id='type-id-95' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='340' column='1' id='type-id-22'/>
    <typedef-decl name='eth_tx_burst_t' type-id='type-id-95' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='345' column='1' id='type-id-23'/>
    <typedef-decl name='eth_tx_prep_t' type-id='type-id-95' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='350' column='1' id='type-id-24'/>
    <class-decl name='rte_eth_dev_data' size-in-bits='55808' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='820' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-97' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_queues' type-id='type-id-98' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_queues' type-id='type-id-98' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_rx_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='nb_tx_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='sriov' type-id='type-id-99' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dev_private' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_link' type-id='type-id-100' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dev_conf' type-id='type-id-101' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='mtu' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25568'>
        <var-decl name='min_rx_buf_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='rx_mbuf_alloc_failed' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25664'>
        <var-decl name='mac_addrs' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='mac_pool_sel' type-id='type-id-103' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='hash_mac_addrs' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33984'>
        <var-decl name='port_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='promiscuous' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='scattered_rx' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='all_multicast' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dev_started' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='lro' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34008'>
        <var-decl name='rx_queue_state' type-id='type-id-105' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42200'>
        <var-decl name='tx_queue_state' type-id='type-id-105' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50400'>
        <var-decl name='dev_flags' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50432'>
        <var-decl name='kdrv' type-id='type-id-106' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50464'>
        <var-decl name='numa_node' type-id='type-id-10' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50496'>
        <var-decl name='vlan_filter_conf' type-id='type-id-107' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54592'>
        <var-decl name='owner' type-id='type-id-108' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55168'>
        <var-decl name='representor_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55232'>
        <var-decl name='reserved_64s' type-id='type-id-33' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55488'>
        <var-decl name='reserved_ptrs' type-id='type-id-34' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='876' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='512' id='type-id-97'>
      <subrange length='64' type-id='type-id-11' id='type-id-109'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-98'/>
    <class-decl name='rte_eth_dev_sriov' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1476' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='active' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_q_per_pool' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='def_vmdq_idx' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='def_pool_q_idx' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1480' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-110'/>
    <typedef-decl name='__uint8_t' type-id='type-id-110' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-111'/>
    <typedef-decl name='uint8_t' type-id='type-id-111' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-104'/>
    <class-decl name='rte_eth_link' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='308' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speed' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='link_duplex' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='link_autoneg' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='link_status' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_conf' size-in-bits='24640' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1045' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speeds' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rxmode' type-id='type-id-112' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='txmode' type-id='type-id-113' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='lpbk_mode' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rx_adv_conf' type-id='type-id-114' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1068' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='tx_adv_conf' type-id='type-id-115' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18080'>
        <var-decl name='dcb_capability_en' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='fdir_conf' type-id='type-id-116' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='intr_conf' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1081' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rxmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='394' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-118' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_rx_pkt_len' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='split_hdr_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-44' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-119' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='409' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-120'/>
    <enum-decl name='rte_eth_rx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='344' column='1' id='type-id-118'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ETH_MQ_RX_NONE' value='0'/>
      <enumerator name='ETH_MQ_RX_RSS' value='1'/>
      <enumerator name='ETH_MQ_RX_DCB' value='2'/>
      <enumerator name='ETH_MQ_RX_DCB_RSS' value='3'/>
      <enumerator name='ETH_MQ_RX_VMDQ_ONLY' value='4'/>
      <enumerator name='ETH_MQ_RX_VMDQ_RSS' value='5'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB' value='6'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB_RSS' value='7'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='128' id='type-id-119'>
      <subrange length='2' type-id='type-id-11' id='type-id-92'/>

    </array-type-def>
    <class-decl name='rte_eth_txmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='792' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-121' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pvid' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='hw_vlan_reject_tagged' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='hw_vlan_reject_untagged' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='hw_vlan_insert_pvid' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-44' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-119' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='812' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='377' column='1' id='type-id-121'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ETH_MQ_TX_NONE' value='0'/>
      <enumerator name='ETH_MQ_TX_DCB' value='1'/>
      <enumerator name='ETH_MQ_TX_VMDQ_DCB' value='2'/>
      <enumerator name='ETH_MQ_TX_VMDQ_ONLY' value='3'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1060' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_conf' type-id='type-id-122' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vmdq_dcb_conf' type-id='type-id-123' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='dcb_rx_conf' type-id='type-id-124' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='vmdq_rx_conf' type-id='type-id-125' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1066' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rss_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='448' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_key' type-id='type-id-126' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rss_key_len' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rss_hf' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='451' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-126'/>
    <class-decl name='rte_eth_vmdq_dcb_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='745' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_pool_maps' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_map' type-id='type-id-128' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='dcb_tc' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='754' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_pools' filepath='../lib/librte_ethdev/rte_ethdev.h' line='704' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ETH_8_POOLS' value='8'/>
      <enumerator name='ETH_16_POOLS' value='16'/>
      <enumerator name='ETH_32_POOLS' value='32'/>
      <enumerator name='ETH_64_POOLS' value='64'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='750' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pools' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='752' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-130' size-in-bits='8192' id='type-id-128'>
      <subrange length='64' type-id='type-id-11' id='type-id-109'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='64' id='type-id-129'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>
    <class-decl name='rte_eth_dcb_rx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='712' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-132' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_tcs' filepath='../lib/librte_ethdev/rte_ethdev.h' line='695' column='1' id='type-id-132'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ETH_4_TCS' value='4'/>
      <enumerator name='ETH_8_TCS' value='8'/>
    </enum-decl>
    <class-decl name='rte_eth_vmdq_rx_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='776' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='enable_loop_back' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='nb_pool_maps' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rx_mode' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool_map' type-id='type-id-128' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='786' column='1'/>
      </data-member>
    </class-decl>

    <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1069' column='1' id='type-id-115'>
      <data-member access='private'>
        <var-decl name='vmdq_dcb_tx_conf' type-id='type-id-133' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1070' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dcb_tx_conf' type-id='type-id-134' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1072' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vmdq_tx_conf' type-id='type-id-135' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1074' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_eth_vmdq_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='718' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='721' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='724' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-132' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vmdq_tx_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='730' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_fdir_conf' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1005' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-136' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pballoc' type-id='type-id-137' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='status' type-id='type-id-138' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drop_queue' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mask' type-id='type-id-139' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flex_conf' type-id='type-id-140' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1012' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fdir_mode' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='603' column='1' id='type-id-136'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FDIR_MODE_NONE' value='0'/>
      <enumerator name='RTE_FDIR_MODE_SIGNATURE' value='1'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT' value='2'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_MAC_VLAN' value='3'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_TUNNEL' value='4'/>
    </enum-decl>
    <enum-decl name='rte_fdir_pballoc_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='984' column='1' id='type-id-137'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FDIR_PBALLOC_64K' value='0'/>
      <enumerator name='RTE_FDIR_PBALLOC_128K' value='1'/>
      <enumerator name='RTE_FDIR_PBALLOC_256K' value='2'/>
    </enum-decl>
    <enum-decl name='rte_fdir_status_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='993' column='1' id='type-id-138'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FDIR_NO_REPORT_STATUS' value='0'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS' value='1'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS_ALWAYS' value='2'/>
    </enum-decl>
    <class-decl name='rte_eth_fdir_masks' size-in-bits='544' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='533' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_tci_mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv4_mask' type-id='type-id-141' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ipv6_mask' type-id='type-id-142' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='src_port_mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='dst_port_mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mac_addr_byte_mask' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='tunnel_id_mask' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tunnel_type_mask' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv4_flow' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='342' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dst_ip' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tos' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='ttl' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='proto' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv6_flow' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='381' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-143' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_ip' type-id='type-id-143' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tc' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='proto' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='hop_limits' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='386' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='128' id='type-id-143'>
      <subrange length='4' type-id='type-id-11' id='type-id-144'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_conf' size-in-bits='5792' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='591' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_payloads' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_flexmasks' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flex_set' type-id='type-id-145' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='flex_mask' type-id='type-id-146' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='596' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_flex_payload_cfg' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='568' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-148' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='src_offset' type-id='type-id-149' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_payload_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='555' column='1' id='type-id-148'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_ETH_PAYLOAD_UNKNOWN' value='0'/>
      <enumerator name='RTE_ETH_RAW_PAYLOAD' value='1'/>
      <enumerator name='RTE_ETH_L2_PAYLOAD' value='2'/>
      <enumerator name='RTE_ETH_L3_PAYLOAD' value='3'/>
      <enumerator name='RTE_ETH_L4_PAYLOAD' value='4'/>
      <enumerator name='RTE_ETH_PAYLOAD_MAX' value='8'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='256' id='type-id-149'>
      <subrange length='16' type-id='type-id-11' id='type-id-150'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-147' size-in-bits='2304' id='type-id-145'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_mask' size-in-bits='144' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='581' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flow_type' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mask' type-id='type-id-152' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='583' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='128' id='type-id-152'>
      <subrange length='16' type-id='type-id-11' id='type-id-150'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-151' size-in-bits='3456' id='type-id-146'>
      <subrange length='24' type-id='type-id-11' id='type-id-153'/>

    </array-type-def>
    <class-decl name='rte_intr_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1031' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lsc' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='rxq' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='rmv' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1037' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_ether_addr' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='60' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr_bytes' type-id='type-id-155' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='61' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='48' id='type-id-155'>
      <subrange length='6' type-id='type-id-11' id='type-id-156'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-102'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='8192' id='type-id-103'>
      <subrange length='128' type-id='type-id-11' id='type-id-157'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='8192' id='type-id-105'>
      <subrange length='1024' type-id='type-id-11' id='type-id-158'/>

    </array-type-def>
    <enum-decl name='rte_kernel_driver' filepath='../lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-106'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_KDRV_UNKNOWN' value='0'/>
      <enumerator name='RTE_KDRV_IGB_UIO' value='1'/>
      <enumerator name='RTE_KDRV_VFIO' value='2'/>
      <enumerator name='RTE_KDRV_UIO_GENERIC' value='3'/>
      <enumerator name='RTE_KDRV_NIC_UIO' value='4'/>
      <enumerator name='RTE_KDRV_NONE' value='5'/>
    </enum-decl>
    <class-decl name='rte_vlan_filter_conf' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='427' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ids' type-id='type-id-159' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='428' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='4096' id='type-id-159'>
      <subrange length='64' type-id='type-id-11' id='type-id-109'/>

    </array-type-def>
    <class-decl name='rte_eth_dev_owner' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1490' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-97' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1492' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='256' id='type-id-33'>
      <subrange length='4' type-id='type-id-11' id='type-id-144'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='256' id='type-id-34'>
      <subrange length='4' type-id='type-id-11' id='type-id-144'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-25'/>
    <class-decl name='eth_dev_ops' size-in-bits='6016' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='609' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_configure' type-id='type-id-161' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_start' type-id='type-id-162' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_stop' type-id='type-id-163' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_set_link_up' type-id='type-id-164' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_set_link_down' type-id='type-id-165' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_close' type-id='type-id-166' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dev_reset' type-id='type-id-167' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link_update' type-id='type-id-168' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='is_removed' type-id='type-id-169' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='promiscuous_enable' type-id='type-id-170' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='promiscuous_disable' type-id='type-id-171' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='allmulticast_enable' type-id='type-id-172' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='allmulticast_disable' type-id='type-id-173' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mac_addr_remove' type-id='type-id-174' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='mac_addr_add' type-id='type-id-175' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='mac_addr_set' type-id='type-id-176' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_mc_addr_list' type-id='type-id-177' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mtu_set' type-id='type-id-178' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='stats_get' type-id='type-id-179' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='stats_reset' type-id='type-id-180' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='xstats_get' type-id='type-id-181' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='xstats_reset' type-id='type-id-182' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='xstats_get_names' type-id='type-id-183' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='queue_stats_mapping_set' type-id='type-id-184' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='dev_infos_get' type-id='type-id-185' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rxq_info_get' type-id='type-id-186' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='txq_info_get' type-id='type-id-187' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='rx_burst_mode_get' type-id='type-id-188' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tx_burst_mode_get' type-id='type-id-188' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='fw_version_get' type-id='type-id-189' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dev_supported_ptypes_get' type-id='type-id-190' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='dev_ptypes_set' type-id='type-id-191' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='vlan_filter_set' type-id='type-id-192' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='vlan_tpid_set' type-id='type-id-193' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='vlan_strip_queue_set' type-id='type-id-194' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='vlan_offload_set' type-id='type-id-195' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='vlan_pvid_set' type-id='type-id-196' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='rx_queue_start' type-id='type-id-197' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='rx_queue_stop' type-id='type-id-198' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tx_queue_start' type-id='type-id-197' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tx_queue_stop' type-id='type-id-198' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='rx_queue_setup' type-id='type-id-199' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='rx_queue_release' type-id='type-id-200' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='rx_queue_count' type-id='type-id-201' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='rx_descriptor_done' type-id='type-id-202' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='rx_descriptor_status' type-id='type-id-203' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tx_descriptor_status' type-id='type-id-204' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='rx_queue_intr_enable' type-id='type-id-205' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='rx_queue_intr_disable' type-id='type-id-206' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tx_queue_setup' type-id='type-id-207' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tx_queue_release' type-id='type-id-200' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tx_done_cleanup' type-id='type-id-208' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dev_led_on' type-id='type-id-209' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dev_led_off' type-id='type-id-210' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='flow_ctrl_get' type-id='type-id-211' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='flow_ctrl_set' type-id='type-id-212' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='priority_flow_ctrl_set' type-id='type-id-213' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='uc_hash_table_set' type-id='type-id-214' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='uc_all_hash_table_set' type-id='type-id-215' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='mirror_rule_set' type-id='type-id-216' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='mirror_rule_reset' type-id='type-id-217' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='udp_tunnel_port_add' type-id='type-id-218' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='udp_tunnel_port_del' type-id='type-id-219' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='l2_tunnel_eth_type_conf' type-id='type-id-220' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='l2_tunnel_offload_set' type-id='type-id-221' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='set_queue_rate_limit' type-id='type-id-222' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='rss_hash_update' type-id='type-id-223' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='rss_hash_conf_get' type-id='type-id-224' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='reta_update' type-id='type-id-225' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='reta_query' type-id='type-id-226' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='get_reg' type-id='type-id-227' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='get_eeprom_length' type-id='type-id-228' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='get_eeprom' type-id='type-id-229' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='set_eeprom' type-id='type-id-230' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='get_module_info' type-id='type-id-231' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='get_module_eeprom' type-id='type-id-232' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='filter_ctrl' type-id='type-id-233' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='get_dcb_info' type-id='type-id-234' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='timesync_enable' type-id='type-id-235' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='timesync_disable' type-id='type-id-236' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='timesync_read_rx_timestamp' type-id='type-id-237' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='timesync_read_tx_timestamp' type-id='type-id-238' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='timesync_adjust_time' type-id='type-id-239' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='timesync_read_time' type-id='type-id-240' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='timesync_write_time' type-id='type-id-241' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='read_clock' type-id='type-id-242' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='xstats_get_by_id' type-id='type-id-243' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='xstats_get_names_by_id' type-id='type-id-244' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='tm_ops_get' type-id='type-id-245' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='mtr_ops_get' type-id='type-id-246' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='pool_ops_supported' type-id='type-id-247' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='hairpin_cap_get' type-id='type-id-248' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='rx_hairpin_queue_setup' type-id='type-id-249' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='tx_hairpin_queue_setup' type-id='type-id-250' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <typedef-decl name='eth_dev_configure_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='31' column='1' id='type-id-161'/>
    <typedef-decl name='eth_dev_start_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='34' column='1' id='type-id-162'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <typedef-decl name='eth_dev_stop_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='37' column='1' id='type-id-163'/>
    <typedef-decl name='eth_dev_set_link_up_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='40' column='1' id='type-id-164'/>
    <typedef-decl name='eth_dev_set_link_down_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='43' column='1' id='type-id-165'/>
    <typedef-decl name='eth_dev_close_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='46' column='1' id='type-id-166'/>
    <typedef-decl name='eth_dev_reset_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='49' column='1' id='type-id-167'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <typedef-decl name='eth_link_update_t' type-id='type-id-257' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='155' column='1' id='type-id-168'/>
    <typedef-decl name='eth_is_removed_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='52' column='1' id='type-id-169'/>
    <typedef-decl name='eth_promiscuous_enable_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='78' column='1' id='type-id-170'/>
    <typedef-decl name='eth_promiscuous_disable_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='103' column='1' id='type-id-171'/>
    <typedef-decl name='eth_allmulticast_enable_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='128' column='1' id='type-id-172'/>
    <typedef-decl name='eth_allmulticast_disable_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='153' column='1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <typedef-decl name='eth_mac_addr_remove_t' type-id='type-id-259' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='391' column='1' id='type-id-174'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <typedef-decl name='eth_mac_addr_add_t' type-id='type-id-261' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='394' column='1' id='type-id-175'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <typedef-decl name='eth_mac_addr_set_t' type-id='type-id-263' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='400' column='1' id='type-id-176'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <typedef-decl name='eth_set_mc_addr_list_t' type-id='type-id-265' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='436' column='1' id='type-id-177'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <typedef-decl name='mtu_set_t' type-id='type-id-267' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='315' column='1' id='type-id-178'/>
    <class-decl name='rte_eth_stats' size-in-bits='5632' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='243' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipackets' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opackets' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ibytes' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='obytes' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='imissed' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ierrors' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='oerrors' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rx_nombuf' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='q_ipackets' type-id='type-id-269' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='q_opackets' type-id='type-id-269' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='q_ibytes' type-id='type-id-269' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='q_obytes' type-id='type-id-269' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='q_errors' type-id='type-id-269' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='263' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='1024' id='type-id-269'>
      <subrange length='16' type-id='type-id-11' id='type-id-150'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <typedef-decl name='eth_stats_get_t' type-id='type-id-272' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='159' column='1' id='type-id-179'/>
    <typedef-decl name='eth_stats_reset_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='182' column='1' id='type-id-180'/>
    <class-decl name='rte_eth_xstat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1337' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1339' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <typedef-decl name='eth_xstats_get_t' type-id='type-id-276' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='184' column='1' id='type-id-181'/>
    <typedef-decl name='eth_xstats_reset_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='213' column='1' id='type-id-182'/>
    <class-decl name='rte_eth_xstat_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1349' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-97' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1350' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <typedef-decl name='eth_xstats_get_names_t' type-id='type-id-280' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='215' column='1' id='type-id-183'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <typedef-decl name='eth_queue_stats_mapping_set_t' type-id='type-id-282' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='224' column='1' id='type-id-184'/>
    <class-decl name='rte_eth_dev_info' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1226' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driver_name' type-id='type-id-284' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='if_index' type-id='type-id-48' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='min_mtu' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='max_mtu' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_flags' type-id='type-id-285' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_rx_bufsize' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_rx_pktlen' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='max_rx_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='max_tx_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_mac_addrs' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='max_hash_mac_addrs' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='max_vfs' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='max_vmdq_pools' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_offload_capa' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_offload_capa' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rx_queue_offload_capa' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tx_queue_offload_capa' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reta_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='hash_key_size' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='flow_type_rss_offloads' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_rxconf' type-id='type-id-286' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='default_txconf' type-id='type-id-287' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='vmdq_queue_base' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1744'>
        <var-decl name='vmdq_queue_num' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='vmdq_pool_base' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1776'>
        <var-decl name='rx_desc_lim' type-id='type-id-288' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tx_desc_lim' type-id='type-id-288' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='speed_capa' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_rx_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2000'>
        <var-decl name='nb_tx_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='default_rxportconf' type-id='type-id-289' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='default_txportconf' type-id='type-id-289' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='dev_capa' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='switch_info' type-id='type-id-290' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='reserved_64s' type-id='type-id-44' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='reserved_ptrs' type-id='type-id-119' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1282' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-292' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-293' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-294' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-295' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-296' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-296'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-297'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-284'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-298'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-299' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-300' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-301' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-302'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-293'/>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-304' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-305' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-306' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-307' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-308' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-309' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-310' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-311' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-312' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-313' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-314' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-315' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-316' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-317' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-304'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-318' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-319' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-321' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-305'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-321' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-306'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-322'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-325'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-325' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-326'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-328' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-307'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-330' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-308'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-330' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-309'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-332' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-310'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-334' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-311'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-334' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-312'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-335' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-335'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-336'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-338' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-314'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-318' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-340' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-26' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-341'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-342'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-345' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-315'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-330' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-316'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-347' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-317'/>
    <qualified-type-def type-id='type-id-303' const='yes' id='type-id-348'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-294'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-350' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-351' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-352' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-97' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-353' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-318' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-340' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-295' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-354' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-354'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-351'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-352'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-353'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-355' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-355'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-356'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-285'/>
    <class-decl name='rte_eth_rxconf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='818' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_thresh' type-id='type-id-357' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rx_free_thresh' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rx_drop_en' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='rx_deferred_start' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved_64s' type-id='type-id-44' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='reserved_ptrs' type-id='type-id-119' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='831' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_thresh' size-in-bits='24' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='327' column='1' id='type-id-357'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pthresh' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='hthresh' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='wthresh' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_txconf' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='837' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tx_thresh' type-id='type-id-357' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tx_rs_thresh' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='tx_free_thresh' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_deferred_start' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-44' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-119' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='852' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_desc_lim' size-in-bits='80' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='898' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_max' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_min' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_align' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_seg_max' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_mtu_seg_max' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='924' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_portconf' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1189' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='burst_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ring_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1192' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_switch_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1204' column='1' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-284' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='domain_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='port_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1207' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <typedef-decl name='eth_dev_infos_get_t' type-id='type-id-360' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='230' column='1' id='type-id-185'/>
    <class-decl name='rte_eth_rxq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1289' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='type-id-41' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conf' type-id='type-id-286' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scattered_rx' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='nb_desc' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1293' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <typedef-decl name='eth_rxq_info_get_t' type-id='type-id-364' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='306' column='1' id='type-id-186'/>
    <class-decl name='rte_eth_txq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1300' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='conf' type-id='type-id-287' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_desc' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1302' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <typedef-decl name='eth_txq_info_get_t' type-id='type-id-368' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='309' column='1' id='type-id-187'/>
    <class-decl name='rte_eth_burst_mode' size-in-bits='8256' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1318' column='1' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='info' type-id='type-id-370' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1322' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='8192' id='type-id-370'>
      <subrange length='1024' type-id='type-id-11' id='type-id-158'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <typedef-decl name='eth_burst_mode_get_t' type-id='type-id-373' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='312' column='1' id='type-id-188'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <typedef-decl name='eth_fw_version_get_t' type-id='type-id-375' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='299' column='1' id='type-id-189'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <typedef-decl name='eth_dev_supported_ptypes_get_t' type-id='type-id-377' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='234' column='1' id='type-id-190'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <typedef-decl name='eth_dev_ptypes_set_t' type-id='type-id-379' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='249' column='1' id='type-id-191'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <typedef-decl name='vlan_filter_set_t' type-id='type-id-381' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='318' column='1' id='type-id-192'/>
    <enum-decl name='rte_vlan_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='416' column='1' id='type-id-382'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ETH_VLAN_TYPE_UNKNOWN' value='0'/>
      <enumerator name='ETH_VLAN_TYPE_INNER' value='1'/>
      <enumerator name='ETH_VLAN_TYPE_OUTER' value='2'/>
      <enumerator name='ETH_VLAN_TYPE_MAX' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <typedef-decl name='vlan_tpid_set_t' type-id='type-id-384' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='323' column='1' id='type-id-193'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <typedef-decl name='vlan_strip_queue_set_t' type-id='type-id-386' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='335' column='1' id='type-id-194'/>
    <typedef-decl name='vlan_offload_set_t' type-id='type-id-257' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='327' column='1' id='type-id-195'/>
    <typedef-decl name='vlan_pvid_set_t' type-id='type-id-381' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='330' column='1' id='type-id-196'/>
    <typedef-decl name='eth_queue_start_t' type-id='type-id-267' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='252' column='1' id='type-id-197'/>
    <typedef-decl name='eth_queue_stop_t' type-id='type-id-267' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='256' column='1' id='type-id-198'/>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-387'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <typedef-decl name='eth_rx_queue_setup_t' type-id='type-id-390' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='260' column='1' id='type-id-199'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <typedef-decl name='eth_queue_release_t' type-id='type-id-392' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='283' column='1' id='type-id-200'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <typedef-decl name='eth_rx_queue_count_t' type-id='type-id-394' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='286' column='1' id='type-id-201'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <typedef-decl name='eth_rx_descriptor_done_t' type-id='type-id-396' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='290' column='1' id='type-id-202'/>
    <typedef-decl name='eth_rx_descriptor_status_t' type-id='type-id-396' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='293' column='1' id='type-id-203'/>
    <typedef-decl name='eth_tx_descriptor_status_t' type-id='type-id-396' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='296' column='1' id='type-id-204'/>
    <typedef-decl name='eth_rx_enable_intr_t' type-id='type-id-267' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='275' column='1' id='type-id-205'/>
    <typedef-decl name='eth_rx_disable_intr_t' type-id='type-id-267' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='279' column='1' id='type-id-206'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-397'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
    <typedef-decl name='eth_tx_queue_setup_t' type-id='type-id-400' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='268' column='1' id='type-id-207'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-402'/>
    <typedef-decl name='eth_tx_done_cleanup_t' type-id='type-id-402' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='303' column='1' id='type-id-208'/>
    <typedef-decl name='eth_dev_led_on_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='385' column='1' id='type-id-209'/>
    <typedef-decl name='eth_dev_led_off_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='388' column='1' id='type-id-210'/>
    <class-decl name='rte_eth_fc_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='942' column='1' id='type-id-403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='high_water' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='low_water' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pause_time' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='send_xon' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mode' type-id='type-id-404' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_ctrl_frame_fwd' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='autoneg' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='949' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_fc_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='930' column='1' id='type-id-404'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FC_NONE' value='0'/>
      <enumerator name='RTE_FC_RX_PAUSE' value='1'/>
      <enumerator name='RTE_FC_TX_PAUSE' value='2'/>
      <enumerator name='RTE_FC_FULL' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <typedef-decl name='flow_ctrl_get_t' type-id='type-id-407' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='355' column='1' id='type-id-211'/>
    <typedef-decl name='flow_ctrl_set_t' type-id='type-id-407' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='359' column='1' id='type-id-212'/>
    <class-decl name='rte_eth_pfc_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='957' column='1' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='type-id-403' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='priority' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <typedef-decl name='priority_flow_ctrl_set_t' type-id='type-id-411' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='363' column='1' id='type-id-213'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <typedef-decl name='eth_uc_hash_table_set_t' type-id='type-id-413' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='404' column='1' id='type-id-214'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <typedef-decl name='eth_uc_all_hash_table_set_t' type-id='type-id-415' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='409' column='1' id='type-id-215'/>
    <class-decl name='rte_eth_mirror_conf' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='670' column='1' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rule_type' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dst_pool' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_mask' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vlan' type-id='type-id-417' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='675' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vlan_mirror' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='661' column='1' id='type-id-417'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_mask' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vlan_id' type-id='type-id-418' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='664' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='1024' id='type-id-418'>
      <subrange length='64' type-id='type-id-11' id='type-id-109'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-419'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <typedef-decl name='eth_mirror_rule_set_t' type-id='type-id-421' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='418' column='1' id='type-id-216'/>
    <typedef-decl name='eth_mirror_rule_reset_t' type-id='type-id-415' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='424' column='1' id='type-id-217'/>
    <class-decl name='rte_eth_udp_tunnel' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1023' column='1' id='type-id-422'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='udp_port' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='prot_type' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1025' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-423'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-425'/>
    <typedef-decl name='eth_udp_tunnel_port_add_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='428' column='1' id='type-id-218'/>
    <typedef-decl name='eth_udp_tunnel_port_del_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='432' column='1' id='type-id-219'/>
    <class-decl name='rte_eth_l2_tunnel_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='751' column='1' id='type-id-426'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l2_tunnel_type' type-id='type-id-427' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ether_type' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tunnel_id' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vf_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tunnel_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='965' column='1' id='type-id-427'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_TUNNEL_TYPE_NONE' value='0'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN' value='1'/>
      <enumerator name='RTE_TUNNEL_TYPE_GENEVE' value='2'/>
      <enumerator name='RTE_TUNNEL_TYPE_TEREDO' value='3'/>
      <enumerator name='RTE_TUNNEL_TYPE_NVGRE' value='4'/>
      <enumerator name='RTE_TUNNEL_TYPE_IP_IN_GRE' value='5'/>
      <enumerator name='RTE_L2_TUNNEL_TYPE_E_TAG' value='6'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN_GPE' value='7'/>
      <enumerator name='RTE_TUNNEL_TYPE_MAX' value='8'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <typedef-decl name='eth_l2_tunnel_eth_type_conf_t' type-id='type-id-430' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='494' column='1' id='type-id-220'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <typedef-decl name='eth_l2_tunnel_offload_set_t' type-id='type-id-432' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='498' column='1' id='type-id-221'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <typedef-decl name='eth_set_queue_rate_limit_t' type-id='type-id-434' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='413' column='1' id='type-id-222'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <typedef-decl name='rss_hash_update_t' type-id='type-id-437' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='377' column='1' id='type-id-223'/>
    <typedef-decl name='rss_hash_conf_get_t' type-id='type-id-437' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='381' column='1' id='type-id-224'/>
    <class-decl name='rte_eth_rss_reta_entry64' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='684' column='1' id='type-id-438'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mask' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reta' type-id='type-id-418' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='687' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <typedef-decl name='reta_update_t' type-id='type-id-441' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='367' column='1' id='type-id-225'/>
    <typedef-decl name='reta_query_t' type-id='type-id-441' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='372' column='1' id='type-id-226'/>
    <class-decl name='rte_dev_reg_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='13' column='1' id='type-id-442'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='width' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='version' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <typedef-decl name='eth_get_reg_t' type-id='type-id-445' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='471' column='1' id='type-id-227'/>
    <typedef-decl name='eth_get_eeprom_length_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='475' column='1' id='type-id-228'/>
    <class-decl name='rte_dev_eeprom_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='24' column='1' id='type-id-446'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='magic' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <typedef-decl name='eth_get_eeprom_t' type-id='type-id-449' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='478' column='1' id='type-id-229'/>
    <typedef-decl name='eth_set_eeprom_t' type-id='type-id-449' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='482' column='1' id='type-id-230'/>
    <class-decl name='rte_eth_dev_module_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='34' column='1' id='type-id-450'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eeprom_len' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <typedef-decl name='eth_get_module_info_t' type-id='type-id-453' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='486' column='1' id='type-id-231'/>
    <typedef-decl name='eth_get_module_eeprom_t' type-id='type-id-449' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='490' column='1' id='type-id-232'/>
    <enum-decl name='rte_filter_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='28' column='1' id='type-id-454'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_ETH_FILTER_NONE' value='0'/>
      <enumerator name='RTE_ETH_FILTER_MACVLAN' value='1'/>
      <enumerator name='RTE_ETH_FILTER_ETHERTYPE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_FLEXIBLE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_SYN' value='4'/>
      <enumerator name='RTE_ETH_FILTER_NTUPLE' value='5'/>
      <enumerator name='RTE_ETH_FILTER_TUNNEL' value='6'/>
      <enumerator name='RTE_ETH_FILTER_FDIR' value='7'/>
      <enumerator name='RTE_ETH_FILTER_HASH' value='8'/>
      <enumerator name='RTE_ETH_FILTER_L2_TUNNEL' value='9'/>
      <enumerator name='RTE_ETH_FILTER_GENERIC' value='10'/>
      <enumerator name='RTE_ETH_FILTER_MAX' value='11'/>
    </enum-decl>
    <enum-decl name='rte_filter_op' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='46' column='1' id='type-id-455'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_ETH_FILTER_NOP' value='0'/>
      <enumerator name='RTE_ETH_FILTER_ADD' value='1'/>
      <enumerator name='RTE_ETH_FILTER_UPDATE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_DELETE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_FLUSH' value='4'/>
      <enumerator name='RTE_ETH_FILTER_GET' value='5'/>
      <enumerator name='RTE_ETH_FILTER_SET' value='6'/>
      <enumerator name='RTE_ETH_FILTER_INFO' value='7'/>
      <enumerator name='RTE_ETH_FILTER_STATS' value='8'/>
      <enumerator name='RTE_ETH_FILTER_OP_MAX' value='9'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-457'/>
    <typedef-decl name='eth_filter_ctrl_t' type-id='type-id-457' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='506' column='1' id='type-id-233'/>
    <class-decl name='rte_eth_dcb_info' size-in-bits='16520' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1377' column='1' id='type-id-458'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='prio_tc' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='tc_bws' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='tc_queue' type-id='type-id-459' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1382' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tc_queue_mapping' size-in-bits='16384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1360' column='1' id='type-id-459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tc_rxq' type-id='type-id-460' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='tc_txq' type-id='type-id-460' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1362' column='1' id='type-id-461'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_queue' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1364' column='1'/>
      </data-member>
    </class-decl>


    <array-type-def dimensions='2' type-id='type-id-461' size-in-bits='1152' id='type-id-460'>
      <subrange length='64' type-id='type-id-11' id='type-id-109'/>

      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>


    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-464'/>
    <typedef-decl name='eth_get_dcb_info' type-id='type-id-464' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='518' column='1' id='type-id-234'/>
    <typedef-decl name='eth_timesync_enable_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='441' column='1' id='type-id-235'/>
    <typedef-decl name='eth_timesync_disable_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='444' column='1' id='type-id-236'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-465'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-466' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-467' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-468'/>
    <typedef-decl name='__time_t' type-id='type-id-468' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-466'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-468' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-467'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-469'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <typedef-decl name='eth_timesync_read_rx_timestamp_t' type-id='type-id-471' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='447' column='1' id='type-id-237'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-473'/>
    <typedef-decl name='eth_timesync_read_tx_timestamp_t' type-id='type-id-473' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='452' column='1' id='type-id-238'/>
    <typedef-decl name='__int64_t' type-id='type-id-468' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-474'/>
    <typedef-decl name='int64_t' type-id='type-id-474' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-475'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <typedef-decl name='eth_timesync_adjust_time' type-id='type-id-477' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='456' column='1' id='type-id-239'/>
    <typedef-decl name='eth_timesync_read_time' type-id='type-id-473' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='459' column='1' id='type-id-240'/>
    <qualified-type-def type-id='type-id-465' const='yes' id='type-id-478'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <typedef-decl name='eth_timesync_write_time' type-id='type-id-481' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='463' column='1' id='type-id-241'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-482'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <typedef-decl name='eth_read_clock' type-id='type-id-484' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='467' column='1' id='type-id-242'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-485'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <typedef-decl name='eth_xstats_get_by_id_t' type-id='type-id-488' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='188' column='1' id='type-id-243'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <typedef-decl name='eth_xstats_get_names_by_id_t' type-id='type-id-490' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='219' column='1' id='type-id-244'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <typedef-decl name='eth_tm_ops_get_t' type-id='type-id-492' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='512' column='1' id='type-id-245'/>
    <typedef-decl name='eth_mtr_ops_get_t' type-id='type-id-492' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='515' column='1' id='type-id-246'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-494'/>
    <typedef-decl name='eth_pool_ops_supported_t' type-id='type-id-494' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='522' column='1' id='type-id-247'/>
    <class-decl name='rte_eth_hairpin_cap' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='861' column='1' id='type-id-495'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_nb_queues' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_rx_2_tx' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_tx_2_rx' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='max_nb_desc' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='868' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-496'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-498'/>
    <typedef-decl name='eth_hairpin_cap_get_t' type-id='type-id-498' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='543' column='1' id='type-id-248'/>
    <class-decl name='rte_eth_hairpin_conf' size-in-bits='1040' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='890' column='1' id='type-id-499'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='peer_count' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='peers' type-id='type-id-500' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='892' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_hairpin_peer' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='879' column='1' id='type-id-501'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='queue' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='881' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-501' size-in-bits='1024' id='type-id-500'>
      <subrange length='32' type-id='type-id-11' id='type-id-59'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-499' const='yes' id='type-id-502'/>
    <pointer-type-def type-id='type-id-502' size-in-bits='64' id='type-id-503'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <typedef-decl name='eth_rx_hairpin_queue_setup_t' type-id='type-id-505' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='571' column='1' id='type-id-249'/>
    <typedef-decl name='eth_tx_hairpin_queue_setup_t' type-id='type-id-505' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='601' column='1' id='type-id-250'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-506'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-27'/>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-507'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-508' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-509' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-40' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-40' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-104' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-510' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-511' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-512' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-508'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-509'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='16384' id='type-id-510'>
      <subrange length='512' type-id='type-id-11' id='type-id-513'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-514'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-515' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-516' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-40' volatile='yes' id='type-id-515'/>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-516'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-40' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-517' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-26' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-519' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-517'/>

    <array-type-def dimensions='1' type-id='type-id-514' size-in-bits='196608' id='type-id-511'>
      <subrange length='512' type-id='type-id-11' id='type-id-513'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-512'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-29'/>
    <class-decl name='rte_eth_dev_cb_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-520' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-521' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_callback' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-522'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-520'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <class-decl name='rte_eth_rxtx_callback' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='758' column='1' id='type-id-523'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-524' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn' type-id='type-id-525' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='param' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='760' column='1' id='type-id-525'>
      <data-member access='private'>
        <var-decl name='rx' type-id='type-id-526' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='761' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tx' type-id='type-id-527' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='762' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <typedef-decl name='rte_rx_callback_fn' type-id='type-id-529' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1437' column='1' id='type-id-526'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <typedef-decl name='rte_tx_callback_fn' type-id='type-id-531' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1461' column='1' id='type-id-527'/>

    <array-type-def dimensions='1' type-id='type-id-524' size-in-bits='65536' id='type-id-31'>
      <subrange length='1024' type-id='type-id-11' id='type-id-158'/>

    </array-type-def>
    <enum-decl name='rte_eth_dev_state' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1467' column='1' id='type-id-32'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_ETH_DEV_UNUSED' value='0'/>
      <enumerator name='RTE_ETH_DEV_ATTACHED' value='1'/>
      <enumerator name='RTE_ETH_DEV_REMOVED' value='2'/>
    </enum-decl>
    <class-decl name='rte_flow_attr' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='75' column='1' id='type-id-532'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='group' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='priority' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='ingress' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='egress' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='transfer' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved' type-id='type-id-40' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-532' const='yes' id='type-id-533'/>
    <pointer-type-def type-id='type-id-533' size-in-bits='64' id='type-id-534'/>
    <class-decl name='rte_flow_item' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1517' column='1' id='type-id-535'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-536' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='spec' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mask' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_flow_item_type' filepath='../lib/librte_ethdev/rte_flow.h' line='118' column='1' id='type-id-536'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_END' value='0'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VOID' value='1'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_INVERT' value='2'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ANY' value='3'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PF' value='4'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VF' value='5'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PHY_PORT' value='6'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PORT_ID' value='7'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_RAW' value='8'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ETH' value='9'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VLAN' value='10'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IPV4' value='11'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IPV6' value='12'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP' value='13'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_UDP' value='14'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_TCP' value='15'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_SCTP' value='16'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VXLAN' value='17'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_E_TAG' value='18'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_NVGRE' value='19'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_MPLS' value='20'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GRE' value='21'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_FUZZY' value='22'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTP' value='23'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTPC' value='24'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTPU' value='25'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ESP' value='26'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GENEVE' value='27'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VXLAN_GPE' value='28'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ARP_ETH_IPV4' value='29'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IPV6_EXT' value='30'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6' value='31'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_NS' value='32'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_NA' value='33'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_OPT' value='34'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_OPT_SLA_ETH' value='35'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_OPT_TLA_ETH' value='36'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_MARK' value='37'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_META' value='38'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GRE_KEY' value='39'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTP_PSC' value='40'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PPPOES' value='41'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PPPOED' value='42'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PPPOE_PROTO_ID' value='43'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_NSH' value='44'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IGMP' value='45'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_AH' value='46'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_HIGIG2' value='47'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_TAG' value='48'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-535' const='yes' id='type-id-537'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' id='type-id-538'/>
    <class-decl name='rte_flow_action' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2568' column='1' id='type-id-539'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-540' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conf' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_flow_action_type' filepath='../lib/librte_ethdev/rte_flow.h' line='1550' column='1' id='type-id-540'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_END' value='0'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VOID' value='1'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PASSTHRU' value='2'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_JUMP' value='3'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_MARK' value='4'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_FLAG' value='5'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_QUEUE' value='6'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DROP' value='7'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_COUNT' value='8'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_RSS' value='9'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PF' value='10'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VF' value='11'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PHY_PORT' value='12'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PORT_ID' value='13'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_METER' value='14'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SECURITY' value='15'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_MPLS_TTL' value='16'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_DEC_MPLS_TTL' value='17'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_NW_TTL' value='18'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_DEC_NW_TTL' value='19'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_COPY_TTL_OUT' value='20'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_COPY_TTL_IN' value='21'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_POP_VLAN' value='22'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_PUSH_VLAN' value='23'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_VLAN_VID' value='24'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_VLAN_PCP' value='25'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_POP_MPLS' value='26'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_PUSH_MPLS' value='27'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VXLAN_ENCAP' value='28'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VXLAN_DECAP' value='29'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_NVGRE_ENCAP' value='30'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_NVGRE_DECAP' value='31'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_RAW_ENCAP' value='32'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_RAW_DECAP' value='33'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV4_SRC' value='34'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV4_DST' value='35'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV6_SRC' value='36'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV6_DST' value='37'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TP_SRC' value='38'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TP_DST' value='39'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_MAC_SWAP' value='40'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DEC_TTL' value='41'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TTL' value='42'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_MAC_SRC' value='43'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_MAC_DST' value='44'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_INC_TCP_SEQ' value='45'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DEC_TCP_SEQ' value='46'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_INC_TCP_ACK' value='47'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DEC_TCP_ACK' value='48'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TAG' value='49'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_META' value='50'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-539' const='yes' id='type-id-541'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <class-decl name='rte_flow_error' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2618' column='1' id='type-id-543'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-544' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cause' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='message' type-id='type-id-284' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2621' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_flow_error_type' filepath='../lib/librte_ethdev/rte_flow.h' line='2587' column='1' id='type-id-544'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_NONE' value='0'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_UNSPECIFIED' value='1'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_HANDLE' value='2'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_GROUP' value='3'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_PRIORITY' value='4'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_INGRESS' value='5'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_EGRESS' value='6'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_TRANSFER' value='7'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR' value='8'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_NUM' value='9'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_SPEC' value='10'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_LAST' value='11'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_MASK' value='12'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM' value='13'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ACTION_NUM' value='14'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ACTION_CONF' value='15'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ACTION' value='16'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-545'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-15'/>
    <class-decl name='rte_flow' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='454' column='1' id='type-id-547'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-548' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='engine' type-id='type-id-549' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rule' type-id='type-id-26' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='457' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='455' column='1' id='type-id-548'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-550' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-551' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='455' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-550'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-551'/>
    <class-decl name='ice_flow_engine' size-in-bits='576' is-struct='yes' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='441' column='1' id='type-id-552'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-553' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='init' type-id='type-id-554' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uninit' type-id='type-id-555' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='create' type-id='type-id-556' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='destroy' type-id='type-id-557' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='query_count' type-id='type-id-558' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='free' type-id='type-id-559' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-560' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='449' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='442' column='1' id='type-id-553'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-549' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-561' visibility='default' filepath='../drivers/net/ice/ice_generic_flow.h' line='442' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-549'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-561'/>
    <class-decl name='ice_adapter' size-in-bits='149504' is-struct='yes' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='401' column='1' id='type-id-562'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw' type-id='type-id-563' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79296'>
        <var-decl name='eth_dev' type-id='type-id-251' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79360'>
        <var-decl name='pf' type-id='type-id-564' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99648'>
        <var-decl name='rx_bulk_alloc_allowed' type-id='type-id-565' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99656'>
        <var-decl name='rx_vec_allowed' type-id='type-id-565' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99664'>
        <var-decl name='tx_vec_allowed' type-id='type-id-565' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99672'>
        <var-decl name='tx_simple_allowed' type-id='type-id-565' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99840'>
        <var-decl name='ptype_tbl' type-id='type-id-566' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132608'>
        <var-decl name='is_safe_mode' type-id='type-id-565' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132640'>
        <var-decl name='devargs' type-id='type-id-567' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='149152'>
        <var-decl name='active_pkg_type' type-id='type-id-568' visibility='default' filepath='../drivers/net/ice/ice_ethdev.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_hw' size-in-bits='79296' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='739' column='1' id='type-id-563'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw_addr' type-id='type-id-569' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='back' type-id='type-id-26' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='layer_info' type-id='type-id-570' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='port_info' type-id='type-id-571' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cir_profiles' type-id='type-id-572' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='eir_profiles' type-id='type-id-572' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='srl_profiles' type-id='type-id-572' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='debug_mask' type-id='type-id-573' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mac_type' type-id='type-id-574' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='fd_ctr_base' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='device_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='vendor_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='subsystem_device_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='subsystem_vendor_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='756' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='revision_id' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='632'>
        <var-decl name='pf_id' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_burst_size' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='761' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='num_tx_sched_layers' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='num_tx_sched_phys_layers' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='flattened_layers' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='max_cgds' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sw_entry_point_layer' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='max_children' type-id='type-id-576' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='agg_list' type-id='type-id-577' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='vsi_ctx' type-id='type-id-578' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50112'>
        <var-decl name='evb_veb' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50120'>
        <var-decl name='reset_ongoing' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50144'>
        <var-decl name='bus' type-id='type-id-579' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50304'>
        <var-decl name='nvm' type-id='type-id-580' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50432'>
        <var-decl name='dev_caps' type-id='type-id-581' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51520'>
        <var-decl name='func_caps' type-id='type-id-582' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52608'>
        <var-decl name='switch_info' type-id='type-id-583' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52672'>
        <var-decl name='adminq' type-id='type-id-584' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54464'>
        <var-decl name='mailboxq' type-id='type-id-584' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56256'>
        <var-decl name='api_branch' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56264'>
        <var-decl name='api_maj_ver' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56272'>
        <var-decl name='api_min_ver' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56280'>
        <var-decl name='api_patch' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56288'>
        <var-decl name='fw_branch' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56296'>
        <var-decl name='fw_maj_ver' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56304'>
        <var-decl name='fw_min_ver' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56312'>
        <var-decl name='fw_patch' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56320'>
        <var-decl name='fw_build' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56352'>
        <var-decl name='itr_gran' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56360'>
        <var-decl name='intrl_gran' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56368'>
        <var-decl name='ucast_shared' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56376'>
        <var-decl name='active_pkg_ver' type-id='type-id-586' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56408'>
        <var-decl name='active_pkg_name' type-id='type-id-587' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56664'>
        <var-decl name='active_pkg_in_nvm' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56672'>
        <var-decl name='pkg_dwnld_status' type-id='type-id-588' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56704'>
        <var-decl name='pkg_ver' type-id='type-id-586' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56736'>
        <var-decl name='pkg_name' type-id='type-id-587' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56992'>
        <var-decl name='ice_pkg_ver' type-id='type-id-586' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57024'>
        <var-decl name='ice_pkg_name' type-id='type-id-587' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57280'>
        <var-decl name='seg' type-id='type-id-589' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57344'>
        <var-decl name='pkg_copy' type-id='type-id-569' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57408'>
        <var-decl name='pkg_size' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57472'>
        <var-decl name='tnl' type-id='type-id-590' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60608'>
        <var-decl name='blk' type-id='type-id-591' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78208'>
        <var-decl name='fl_profs_locks' type-id='type-id-592' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78400'>
        <var-decl name='fl_profs' type-id='type-id-593' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78720'>
        <var-decl name='fdir_active_fltr' type-id='type-id-10' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78752'>
        <var-decl name='fdir_fltr_lock' type-id='type-id-594' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78784'>
        <var-decl name='fdir_list_head' type-id='type-id-577' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78848'>
        <var-decl name='fdir_fltr_cnt' type-id='type-id-595' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79104'>
        <var-decl name='fdir_prof' type-id='type-id-596' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79168'>
        <var-decl name='fdir_perfect_fltr' type-id='type-id-597' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79200'>
        <var-decl name='rss_locks' type-id='type-id-594' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79232'>
        <var-decl name='rss_list_head' type-id='type-id-577' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='860' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u8' type-id='type-id-104' filepath='../drivers/net/ice/base/ice_osdep.h' line='32' column='1' id='type-id-575'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-569'/>
    <class-decl name='ice_aqc_layer_props' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1201' column='1' id='type-id-598'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='logical_layer' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='chunk_size' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_device_nodes' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_pf_nodes' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rsvd0' type-id='type-id-599' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='max_sibl_grp_sz' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_cir_rl_profiles' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='max_eir_rl_profiles' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_srl_profiles' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='rsvd1' type-id='type-id-600' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1211' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='32' id='type-id-599'>
      <subrange length='4' type-id='type-id-11' id='type-id-144'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='112' id='type-id-600'>
      <subrange length='14' type-id='type-id-11' id='type-id-601'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-598' size-in-bits='64' id='type-id-570'/>
    <class-decl name='ice_port_info' size-in-bits='13440' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='696' column='1' id='type-id-602'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-603' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hw' type-id='type-id-604' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_node_teid' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sw_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='pf_vf_num' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='port_state' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='lport' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='dflt_tx_vsi_rule_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dflt_tx_vsi_num' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dflt_rx_vsi_rule_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dflt_rx_vsi_num' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='fc' type-id='type-id-605' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='mac' type-id='type-id-606' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='phy' type-id='type-id-607' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='sched_lock' type-id='type-id-594' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='sib_head' type-id='type-id-608' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='rl_prof_list' type-id='type-id-609' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='tc_node_bw_t_info' type-id='type-id-610' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='local_dcbx_cfg' type-id='type-id-611' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10272'>
        <var-decl name='remote_dcbx_cfg' type-id='type-id-611' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11840'>
        <var-decl name='desired_dcbx_cfg' type-id='type-id-611' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='dcbx_status' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='is_sw_lldp' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='is_vf' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_sched_node' size-in-bits='512' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='501' column='1' id='type-id-612'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-603' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sibling' type-id='type-id-603' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='children' type-id='type-id-613' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='info' type-id='type-id-614' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='agg_id' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vsi_handle' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='in_use' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='440'>
        <var-decl name='tx_sched_layer' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='num_children' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='tc_num' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='owner' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='512' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-603'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-613'/>
    <class-decl name='ice_aqc_txsched_elem_data' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1059' column='1' id='type-id-614'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_teid' type-id='type-id-40' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1060' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='node_teid' type-id='type-id-40' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-615' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1062' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_aqc_txsched_elem' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1028' column='1' id='type-id-615'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elem_type' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1029' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='valid_sections' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1037' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='generic' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1042' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='flags' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1051' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cir_bw' type-id='type-id-616' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='eir_bw' type-id='type-id-616' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='srl_id' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved2' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1056' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_aqc_elem_info_bw' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1023' column='1' id='type-id-616'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bw_profile_idx' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bw_alloc' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1025' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u32' type-id='type-id-40' filepath='../drivers/net/ice/base/ice_osdep.h' line='36' column='1' id='type-id-585'/>
    <pointer-type-def type-id='type-id-563' size-in-bits='64' id='type-id-604'/>
    <class-decl name='ice_fc_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='473' column='1' id='type-id-605'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='current_mode' type-id='type-id-617' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='req_mode' type-id='type-id-617' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='ice_fc_mode' filepath='../drivers/net/ice/base/ice_type.h' line='167' column='1' id='type-id-617'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ICE_FC_NONE' value='0'/>
      <enumerator name='ICE_FC_RX_PAUSE' value='1'/>
      <enumerator name='ICE_FC_TX_PAUSE' value='2'/>
      <enumerator name='ICE_FC_FULL' value='3'/>
      <enumerator name='ICE_FC_PFC' value='4'/>
      <enumerator name='ICE_FC_DFLT' value='5'/>
    </enum-decl>
    <class-decl name='ice_mac_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='410' column='1' id='type-id-606'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lan_addr' type-id='type-id-618' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='perm_addr' type-id='type-id-618' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='port_addr' type-id='type-id-618' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='wol_addr' type-id='type-id-618' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='414' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='48' id='type-id-618'>
      <subrange length='6' type-id='type-id-11' id='type-id-156'/>

    </array-type-def>
    <class-decl name='ice_phy_info' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='265' column='1' id='type-id-607'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_info' type-id='type-id-619' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link_info_old' type-id='type-id-619' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='phy_type_low' type-id='type-id-573' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='phy_type_high' type-id='type-id-573' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='media_type' type-id='type-id-620' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='get_link_info' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='curr_user_speed_req' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curr_user_fec_req' type-id='type-id-621' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='curr_user_fc_req' type-id='type-id-617' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='curr_user_phy_cfg' type-id='type-id-622' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='278' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_link_status' size-in-bits='320' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='227' column='1' id='type-id-619'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phy_type_low' type-id='type-id-573' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phy_type_high' type-id='type-id-573' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='topo_media_conflict' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='max_frame_size' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='link_speed' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='req_speeds' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lse_ena' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='link_info' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='an_info' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='ext_info' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fec_info' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='pacing' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='module_type' type-id='type-id-623' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='244' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u64' type-id='type-id-13' filepath='../drivers/net/ice/base/ice_osdep.h' line='38' column='1' id='type-id-573'/>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='24' id='type-id-623'>
      <subrange length='3' type-id='type-id-11' id='type-id-624'/>

    </array-type-def>
    <enum-decl name='ice_media_type' filepath='../drivers/net/ice/base/ice_type.h' line='212' column='1' id='type-id-620'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ICE_MEDIA_UNKNOWN' value='0'/>
      <enumerator name='ICE_MEDIA_FIBER' value='1'/>
      <enumerator name='ICE_MEDIA_BASET' value='2'/>
      <enumerator name='ICE_MEDIA_BACKPLANE' value='3'/>
      <enumerator name='ICE_MEDIA_DA' value='4'/>
    </enum-decl>
    <enum-decl name='ice_fec_mode' filepath='../drivers/net/ice/base/ice_type.h' line='182' column='1' id='type-id-621'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ICE_FEC_NONE' value='0'/>
      <enumerator name='ICE_FEC_RS' value='1'/>
      <enumerator name='ICE_FEC_BASER' value='2'/>
      <enumerator name='ICE_FEC_AUTO' value='3'/>
    </enum-decl>
    <class-decl name='ice_aqc_set_phy_cfg_data' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1403' column='1' id='type-id-622'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phy_type_low' type-id='type-id-13' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phy_type_high' type-id='type-id-13' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='caps' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='low_power_ctrl' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='eee_cap' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='eeer_value' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='link_fec_opt' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='rsvd1' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='1419' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_lock' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='197' column='1' id='type-id-594'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='type-id-625' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='198' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-625' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='30' column='1' id='type-id-626'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-627' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-10' volatile='yes' id='type-id-627'/>
    <typedef-decl name='rte_spinlock_t' type-id='type-id-626' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='32' column='1' id='type-id-625'/>


    <array-type-def dimensions='2' type-id='type-id-603' size-in-bits='1088' id='type-id-608'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

      <subrange length='9' type-id='type-id-11' id='type-id-628'/>

    </array-type-def>
    <class-decl name='ice_list_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='305' column='1' id='type-id-577'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lh_first' type-id='type-id-629' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='305' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_list_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='301' column='1' id='type-id-630'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-631' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='302' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='302' column='1' id='type-id-631'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='le_next' type-id='type-id-629' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='le_prev' type-id='type-id-632' visibility='default' filepath='../drivers/net/ice/base/ice_osdep.h' line='302' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-630' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-632'/>

    <array-type-def dimensions='1' type-id='type-id-577' size-in-bits='576' id='type-id-609'>
      <subrange length='9' type-id='type-id-11' id='type-id-628'/>

    </array-type-def>
    <class-decl name='ice_bw_type_info' size-in-bits='224' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='618' column='1' id='type-id-633'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bw_t_bitmap' type-id='type-id-597' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='generic' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cir_bw' type-id='type-id-634' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='eir_bw' type-id='type-id-634' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='shared_bw' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='623' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ice_bitmap_t' type-id='type-id-585' filepath='../drivers/net/ice/base/ice_bitops.h' line='9' column='1' id='type-id-635'/>

    <array-type-def dimensions='1' type-id='type-id-635' size-in-bits='32' id='type-id-597'>
      <subrange length='1' type-id='type-id-11' id='type-id-636'/>

    </array-type-def>
    <class-decl name='ice_bw' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='613' column='1' id='type-id-634'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bw' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bw_alloc' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='615' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-633' size-in-bits='1792' id='type-id-610'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>
    <class-decl name='ice_dcbx_cfg' size-in-bits='1568' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='682' column='1' id='type-id-611'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numapps' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tlv_status' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='etscfg' type-id='type-id-637' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='etsrec' type-id='type-id-637' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='pfc' type-id='type-id-638' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='app' type-id='type-id-639' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='dcbx_mode' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='app_mode' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_dcb_ets_cfg' size-in-bits='216' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='644' column='1' id='type-id-637'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='willing' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='cbs' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='maxtcs' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='prio_table' type-id='type-id-640' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='tcbwtable' type-id='type-id-640' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='tsatable' type-id='type-id-640' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='650' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='64' id='type-id-640'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>
    <class-decl name='ice_dcb_pfc_cfg' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='654' column='1' id='type-id-638'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='willing' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mbc' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pfccap' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='pfcena' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='658' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_dcb_app_priority_table' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='662' column='1' id='type-id-641'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prot_id' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='priority' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='selector' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='665' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-641' size-in-bits='1024' id='type-id-639'>
      <subrange length='32' type-id='type-id-11' id='type-id-59'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-571'/>
    <class-decl name='ice_sched_rl_profile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-642'/>
    <pointer-type-def type-id='type-id-642' size-in-bits='64' id='type-id-643'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-572'/>
    <enum-decl name='ice_mac_type' filepath='../drivers/net/ice/base/ice_type.h' line='206' column='1' id='type-id-574'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ICE_MAC_UNKNOWN' value='0'/>
      <enumerator name='ICE_MAC_GENERIC' value='1'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='144' id='type-id-576'>
      <subrange length='9' type-id='type-id-11' id='type-id-628'/>

    </array-type-def>
    <class-decl name='ice_vsi_ctx' size-in-bits='4736' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='27' column='1' id='type-id-644'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vsi_num' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vsis_allocd' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vsis_unallocated' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='flags' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='info' type-id='type-id-645' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sched' type-id='type-id-646' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='alloc_from_pool' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4048'>
        <var-decl name='num_lan_q_entries' type-id='type-id-647' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='lan_q_ctx' type-id='type-id-648' visibility='default' filepath='../drivers/net/ice/base/ice_switch.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_aqc_vsi_props' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='411' column='1' id='type-id-645'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='valid_sections' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sw_id' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='sw_flags' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sw_flags2' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='veb_stat_id' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='sec_flags' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='sec_reserved' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pvid' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='pvlan_reserved' type-id='type-id-649' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vlan_flags' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='pvlan_reserved2' type-id='type-id-623' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ingress_table' type-id='type-id-40' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='egress_table' type-id='type-id-40' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='outer_tag' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='outer_tag_flags' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='outer_tag_reserved' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mapping_flags' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='q_mapping' type-id='type-id-149' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='tc_mapping' type-id='type-id-650' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='q_opt_rss' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='632'>
        <var-decl name='q_opt_tc' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='q_opt_flags' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='q_opt_reserved' type-id='type-id-623' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='outer_up_table' type-id='type-id-40' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sect_10_reserved' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='fd_options' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='max_fd_fltr_dedicated' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='max_fd_fltr_shared' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fd_def_q' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='fd_report_opt' type-id='type-id-5' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='pasid_id' type-id='type-id-40' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reserved' type-id='type-id-651' visibility='default' filepath='../drivers/net/ice/base/ice_adminq_cmd.h' line='562' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='16' id='type-id-649'>
      <subrange length='2' type-id='type-id-11' id='type-id-92'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='128' id='type-id-650'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='192' id='type-id-651'>
      <subrange length='24' type-id='type-id-11' id='type-id-153'/>

    </array-type-def>
    <class-decl name='ice_sched_vsi_info' size-in-bits='2944' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='635' column='1' id='type-id-646'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vsi_node' type-id='type-id-652' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ag_node' type-id='type-id-652' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='max_lanq' type-id='type-id-647' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bw_t_info' type-id='type-id-610' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='640' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-603' size-in-bits='512' id='type-id-652'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='128' id='type-id-647'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>
    <class-decl name='ice_q_ctx' size-in-bits='288' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='627' column='1' id='type-id-653'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='q_handle' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='q_teid' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bw_t_info' type-id='type-id-633' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='631' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-654'/>

    <array-type-def dimensions='1' type-id='type-id-654' size-in-bits='512' id='type-id-648'>
      <subrange length='8' type-id='type-id-11' id='type-id-131'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-655'/>

    <array-type-def dimensions='1' type-id='type-id-655' size-in-bits='49152' id='type-id-578'>
      <subrange length='768' type-id='type-id-11' id='type-id-656'/>

    </array-type-def>
    <class-decl name='ice_bus_info' size-in-bits='160' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='462' column='1' id='type-id-579'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='speed' type-id='type-id-657' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='width' type-id='type-id-658' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-659' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='domain_num' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='device' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='bus_num' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='469' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='ice_pcie_bus_speed' filepath='../drivers/net/ice/base/ice_type.h' line='426' column='1' id='type-id-657'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ice_pcie_speed_unknown' value='255'/>
      <enumerator name='ice_pcie_speed_2_5GT' value='20'/>
      <enumerator name='ice_pcie_speed_5_0GT' value='21'/>
      <enumerator name='ice_pcie_speed_8_0GT' value='22'/>
      <enumerator name='ice_pcie_speed_16_0GT' value='23'/>
    </enum-decl>
    <enum-decl name='ice_pcie_link_width' filepath='../drivers/net/ice/base/ice_type.h' line='435' column='1' id='type-id-658'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ice_pcie_lnk_width_resrv' value='0'/>
      <enumerator name='ice_pcie_lnk_x1' value='1'/>
      <enumerator name='ice_pcie_lnk_x2' value='2'/>
      <enumerator name='ice_pcie_lnk_x4' value='4'/>
      <enumerator name='ice_pcie_lnk_x8' value='8'/>
      <enumerator name='ice_pcie_lnk_x12' value='12'/>
      <enumerator name='ice_pcie_lnk_x16' value='16'/>
      <enumerator name='ice_pcie_lnk_x32' value='32'/>
      <enumerator name='ice_pcie_lnk_width_unknown' value='255'/>
    </enum-decl>
    <enum-decl name='ice_bus_type' filepath='../drivers/net/ice/base/ice_type.h' line='418' column='1' id='type-id-659'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ice_bus_unknown' value='0'/>
      <enumerator name='ice_bus_pci_express' value='1'/>
      <enumerator name='ice_bus_embedded' value='2'/>
      <enumerator name='ice_bus_reserved' value='3'/>
    </enum-decl>
    <class-decl name='ice_nvm_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='479' column='1' id='type-id-580'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eetrack' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='oem_ver' type-id='type-id-585' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sr_words' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ver' type-id='type-id-2' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blank_nvm_mode' type-id='type-id-575' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='484' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ice_hw_dev_caps' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='402' column='1' id='type-id-581'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common_cap' type-id='type-id-660' visibility='default' filepath='../drivers/net/ice/base/ice_type.h' line='403' column='1'/>
