<abi-corpus path='gcc//drivers/librte_rawdev_dpaa2_qdma.so.20.0' architecture='elf-amd-x86_64' soname='librte_rawdev_dpaa2_qdma.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_rawdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_mempool_dpaa2.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_bus_fslmc.so.20.0'/>
    <dependency name='librte_common_dpaax.so.20.0'/>
    <dependency name='librte_eventdev.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='librte_timer.so.20.0'/>
    <dependency name='librte_cryptodev.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_qdma_attr_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_configure' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_destroy' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_init' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_reset' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_start' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_stop' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_dequeue' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_dequeue_multi' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_destroy' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_enqueue' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_enqueue_multi' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_qdma_vq_stats' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='dpaa2_qdma_logtype' type-id='type-id-1' visibility='default' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma_logs.h' line='12' column='1'/>
    <type-decl name='void' id='type-id-2'/>
    <function-decl name='rte_qdma_destroy' mangled-name='rte_qdma_destroy' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_destroy@@DPDK_20.0'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rte_qdma_stop' mangled-name='rte_qdma_stop' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_stop@@DPDK_20.0'>
      <return type-id='type-id-2'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-3'/>
    <typedef-decl name='__uint16_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-4'/>
    <typedef-decl name='uint16_t' type-id='type-id-4' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-5'/>
    <function-decl name='rte_qdma_vq_destroy' mangled-name='rte_qdma_vq_destroy' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_destroy@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='vq_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1109' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_qdma_vq_stats' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='119' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exclusive_hw_queue' type-id='type-id-7' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lcore_id' type-id='type-id-8' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_enqueues' type-id='type-id-9' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_dequeues' type-id='type-id-9' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_pending_jobs' type-id='type-id-9' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-10'/>
    <typedef-decl name='__uint8_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-11'/>
    <typedef-decl name='uint8_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-7'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-12'/>
    <typedef-decl name='__uint32_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-13'/>
    <typedef-decl name='uint32_t' type-id='type-id-13' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-8'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-14'/>
    <typedef-decl name='__uint64_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-15'/>
    <typedef-decl name='uint64_t' type-id='type-id-15' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-16'/>
    <function-decl name='rte_qdma_vq_stats' mangled-name='rte_qdma_vq_stats' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_stats@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='vq_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1093' column='1'/>
      <parameter type-id='type-id-16' name='vq_status' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1094' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <class-decl name='rte_qdma_job' size-in-bits='320' is-struct='yes' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='133' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src' type-id='type-id-9' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dest' type-id='type-id-9' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-8' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='type-id-8' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cnxt' type-id='type-id-9' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='type-id-5' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='vq_id' type-id='type-id-5' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
    <function-decl name='rte_qdma_vq_dequeue' mangled-name='rte_qdma_vq_dequeue' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_dequeue@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='vq_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1080' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <function-decl name='rte_qdma_vq_dequeue_multi' mangled-name='rte_qdma_vq_dequeue_multi' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_dequeue_multi@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='vq_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1009' column='1'/>
      <parameter type-id='type-id-19' name='job' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1010' column='1'/>
      <parameter type-id='type-id-5' name='nb_jobs' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='1011' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_qdma_vq_enqueue' mangled-name='rte_qdma_vq_enqueue' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_enqueue@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='vq_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='761' column='1'/>
      <parameter type-id='type-id-18' name='job' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='762' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_qdma_vq_enqueue_multi' mangled-name='rte_qdma_vq_enqueue_multi' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_enqueue_multi@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='vq_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='728' column='1'/>
      <parameter type-id='type-id-19' name='job' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='729' column='1'/>
      <parameter type-id='type-id-5' name='nb_jobs' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='730' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_qdma_vq_create' mangled-name='rte_qdma_vq_create' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_vq_create@@DPDK_20.0'>
      <parameter type-id='type-id-8' name='lcore_id' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='576' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='576' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_qdma_start' mangled-name='rte_qdma_start' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_start@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_qdma_config' size-in-bits='96' is-struct='yes' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='64' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_hw_queues_per_core' type-id='type-id-5' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_vqs' type-id='type-id-5' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mode' type-id='type-id-7' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='format' type-id='type-id-7' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fle_pool_count' type-id='type-id-1' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <function-decl name='rte_qdma_configure' mangled-name='rte_qdma_configure' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_configure@@DPDK_20.0'>
      <parameter type-id='type-id-21' name='qdma_config' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='495' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_qdma_reset' mangled-name='rte_qdma_reset' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_reset@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_qdma_attr' size-in-bits='16' is-struct='yes' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='58' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_hw_queues' type-id='type-id-5' visibility='default' filepath='../drivers/raw/dpaa2_qdma/rte_pmd_dpaa2_qdma.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-23'/>
    <function-decl name='rte_qdma_attr_get' mangled-name='rte_qdma_attr_get' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_attr_get@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='qdma_attr' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='433' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rte_qdma_init' mangled-name='rte_qdma_init' filepath='../drivers/raw/dpaa2_qdma/dpaa2_qdma.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_qdma_init@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
