<abi-corpus path='gcc//drivers/librte_bus_vmbus.so.20.0' architecture='elf-amd-x86_64' soname='librte_bus_vmbus.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_vmbus_chan_close' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_open' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_recv' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_recv_raw' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_rx_empty' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_send' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_send_sglist' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_signal_read' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_chan_signal_tx' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_irq_mask' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_irq_read' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_irq_unmask' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_map_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_max_channels' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_probe' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_register' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_scan' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_set_latency' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_sub_channel_index' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_subchan_open' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_unmap_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vmbus_unregister' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/bus/vmbus/vmbus_common.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='vmbus_logtype_bus' type-id='type-id-1' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='21' column='1'/>
    <class-decl name='rte_vmbus_bus' size-in-bits='1280' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='109' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bus' type-id='type-id-3' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='device_list' type-id='type-id-4' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='driver_list' type-id='type-id-5' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-9' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-11' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-14' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-15' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-16' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-17' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-22' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
    <type-decl name='char' size-in-bits='8' id='type-id-23'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-26'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-26' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-8'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-26' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-9'/>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-29' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-30' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-33' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-35' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-36' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-37' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-30'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-41' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-42' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-44' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-47' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-47'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-48'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-42'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-43'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-49'/>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='512' id='type-id-44'>
      <subrange length='64' type-id='type-id-49' id='type-id-50'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-45'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-51' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-51'/>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-46'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <type-decl name='void' id='type-id-55'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-59'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-61' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-63' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-11'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-63' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-65'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-65' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-13'/>
    <typedef-decl name='__uint64_t' type-id='type-id-49' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-66'/>
    <typedef-decl name='uint64_t' type-id='type-id-66' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-67'/>
    <typedef-decl name='size_t' type-id='type-id-49' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-68'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-70' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-14'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-70' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-15'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-71' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-71'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-72'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-74' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-17'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-79' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-18'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-63' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-19'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-81' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-20'/>
    <class-decl name='rte_vmbus_device_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='41' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-82' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-83' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vmbus_device' size-in-bits='215424' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='64' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-85' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver' type-id='type-id-86' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device' type-id='type-id-27' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='device_id' type-id='type-id-87' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='class_id' type-id='type-id-87' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='relid' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='monitor_id' type-id='type-id-89' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='uio_num' type-id='type-id-1' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='int_page' type-id='type-id-90' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='primary' type-id='type-id-91' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='monitor_page' type-id='type-id-92' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='intr_handle' type-id='type-id-93' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='214464'>
        <var-decl name='resource' type-id='type-id-94' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='65' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-82' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-83' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <class-decl name='rte_vmbus_driver' size-in-bits='640' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='95' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-96' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver' type-id='type-id-34' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bus' type-id='type-id-97' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='probe' type-id='type-id-98' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='remove' type-id='type-id-99' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='id_table' type-id='type-id-100' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='96' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-101' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-102' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-97'/>
    <typedef-decl name='vmbus_probe_t' type-id='type-id-103' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='84' column='1' id='type-id-104'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-98'/>
    <typedef-decl name='vmbus_remove_t' type-id='type-id-105' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='90' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-99'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-107'/>

    <array-type-def dimensions='1' type-id='type-id-107' size-in-bits='128' id='type-id-108'>
      <subrange length='16' type-id='type-id-49' id='type-id-109'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-86'/>
    <typedef-decl name='rte_uuid_t' type-id='type-id-108' filepath='../lib/librte_eal/common/include/rte_uuid.h' line='22' column='1' id='type-id-87'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-111'/>
    <typedef-decl name='__uint32_t' type-id='type-id-111' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-112'/>
    <typedef-decl name='uint32_t' type-id='type-id-112' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-88'/>
    <typedef-decl name='__uint8_t' type-id='type-id-107' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-113'/>
    <typedef-decl name='uint8_t' type-id='type-id-113' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-89'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-90'/>
    <class-decl name='vmbus_channel' size-in-bits='576' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='58' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subchannel_list' type-id='type-id-115' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-116' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device' type-id='type-id-117' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rxbr' type-id='type-id-118' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='txbr' type-id='type-id-118' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='relid' type-id='type-id-119' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='subchannel_id' type-id='type-id-119' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='monitor_id' type-id='type-id-89' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='59' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-91' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-120' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-120'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='60' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-91' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-117'/>
    <class-decl name='vmbus_br' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='26' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vbr' type-id='type-id-122' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dsize' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='windex' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vmbus_bufring' size-in-bits='32768' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='66' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='windex' type-id='type-id-124' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rindex' type-id='type-id-124' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imask' type-id='type-id-124' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pending_send' type-id='type-id-124' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved1' type-id='type-id-125' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='feature_bits' type-id='type-id-126' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='reserved2' type-id='type-id-127' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='data' type-id='type-id-128' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-88' volatile='yes' id='type-id-124'/>

    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='384' id='type-id-125'>
      <subrange length='12' type-id='type-id-49' id='type-id-129'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='96' column='1' id='type-id-126'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='value' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='100' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='97' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='feat_pending_send_sz' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='98' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='32224' id='type-id-127'>
      <subrange length='4028' type-id='type-id-49' id='type-id-131'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='infinite' id='type-id-128'>
      <subrange length='infinite' type-id='type-id-49' id='type-id-132'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-122'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-133'/>
    <typedef-decl name='__uint16_t' type-id='type-id-133' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-134'/>
    <typedef-decl name='uint16_t' type-id='type-id-134' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-119'/>
    <class-decl name='vmbus_mon_page' size-in-bits='32768' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='47' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsvd1' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trigs' type-id='type-id-136' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rsvd2' type-id='type-id-137' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='lat' type-id='type-id-138' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='rsvd3' type-id='type-id-139' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='param' type-id='type-id-140' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='rsvd4' type-id='type-id-141' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vmbus_mon_trig' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='30' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pending' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='armed' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='32' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-142' size-in-bits='256' id='type-id-136'>
      <subrange length='4' type-id='type-id-49' id='type-id-143'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='4288' id='type-id-137'>
      <subrange length='536' type-id='type-id-49' id='type-id-144'/>

    </array-type-def>


    <array-type-def dimensions='2' type-id='type-id-119' size-in-bits='576' id='type-id-138'>
      <subrange length='4' type-id='type-id-49' id='type-id-143'/>

      <subrange length='32' type-id='type-id-49' id='type-id-145'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='2048' id='type-id-139'>
      <subrange length='256' type-id='type-id-49' id='type-id-146'/>

    </array-type-def>
    <class-decl name='hyperv_mon_param' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='41' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connid' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='evtflag_ofs' type-id='type-id-119' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rsvd' type-id='type-id-119' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='44' column='1'/>
      </data-member>
    </class-decl>


    <array-type-def dimensions='2' type-id='type-id-147' size-in-bits='2304' id='type-id-140'>
      <subrange length='4' type-id='type-id-49' id='type-id-143'/>

      <subrange length='32' type-id='type-id-49' id='type-id-145'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='15872' id='type-id-141'>
      <subrange length='1984' type-id='type-id-49' id='type-id-148'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-92'/>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-150' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-88' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-88' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-89' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-151' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-152' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-153' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-149'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-150'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='16384' id='type-id-151'>
      <subrange length='512' type-id='type-id-49' id='type-id-154'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-124' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-156' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-88' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-157' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-159' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-157'/>

    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='196608' id='type-id-152'>
      <subrange length='512' type-id='type-id-49' id='type-id-154'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-153'/>
    <class-decl name='rte_mem_resource' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='80' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phys_addr' type-id='type-id-67' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-67' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='83' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='960' id='type-id-94'>
      <subrange length='5' type-id='type-id-49' id='type-id-161'/>

    </array-type-def>
    <class-decl name='rte_vmbus_driver_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='42' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-101' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-102' visibility='default' filepath='../drivers/bus/vmbus/rte_bus_vmbus.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='rte_vmbus_bus' type-id='type-id-2' visibility='default' filepath='../drivers/bus/vmbus/private.h' line='19' column='1'/>
    <function-decl name='rte_vmbus_unregister' mangled-name='rte_vmbus_unregister' filepath='../drivers/bus/vmbus/vmbus_common.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-101' name='driver' filepath='../drivers/bus/vmbus/vmbus_common.c' line='241' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_vmbus_register' mangled-name='rte_vmbus_register' filepath='../drivers/bus/vmbus/vmbus_common.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_register@@DPDK_20.0'>
      <parameter type-id='type-id-101' name='driver' filepath='../drivers/bus/vmbus/vmbus_common.c' line='230' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_vmbus_probe' mangled-name='rte_vmbus_probe' filepath='../drivers/bus/vmbus/vmbus_common.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_probe@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-73'>
      <return type-id='type-id-72'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-25'>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-57'>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-62'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-69'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-105'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-80'>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-60'>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-55'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-56'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/bus/vmbus/vmbus_channel.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_vmbus_chan_close' mangled-name='rte_vmbus_chan_close' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_close@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='403' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <function-decl name='rte_vmbus_sub_channel_index' mangled-name='rte_vmbus_sub_channel_index' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_sub_channel_index@@DPDK_20.0'>
      <parameter type-id='type-id-163' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='398' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='rte_vmbus_subchan_open' mangled-name='rte_vmbus_subchan_open' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_subchan_open@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='primary' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='383' column='1'/>
      <parameter type-id='type-id-120' name='new_chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='384' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vmbus_max_channels' mangled-name='rte_vmbus_max_channels' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_max_channels@@DPDK_20.0'>
      <parameter type-id='type-id-117' name='device' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='374' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vmbus_chan_open' mangled-name='rte_vmbus_chan_open' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_open@@DPDK_20.0'>
      <parameter type-id='type-id-82' name='device' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='352' column='1'/>
      <parameter type-id='type-id-120' name='new_chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='353' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vmbus_chan_recv_raw' mangled-name='rte_vmbus_chan_recv_raw' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_recv_raw@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='283' column='1'/>
      <parameter type-id='type-id-56' name='data' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='284' column='1'/>
      <parameter type-id='type-id-90' name='len' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='284' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-164'/>
    <function-decl name='rte_vmbus_chan_recv' mangled-name='rte_vmbus_chan_recv' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_recv@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='236' column='1'/>
      <parameter type-id='type-id-56' name='data' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='236' column='1'/>
      <parameter type-id='type-id-90' name='len' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='236' column='1'/>
      <parameter type-id='type-id-164' name='request_id' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='237' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vmbus_chan_signal_read' mangled-name='rte_vmbus_chan_signal_read' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_signal_read@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='206' column='1'/>
      <parameter type-id='type-id-88' name='bytes_read' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='206' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <type-decl name='bool' size-in-bits='8' id='type-id-165'/>
    <function-decl name='rte_vmbus_chan_rx_empty' mangled-name='rte_vmbus_chan_rx_empty' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_rx_empty@@DPDK_20.0'>
      <parameter type-id='type-id-163' name='channel' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='198' column='1'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <class-decl name='vmbus_gpa' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='147' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ofs' type-id='type-id-88' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='page' type-id='type-id-67' visibility='default' filepath='../drivers/bus/vmbus/rte_vmbus_reg.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-168'/>
    <function-decl name='rte_vmbus_chan_send_sglist' mangled-name='rte_vmbus_chan_send_sglist' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_send_sglist@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='155' column='1'/>
      <parameter type-id='type-id-167' name='sg' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='156' column='1'/>
      <parameter type-id='type-id-88' name='sglen' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='156' column='1'/>
      <parameter type-id='type-id-56' name='data' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='157' column='1'/>
      <parameter type-id='type-id-88' name='dlen' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='157' column='1'/>
      <parameter type-id='type-id-67' name='xactid' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='158' column='1'/>
      <parameter type-id='type-id-168' name='need_sig' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='158' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vmbus_chan_send' mangled-name='rte_vmbus_chan_send' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_send@@DPDK_20.0'>
      <parameter type-id='type-id-91' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='112' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='112' column='1'/>
      <parameter type-id='type-id-56' name='data' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='113' column='1'/>
      <parameter type-id='type-id-88' name='dlen' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='113' column='1'/>
      <parameter type-id='type-id-67' name='xactid' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='114' column='1'/>
      <parameter type-id='type-id-88' name='flags' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='114' column='1'/>
      <parameter type-id='type-id-168' name='need_sig' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='114' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vmbus_chan_signal_tx' mangled-name='rte_vmbus_chan_signal_tx' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_chan_signal_tx@@DPDK_20.0'>
      <parameter type-id='type-id-163' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='95' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_vmbus_set_latency' mangled-name='rte_vmbus_set_latency' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vmbus_set_latency@@DPDK_20.0'>
      <parameter type-id='type-id-117' name='dev' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='66' column='1'/>
      <parameter type-id='type-id-163' name='chan' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='67' column='1'/>
      <parameter type-id='type-id-88' name='latency' filepath='../drivers/bus/vmbus/vmbus_channel.c' line='68' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
  </abi-instr>
