<abi-corpus path='gcc//drivers/librte_pmd_bbdev_fpga_lte_fec.so.20.0' architecture='elf-amd-x86_64' soname='librte_pmd_bbdev_fpga_lte_fec.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_bbdev.so.0.200'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_bus_vdev.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='fpga_lte_fec_configure' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <class-decl name='fpga_lte_fec_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='33' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pf_mode_en' type-id='type-id-6' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='vf_ul_queues_number' type-id='type-id-7' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='vf_dl_queues_number' type-id='type-id-7' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='ul_bandwidth' type-id='type-id-8' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='dl_bandwidth' type-id='type-id-8' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='ul_load_balance' type-id='type-id-8' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dl_load_balance' type-id='type-id-8' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='flr_time_out' type-id='type-id-9' visibility='default' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='bool' size-in-bits='8' id='type-id-6'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-10'/>
    <typedef-decl name='__uint8_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-11'/>
    <typedef-decl name='uint8_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-8'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='64' id='type-id-7'>
      <subrange length='8' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-14'/>
    <typedef-decl name='__uint16_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-15'/>
    <typedef-decl name='uint16_t' type-id='type-id-15' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-9'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <function-decl name='fpga_lte_fec_configure' mangled-name='fpga_lte_fec_configure' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.c' line='2450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fpga_lte_fec_configure@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='dev_name' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.c' line='2450' column='1'/>
      <parameter type-id='type-id-17' name='conf' filepath='../drivers/baseband/fpga_lte_fec/fpga_lte_fec.c' line='2451' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
