<abi-corpus path='gcc//drivers/librte_pmd_i40e.so.20.0' architecture='elf-amd-x86_64' soname='librte_pmd_i40e.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_vdev.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_pmd_i40e_add_vf_mac_addr' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_flow_add_del_packet_template' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rte_pmd_i40e_get_ddp_info' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_get_ddp_list' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_get_vf_stats' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_inset_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_inset_set' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_ping_vfs' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_process_ddp_package' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_ptype_mapping_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_ptype_mapping_replace' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_ptype_mapping_reset' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_ptype_mapping_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_query_vfid_by_mac' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_reset_vf_stats' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_rss_queue_region_conf' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_switch_dev' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_tc_strict_prio' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_tx_loopback' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_broadcast' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_mac_addr' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_mac_anti_spoof' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_max_bw' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_multicast_promisc' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_tc_bw_alloc' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_tc_max_bw' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_unicast_promisc' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_vlan_anti_spoof' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_vlan_filter' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_vlan_insert' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_vlan_stripq' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pmd_i40e_set_vf_vlan_tag' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/i40e/base/i40e_common.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='i40e_rx_ptype_decoded' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='941' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ptype' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='known' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='outer_ip' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='outer_ip_ver' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='outer_frag' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='tunnel_type' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='tunnel_end_prot' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='tunnel_end_frag' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='inner_prot' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='payload_layer' type-id='type-id-2' visibility='default' filepath='../drivers/net/i40e/base/i40e_type.h' line='951' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-3'/>
    <typedef-decl name='__uint32_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-4'/>
    <typedef-decl name='uint32_t' type-id='type-id-4' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <typedef-decl name='u32' type-id='type-id-5' filepath='../drivers/net/i40e/base/i40e_osdep.h' line='30' column='1' id='type-id-2'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-6'>
      <subrange length='infinite' id='type-id-7'/>

    </array-type-def>
    <var-decl name='i40e_ptype_lookup' type-id='type-id-6' visibility='default' filepath='../drivers/net/i40e/base/i40e_prototype.h' line='474' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/i40e/i40e_ethdev.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <var-decl name='i40e_logtype_init' type-id='type-id-8' visibility='default' filepath='../drivers/net/i40e/i40e_logs.h' line='8' column='1'/>
    <var-decl name='i40e_logtype_driver' type-id='type-id-8' visibility='default' filepath='../drivers/net/i40e/i40e_logs.h' line='41' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/i40e/i40e_flow.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_flow_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='63' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='validate' type-id='type-id-10' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create' type-id='type-id-11' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='type-id-12' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flush' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='query' type-id='type-id-14' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='isolate' type-id='type-id-15' visibility='default' filepath='../lib/librte_ethdev/rte_flow_driver.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev' size-in-bits='132608' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='777' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_pkt_burst' type-id='type-id-17' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_pkt_burst' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tx_pkt_prepare' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-20' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='process_private' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_ops' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='device' type-id='type-id-23' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='intr_handle' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='link_intr_cbs' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='post_rx_burst_cbs' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='pre_tx_burst_cbs' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131712'>
        <var-decl name='state' type-id='type-id-27' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131776'>
        <var-decl name='security_ctx' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131840'>
        <var-decl name='reserved_64s' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132096'>
        <var-decl name='reserved_ptrs' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='807' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-30'/>
    <typedef-decl name='__uint16_t' type-id='type-id-30' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-31'/>
    <typedef-decl name='uint16_t' type-id='type-id-31' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-32'/>
    <type-decl name='void' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-21'/>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-35' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-37' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-38' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-35' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-38' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-35' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-39' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-40' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-32' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-41' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-42' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-43'/>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='infinite' id='type-id-44'>
      <subrange length='infinite' type-id='type-id-43' id='type-id-7'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-44' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-35'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-36'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-45' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-45' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-43' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-46'/>
    <typedef-decl name='uint64_t' type-id='type-id-46' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-38'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-38' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-45'/>

    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='infinite' id='type-id-47'>
      <subrange length='infinite' type-id='type-id-43' id='type-id-7'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-47' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-37'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-21' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-51' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-8' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-52' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-53' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-54' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-55' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-56'/>

    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='256' id='type-id-49'>
      <subrange length='32' type-id='type-id-43' id='type-id-57'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-50'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-21' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-38' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-49' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-60' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-38' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-52' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-59'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-61' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-45' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-38' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-61'/>
    <typedef-decl name='size_t' type-id='type-id-43' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-60'/>
    <typedef-decl name='__int32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-62'/>
    <typedef-decl name='int32_t' type-id='type-id-62' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-52'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-63'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-51'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-5' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-65' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='98304' id='type-id-65'>
      <subrange length='1536' type-id='type-id-43' id='type-id-66'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-53'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-67' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-68' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-70' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-67' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-39'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-71'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-45' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-61' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-72' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-73' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-75' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-21' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-60' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-77' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-21' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-72' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-72'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-76'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-45' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-61' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-78' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-40'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-81' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-82' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-84' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-81'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-82' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-86' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-87'/>
    <typedef-decl name='__int16_t' type-id='type-id-87' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-88'/>
    <typedef-decl name='int16_t' type-id='type-id-88' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-89'/>
    <qualified-type-def type-id='type-id-89' volatile='yes' id='type-id-86'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-85' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-82'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-41'/>

    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='128' id='type-id-42'>
      <subrange length='2' type-id='type-id-43' id='type-id-90'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <typedef-decl name='eth_rx_burst_t' type-id='type-id-93' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='340' column='1' id='type-id-17'/>
    <typedef-decl name='eth_tx_burst_t' type-id='type-id-93' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='345' column='1' id='type-id-18'/>
    <typedef-decl name='eth_tx_prep_t' type-id='type-id-93' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='350' column='1' id='type-id-19'/>
    <class-decl name='rte_eth_dev_data' size-in-bits='55808' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='820' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-95' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_queues' type-id='type-id-96' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_queues' type-id='type-id-96' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_rx_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='nb_tx_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='sriov' type-id='type-id-97' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dev_private' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_link' type-id='type-id-98' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dev_conf' type-id='type-id-99' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='mtu' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25568'>
        <var-decl name='min_rx_buf_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='rx_mbuf_alloc_failed' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25664'>
        <var-decl name='mac_addrs' type-id='type-id-100' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='mac_pool_sel' type-id='type-id-101' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='hash_mac_addrs' type-id='type-id-100' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33984'>
        <var-decl name='port_id' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='promiscuous' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='scattered_rx' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='all_multicast' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dev_started' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='lro' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34008'>
        <var-decl name='rx_queue_state' type-id='type-id-103' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42200'>
        <var-decl name='tx_queue_state' type-id='type-id-103' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50400'>
        <var-decl name='dev_flags' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50432'>
        <var-decl name='kdrv' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50464'>
        <var-decl name='numa_node' type-id='type-id-8' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50496'>
        <var-decl name='vlan_filter_conf' type-id='type-id-105' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54592'>
        <var-decl name='owner' type-id='type-id-106' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55168'>
        <var-decl name='representor_id' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55232'>
        <var-decl name='reserved_64s' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55488'>
        <var-decl name='reserved_ptrs' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='876' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='512' id='type-id-95'>
      <subrange length='64' type-id='type-id-43' id='type-id-107'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-96'/>
    <class-decl name='rte_eth_dev_sriov' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1476' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='active' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_q_per_pool' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='def_vmdq_idx' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='def_pool_q_idx' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1480' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-108'/>
    <typedef-decl name='__uint8_t' type-id='type-id-108' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-109'/>
    <typedef-decl name='uint8_t' type-id='type-id-109' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-102'/>
    <class-decl name='rte_eth_link' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='308' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speed' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='link_duplex' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='link_autoneg' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='link_status' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_conf' size-in-bits='24640' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1045' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speeds' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rxmode' type-id='type-id-110' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='txmode' type-id='type-id-111' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='lpbk_mode' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rx_adv_conf' type-id='type-id-112' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1068' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='tx_adv_conf' type-id='type-id-113' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18080'>
        <var-decl name='dcb_capability_en' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='fdir_conf' type-id='type-id-114' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='intr_conf' type-id='type-id-115' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1081' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rxmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='394' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-116' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_rx_pkt_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='split_hdr_size' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-42' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='409' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-118'/>
    <enum-decl name='rte_eth_rx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='344' column='1' id='type-id-116'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='ETH_MQ_RX_NONE' value='0'/>
      <enumerator name='ETH_MQ_RX_RSS' value='1'/>
      <enumerator name='ETH_MQ_RX_DCB' value='2'/>
      <enumerator name='ETH_MQ_RX_DCB_RSS' value='3'/>
      <enumerator name='ETH_MQ_RX_VMDQ_ONLY' value='4'/>
      <enumerator name='ETH_MQ_RX_VMDQ_RSS' value='5'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB' value='6'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB_RSS' value='7'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-117'>
      <subrange length='2' type-id='type-id-43' id='type-id-90'/>

    </array-type-def>
    <class-decl name='rte_eth_txmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='792' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-119' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pvid' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='hw_vlan_reject_tagged' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='hw_vlan_reject_untagged' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='hw_vlan_insert_pvid' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-42' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='812' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='377' column='1' id='type-id-119'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='ETH_MQ_TX_NONE' value='0'/>
      <enumerator name='ETH_MQ_TX_DCB' value='1'/>
      <enumerator name='ETH_MQ_TX_VMDQ_DCB' value='2'/>
      <enumerator name='ETH_MQ_TX_VMDQ_ONLY' value='3'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1060' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_conf' type-id='type-id-120' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vmdq_dcb_conf' type-id='type-id-121' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='dcb_rx_conf' type-id='type-id-122' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='vmdq_rx_conf' type-id='type-id-123' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1066' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rss_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='448' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_key' type-id='type-id-124' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rss_key_len' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rss_hf' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='451' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-124'/>
    <class-decl name='rte_eth_vmdq_dcb_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='745' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-125' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_pool_maps' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_map' type-id='type-id-126' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='dcb_tc' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='754' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_pools' filepath='../lib/librte_ethdev/rte_ethdev.h' line='704' column='1' id='type-id-125'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='ETH_8_POOLS' value='8'/>
      <enumerator name='ETH_16_POOLS' value='16'/>
      <enumerator name='ETH_32_POOLS' value='32'/>
      <enumerator name='ETH_64_POOLS' value='64'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='750' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_id' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pools' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='752' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-128' size-in-bits='8192' id='type-id-126'>
      <subrange length='64' type-id='type-id-43' id='type-id-107'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='64' id='type-id-127'>
      <subrange length='8' type-id='type-id-43' id='type-id-129'/>

    </array-type-def>
    <class-decl name='rte_eth_dcb_rx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='712' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-130' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_tcs' filepath='../lib/librte_ethdev/rte_ethdev.h' line='695' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='ETH_4_TCS' value='4'/>
      <enumerator name='ETH_8_TCS' value='8'/>
    </enum-decl>
    <class-decl name='rte_eth_vmdq_rx_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='776' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-125' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='enable_loop_back' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='nb_pool_maps' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rx_mode' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool_map' type-id='type-id-126' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='786' column='1'/>
      </data-member>
    </class-decl>

    <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1069' column='1' id='type-id-113'>
      <data-member access='private'>
        <var-decl name='vmdq_dcb_tx_conf' type-id='type-id-131' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1070' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dcb_tx_conf' type-id='type-id-132' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1072' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vmdq_tx_conf' type-id='type-id-133' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1074' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_eth_vmdq_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='718' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-125' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='721' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='724' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-130' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vmdq_tx_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='730' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-125' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_fdir_conf' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1005' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-134' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pballoc' type-id='type-id-135' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='status' type-id='type-id-136' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drop_queue' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mask' type-id='type-id-137' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flex_conf' type-id='type-id-138' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1012' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fdir_mode' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='603' column='1' id='type-id-134'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FDIR_MODE_NONE' value='0'/>
      <enumerator name='RTE_FDIR_MODE_SIGNATURE' value='1'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT' value='2'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_MAC_VLAN' value='3'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_TUNNEL' value='4'/>
    </enum-decl>
    <enum-decl name='rte_fdir_pballoc_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='984' column='1' id='type-id-135'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FDIR_PBALLOC_64K' value='0'/>
      <enumerator name='RTE_FDIR_PBALLOC_128K' value='1'/>
      <enumerator name='RTE_FDIR_PBALLOC_256K' value='2'/>
    </enum-decl>
    <enum-decl name='rte_fdir_status_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='993' column='1' id='type-id-136'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FDIR_NO_REPORT_STATUS' value='0'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS' value='1'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS_ALWAYS' value='2'/>
    </enum-decl>
    <class-decl name='rte_eth_fdir_masks' size-in-bits='544' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='533' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_tci_mask' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv4_mask' type-id='type-id-139' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ipv6_mask' type-id='type-id-140' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='src_port_mask' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='dst_port_mask' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mac_addr_byte_mask' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='tunnel_id_mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tunnel_type_mask' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv4_flow' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='342' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dst_ip' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tos' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='ttl' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='proto' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv6_flow' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='381' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-141' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_ip' type-id='type-id-141' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tc' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='proto' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='hop_limits' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='386' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='128' id='type-id-141'>
      <subrange length='4' type-id='type-id-43' id='type-id-142'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_conf' size-in-bits='5792' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='591' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_payloads' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_flexmasks' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flex_set' type-id='type-id-143' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='flex_mask' type-id='type-id-144' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='596' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_flex_payload_cfg' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='568' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-146' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='src_offset' type-id='type-id-147' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_payload_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='555' column='1' id='type-id-146'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_ETH_PAYLOAD_UNKNOWN' value='0'/>
      <enumerator name='RTE_ETH_RAW_PAYLOAD' value='1'/>
      <enumerator name='RTE_ETH_L2_PAYLOAD' value='2'/>
      <enumerator name='RTE_ETH_L3_PAYLOAD' value='3'/>
      <enumerator name='RTE_ETH_L4_PAYLOAD' value='4'/>
      <enumerator name='RTE_ETH_PAYLOAD_MAX' value='8'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='256' id='type-id-147'>
      <subrange length='16' type-id='type-id-43' id='type-id-148'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-145' size-in-bits='2304' id='type-id-143'>
      <subrange length='8' type-id='type-id-43' id='type-id-129'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_mask' size-in-bits='144' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='581' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flow_type' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mask' type-id='type-id-150' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='583' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='128' id='type-id-150'>
      <subrange length='16' type-id='type-id-43' id='type-id-148'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-149' size-in-bits='3456' id='type-id-144'>
      <subrange length='24' type-id='type-id-43' id='type-id-151'/>

    </array-type-def>
    <class-decl name='rte_intr_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1031' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lsc' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='rxq' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='rmv' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1037' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_ether_addr' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='60' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr_bytes' type-id='type-id-153' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='61' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='48' id='type-id-153'>
      <subrange length='6' type-id='type-id-43' id='type-id-154'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-100'/>

    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='8192' id='type-id-101'>
      <subrange length='128' type-id='type-id-43' id='type-id-155'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='8192' id='type-id-103'>
      <subrange length='1024' type-id='type-id-43' id='type-id-156'/>

    </array-type-def>
    <enum-decl name='rte_kernel_driver' filepath='../lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-104'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_KDRV_UNKNOWN' value='0'/>
      <enumerator name='RTE_KDRV_IGB_UIO' value='1'/>
      <enumerator name='RTE_KDRV_VFIO' value='2'/>
      <enumerator name='RTE_KDRV_UIO_GENERIC' value='3'/>
      <enumerator name='RTE_KDRV_NIC_UIO' value='4'/>
      <enumerator name='RTE_KDRV_NONE' value='5'/>
    </enum-decl>
    <class-decl name='rte_vlan_filter_conf' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='427' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ids' type-id='type-id-157' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='428' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='4096' id='type-id-157'>
      <subrange length='64' type-id='type-id-43' id='type-id-107'/>

    </array-type-def>
    <class-decl name='rte_eth_dev_owner' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1490' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-95' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1492' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='256' id='type-id-28'>
      <subrange length='4' type-id='type-id-43' id='type-id-142'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-29'>
      <subrange length='4' type-id='type-id-43' id='type-id-142'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-20'/>
    <class-decl name='eth_dev_ops' size-in-bits='6016' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='609' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_configure' type-id='type-id-159' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_start' type-id='type-id-160' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_stop' type-id='type-id-161' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_set_link_up' type-id='type-id-162' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_set_link_down' type-id='type-id-163' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_close' type-id='type-id-164' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dev_reset' type-id='type-id-165' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link_update' type-id='type-id-166' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='is_removed' type-id='type-id-167' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='promiscuous_enable' type-id='type-id-168' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='promiscuous_disable' type-id='type-id-169' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='allmulticast_enable' type-id='type-id-170' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='allmulticast_disable' type-id='type-id-171' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mac_addr_remove' type-id='type-id-172' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='mac_addr_add' type-id='type-id-173' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='mac_addr_set' type-id='type-id-174' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_mc_addr_list' type-id='type-id-175' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mtu_set' type-id='type-id-176' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='stats_get' type-id='type-id-177' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='stats_reset' type-id='type-id-178' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='xstats_get' type-id='type-id-179' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='xstats_reset' type-id='type-id-180' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='xstats_get_names' type-id='type-id-181' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='queue_stats_mapping_set' type-id='type-id-182' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='dev_infos_get' type-id='type-id-183' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rxq_info_get' type-id='type-id-184' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='txq_info_get' type-id='type-id-185' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='rx_burst_mode_get' type-id='type-id-186' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tx_burst_mode_get' type-id='type-id-186' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='fw_version_get' type-id='type-id-187' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dev_supported_ptypes_get' type-id='type-id-188' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='dev_ptypes_set' type-id='type-id-189' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='vlan_filter_set' type-id='type-id-190' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='vlan_tpid_set' type-id='type-id-191' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='vlan_strip_queue_set' type-id='type-id-192' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='vlan_offload_set' type-id='type-id-193' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='vlan_pvid_set' type-id='type-id-194' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='rx_queue_start' type-id='type-id-195' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='rx_queue_stop' type-id='type-id-196' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tx_queue_start' type-id='type-id-195' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tx_queue_stop' type-id='type-id-196' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='rx_queue_setup' type-id='type-id-197' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='rx_queue_release' type-id='type-id-198' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='rx_queue_count' type-id='type-id-199' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='rx_descriptor_done' type-id='type-id-200' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='rx_descriptor_status' type-id='type-id-201' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tx_descriptor_status' type-id='type-id-202' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='rx_queue_intr_enable' type-id='type-id-203' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='rx_queue_intr_disable' type-id='type-id-204' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tx_queue_setup' type-id='type-id-205' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tx_queue_release' type-id='type-id-198' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tx_done_cleanup' type-id='type-id-206' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dev_led_on' type-id='type-id-207' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dev_led_off' type-id='type-id-208' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='flow_ctrl_get' type-id='type-id-209' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='flow_ctrl_set' type-id='type-id-210' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='priority_flow_ctrl_set' type-id='type-id-211' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='uc_hash_table_set' type-id='type-id-212' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='uc_all_hash_table_set' type-id='type-id-213' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='mirror_rule_set' type-id='type-id-214' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='mirror_rule_reset' type-id='type-id-215' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='udp_tunnel_port_add' type-id='type-id-216' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='udp_tunnel_port_del' type-id='type-id-217' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='l2_tunnel_eth_type_conf' type-id='type-id-218' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='l2_tunnel_offload_set' type-id='type-id-219' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='set_queue_rate_limit' type-id='type-id-220' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='rss_hash_update' type-id='type-id-221' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='rss_hash_conf_get' type-id='type-id-222' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='reta_update' type-id='type-id-223' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='reta_query' type-id='type-id-224' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='get_reg' type-id='type-id-225' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='get_eeprom_length' type-id='type-id-226' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='get_eeprom' type-id='type-id-227' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='set_eeprom' type-id='type-id-228' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='get_module_info' type-id='type-id-229' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='get_module_eeprom' type-id='type-id-230' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='filter_ctrl' type-id='type-id-231' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='get_dcb_info' type-id='type-id-232' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='timesync_enable' type-id='type-id-233' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='timesync_disable' type-id='type-id-234' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='timesync_read_rx_timestamp' type-id='type-id-235' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='timesync_read_tx_timestamp' type-id='type-id-236' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='timesync_adjust_time' type-id='type-id-237' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='timesync_read_time' type-id='type-id-238' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='timesync_write_time' type-id='type-id-239' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='read_clock' type-id='type-id-240' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='xstats_get_by_id' type-id='type-id-241' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='xstats_get_names_by_id' type-id='type-id-242' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='tm_ops_get' type-id='type-id-243' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='mtr_ops_get' type-id='type-id-244' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='pool_ops_supported' type-id='type-id-245' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='hairpin_cap_get' type-id='type-id-246' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='rx_hairpin_queue_setup' type-id='type-id-247' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='tx_hairpin_queue_setup' type-id='type-id-248' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <typedef-decl name='eth_dev_configure_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='31' column='1' id='type-id-159'/>
    <typedef-decl name='eth_dev_start_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='34' column='1' id='type-id-160'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <typedef-decl name='eth_dev_stop_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='37' column='1' id='type-id-161'/>
    <typedef-decl name='eth_dev_set_link_up_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='40' column='1' id='type-id-162'/>
    <typedef-decl name='eth_dev_set_link_down_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='43' column='1' id='type-id-163'/>
    <typedef-decl name='eth_dev_close_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='46' column='1' id='type-id-164'/>
    <typedef-decl name='eth_dev_reset_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='49' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <typedef-decl name='eth_link_update_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='155' column='1' id='type-id-166'/>
    <typedef-decl name='eth_is_removed_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='52' column='1' id='type-id-167'/>
    <typedef-decl name='eth_promiscuous_enable_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='78' column='1' id='type-id-168'/>
    <typedef-decl name='eth_promiscuous_disable_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='103' column='1' id='type-id-169'/>
    <typedef-decl name='eth_allmulticast_enable_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='128' column='1' id='type-id-170'/>
    <typedef-decl name='eth_allmulticast_disable_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='153' column='1' id='type-id-171'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <typedef-decl name='eth_mac_addr_remove_t' type-id='type-id-257' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='391' column='1' id='type-id-172'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <typedef-decl name='eth_mac_addr_add_t' type-id='type-id-259' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='394' column='1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <typedef-decl name='eth_mac_addr_set_t' type-id='type-id-261' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='400' column='1' id='type-id-174'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <typedef-decl name='eth_set_mc_addr_list_t' type-id='type-id-263' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='436' column='1' id='type-id-175'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <typedef-decl name='mtu_set_t' type-id='type-id-265' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='315' column='1' id='type-id-176'/>
    <class-decl name='rte_eth_stats' size-in-bits='5632' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='243' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipackets' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opackets' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ibytes' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='obytes' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='imissed' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ierrors' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='oerrors' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rx_nombuf' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='q_ipackets' type-id='type-id-267' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='q_opackets' type-id='type-id-267' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='q_ibytes' type-id='type-id-267' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='q_obytes' type-id='type-id-267' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='q_errors' type-id='type-id-267' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='263' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='1024' id='type-id-267'>
      <subrange length='16' type-id='type-id-43' id='type-id-148'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <typedef-decl name='eth_stats_get_t' type-id='type-id-270' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='159' column='1' id='type-id-177'/>
    <typedef-decl name='eth_stats_reset_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='182' column='1' id='type-id-178'/>
    <class-decl name='rte_eth_xstat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1337' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1339' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <typedef-decl name='eth_xstats_get_t' type-id='type-id-274' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='184' column='1' id='type-id-179'/>
    <typedef-decl name='eth_xstats_reset_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='213' column='1' id='type-id-180'/>
    <class-decl name='rte_eth_xstat_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1349' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-95' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1350' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <typedef-decl name='eth_xstats_get_names_t' type-id='type-id-278' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='215' column='1' id='type-id-181'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <typedef-decl name='eth_queue_stats_mapping_set_t' type-id='type-id-280' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='224' column='1' id='type-id-182'/>
    <class-decl name='rte_eth_dev_info' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1226' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='type-id-23' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driver_name' type-id='type-id-282' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='if_index' type-id='type-id-3' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='min_mtu' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='max_mtu' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_flags' type-id='type-id-283' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_rx_bufsize' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_rx_pktlen' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='max_rx_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='max_tx_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_mac_addrs' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='max_hash_mac_addrs' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='max_vfs' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='max_vmdq_pools' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_offload_capa' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_offload_capa' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rx_queue_offload_capa' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tx_queue_offload_capa' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reta_size' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='hash_key_size' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='flow_type_rss_offloads' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_rxconf' type-id='type-id-284' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='default_txconf' type-id='type-id-285' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='vmdq_queue_base' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1744'>
        <var-decl name='vmdq_queue_num' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='vmdq_pool_base' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1776'>
        <var-decl name='rx_desc_lim' type-id='type-id-286' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tx_desc_lim' type-id='type-id-286' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='speed_capa' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_rx_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2000'>
        <var-decl name='nb_tx_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='default_rxportconf' type-id='type-id-287' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='default_txportconf' type-id='type-id-287' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='dev_capa' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='switch_info' type-id='type-id-288' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='reserved_64s' type-id='type-id-42' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='reserved_ptrs' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1282' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-290' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-291' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-292' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-293' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-294' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-294'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-295'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-282'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-297' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-298' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-299' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-291'/>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-302' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-303' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-304' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-305' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-306' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-307' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-308' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-309' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-310' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-311' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-312' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-313' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-314' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-315' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-316' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-317' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-319' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-303'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-319' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-304'/>
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-320'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-323' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-324'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-326' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-305'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-328' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-306'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-328' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-307'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-330' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-308'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-332' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-309'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-332' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-310'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-333' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-333'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-334'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-336' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-312'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-316' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-338' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-339'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-340'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-343' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-313'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-328' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-314'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-345' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-315'/>
    <qualified-type-def type-id='type-id-301' const='yes' id='type-id-346'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-292'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-348' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-349' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-350' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-95' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-351' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-316' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-338' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-293' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-352' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-352'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-349'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-350'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-351'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-353' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-353'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-354'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-283'/>
    <class-decl name='rte_eth_rxconf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='818' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_thresh' type-id='type-id-355' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rx_free_thresh' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rx_drop_en' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='rx_deferred_start' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved_64s' type-id='type-id-42' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='reserved_ptrs' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='831' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_thresh' size-in-bits='24' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='327' column='1' id='type-id-355'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pthresh' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='hthresh' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='wthresh' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_txconf' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='837' column='1' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tx_thresh' type-id='type-id-355' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tx_rs_thresh' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='tx_free_thresh' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_deferred_start' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-42' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='852' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_desc_lim' size-in-bits='80' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='898' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_max' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_min' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_align' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_seg_max' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_mtu_seg_max' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='924' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_portconf' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1189' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='burst_size' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ring_size' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1192' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_switch_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1204' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-282' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='domain_id' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='port_id' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1207' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <typedef-decl name='eth_dev_infos_get_t' type-id='type-id-358' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='230' column='1' id='type-id-183'/>
    <class-decl name='rte_eth_rxq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1289' column='1' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='type-id-39' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conf' type-id='type-id-284' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scattered_rx' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='nb_desc' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1293' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <typedef-decl name='eth_rxq_info_get_t' type-id='type-id-362' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='306' column='1' id='type-id-184'/>
    <class-decl name='rte_eth_txq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1300' column='1' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='conf' type-id='type-id-285' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_desc' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1302' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <typedef-decl name='eth_txq_info_get_t' type-id='type-id-366' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='309' column='1' id='type-id-185'/>
    <class-decl name='rte_eth_burst_mode' size-in-bits='8256' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1318' column='1' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='info' type-id='type-id-368' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1322' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='8192' id='type-id-368'>
      <subrange length='1024' type-id='type-id-43' id='type-id-156'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <typedef-decl name='eth_burst_mode_get_t' type-id='type-id-371' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='312' column='1' id='type-id-186'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <typedef-decl name='eth_fw_version_get_t' type-id='type-id-373' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='299' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <typedef-decl name='eth_dev_supported_ptypes_get_t' type-id='type-id-375' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='234' column='1' id='type-id-188'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <typedef-decl name='eth_dev_ptypes_set_t' type-id='type-id-377' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='249' column='1' id='type-id-189'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <typedef-decl name='vlan_filter_set_t' type-id='type-id-379' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='318' column='1' id='type-id-190'/>
    <enum-decl name='rte_vlan_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='416' column='1' id='type-id-380'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='ETH_VLAN_TYPE_UNKNOWN' value='0'/>
      <enumerator name='ETH_VLAN_TYPE_INNER' value='1'/>
      <enumerator name='ETH_VLAN_TYPE_OUTER' value='2'/>
      <enumerator name='ETH_VLAN_TYPE_MAX' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-382'/>
    <typedef-decl name='vlan_tpid_set_t' type-id='type-id-382' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='323' column='1' id='type-id-191'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <typedef-decl name='vlan_strip_queue_set_t' type-id='type-id-384' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='335' column='1' id='type-id-192'/>
    <typedef-decl name='vlan_offload_set_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='327' column='1' id='type-id-193'/>
    <typedef-decl name='vlan_pvid_set_t' type-id='type-id-379' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='330' column='1' id='type-id-194'/>
    <typedef-decl name='eth_queue_start_t' type-id='type-id-265' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='252' column='1' id='type-id-195'/>
    <typedef-decl name='eth_queue_stop_t' type-id='type-id-265' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='256' column='1' id='type-id-196'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-385'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <typedef-decl name='eth_rx_queue_setup_t' type-id='type-id-388' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='260' column='1' id='type-id-197'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <typedef-decl name='eth_queue_release_t' type-id='type-id-390' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='283' column='1' id='type-id-198'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <typedef-decl name='eth_rx_queue_count_t' type-id='type-id-392' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='286' column='1' id='type-id-199'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <typedef-decl name='eth_rx_descriptor_done_t' type-id='type-id-394' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='290' column='1' id='type-id-200'/>
    <typedef-decl name='eth_rx_descriptor_status_t' type-id='type-id-394' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='293' column='1' id='type-id-201'/>
    <typedef-decl name='eth_tx_descriptor_status_t' type-id='type-id-394' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='296' column='1' id='type-id-202'/>
    <typedef-decl name='eth_rx_enable_intr_t' type-id='type-id-265' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='275' column='1' id='type-id-203'/>
    <typedef-decl name='eth_rx_disable_intr_t' type-id='type-id-265' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='279' column='1' id='type-id-204'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-395'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <typedef-decl name='eth_tx_queue_setup_t' type-id='type-id-398' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='268' column='1' id='type-id-205'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
    <typedef-decl name='eth_tx_done_cleanup_t' type-id='type-id-400' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='303' column='1' id='type-id-206'/>
    <typedef-decl name='eth_dev_led_on_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='385' column='1' id='type-id-207'/>
    <typedef-decl name='eth_dev_led_off_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='388' column='1' id='type-id-208'/>
    <class-decl name='rte_eth_fc_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='942' column='1' id='type-id-401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='high_water' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='low_water' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pause_time' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='send_xon' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mode' type-id='type-id-402' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_ctrl_frame_fwd' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='autoneg' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='949' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_fc_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='930' column='1' id='type-id-402'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FC_NONE' value='0'/>
      <enumerator name='RTE_FC_RX_PAUSE' value='1'/>
      <enumerator name='RTE_FC_TX_PAUSE' value='2'/>
      <enumerator name='RTE_FC_FULL' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-403'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <typedef-decl name='flow_ctrl_get_t' type-id='type-id-405' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='355' column='1' id='type-id-209'/>
    <typedef-decl name='flow_ctrl_set_t' type-id='type-id-405' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='359' column='1' id='type-id-210'/>
    <class-decl name='rte_eth_pfc_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='957' column='1' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='type-id-401' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='priority' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <typedef-decl name='priority_flow_ctrl_set_t' type-id='type-id-409' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='363' column='1' id='type-id-211'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <typedef-decl name='eth_uc_hash_table_set_t' type-id='type-id-411' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='404' column='1' id='type-id-212'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <typedef-decl name='eth_uc_all_hash_table_set_t' type-id='type-id-413' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='409' column='1' id='type-id-213'/>
    <class-decl name='rte_eth_mirror_conf' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='670' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rule_type' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dst_pool' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_mask' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vlan' type-id='type-id-415' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='675' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vlan_mirror' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='661' column='1' id='type-id-415'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_mask' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vlan_id' type-id='type-id-416' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='664' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='1024' id='type-id-416'>
      <subrange length='64' type-id='type-id-43' id='type-id-107'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-417'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-419'/>
    <typedef-decl name='eth_mirror_rule_set_t' type-id='type-id-419' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='418' column='1' id='type-id-214'/>
    <typedef-decl name='eth_mirror_rule_reset_t' type-id='type-id-413' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='424' column='1' id='type-id-215'/>
    <class-decl name='rte_eth_udp_tunnel' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1023' column='1' id='type-id-420'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='udp_port' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='prot_type' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1025' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-423'/>
    <typedef-decl name='eth_udp_tunnel_port_add_t' type-id='type-id-423' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='428' column='1' id='type-id-216'/>
    <typedef-decl name='eth_udp_tunnel_port_del_t' type-id='type-id-423' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='432' column='1' id='type-id-217'/>
    <class-decl name='rte_eth_l2_tunnel_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='751' column='1' id='type-id-424'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l2_tunnel_type' type-id='type-id-425' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ether_type' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tunnel_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vf_id' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tunnel_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='965' column='1' id='type-id-425'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_TUNNEL_TYPE_NONE' value='0'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN' value='1'/>
      <enumerator name='RTE_TUNNEL_TYPE_GENEVE' value='2'/>
      <enumerator name='RTE_TUNNEL_TYPE_TEREDO' value='3'/>
      <enumerator name='RTE_TUNNEL_TYPE_NVGRE' value='4'/>
      <enumerator name='RTE_TUNNEL_TYPE_IP_IN_GRE' value='5'/>
      <enumerator name='RTE_L2_TUNNEL_TYPE_E_TAG' value='6'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN_GPE' value='7'/>
      <enumerator name='RTE_TUNNEL_TYPE_MAX' value='8'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <typedef-decl name='eth_l2_tunnel_eth_type_conf_t' type-id='type-id-428' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='494' column='1' id='type-id-218'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <typedef-decl name='eth_l2_tunnel_offload_set_t' type-id='type-id-430' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='498' column='1' id='type-id-219'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <typedef-decl name='eth_set_queue_rate_limit_t' type-id='type-id-432' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='413' column='1' id='type-id-220'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <typedef-decl name='rss_hash_update_t' type-id='type-id-435' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='377' column='1' id='type-id-221'/>
    <typedef-decl name='rss_hash_conf_get_t' type-id='type-id-435' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='381' column='1' id='type-id-222'/>
    <class-decl name='rte_eth_rss_reta_entry64' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='684' column='1' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mask' type-id='type-id-38' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reta' type-id='type-id-416' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='687' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <typedef-decl name='reta_update_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='367' column='1' id='type-id-223'/>
    <typedef-decl name='reta_query_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='372' column='1' id='type-id-224'/>
    <class-decl name='rte_dev_reg_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='13' column='1' id='type-id-440'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='width' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='version' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <typedef-decl name='eth_get_reg_t' type-id='type-id-443' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='471' column='1' id='type-id-225'/>
    <typedef-decl name='eth_get_eeprom_length_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='475' column='1' id='type-id-226'/>
    <class-decl name='rte_dev_eeprom_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='24' column='1' id='type-id-444'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='magic' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <typedef-decl name='eth_get_eeprom_t' type-id='type-id-447' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='478' column='1' id='type-id-227'/>
    <typedef-decl name='eth_set_eeprom_t' type-id='type-id-447' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='482' column='1' id='type-id-228'/>
    <class-decl name='rte_eth_dev_module_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='34' column='1' id='type-id-448'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eeprom_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <typedef-decl name='eth_get_module_info_t' type-id='type-id-451' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='486' column='1' id='type-id-229'/>
    <typedef-decl name='eth_get_module_eeprom_t' type-id='type-id-447' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='490' column='1' id='type-id-230'/>
    <enum-decl name='rte_filter_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='28' column='1' id='type-id-452'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_ETH_FILTER_NONE' value='0'/>
      <enumerator name='RTE_ETH_FILTER_MACVLAN' value='1'/>
      <enumerator name='RTE_ETH_FILTER_ETHERTYPE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_FLEXIBLE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_SYN' value='4'/>
      <enumerator name='RTE_ETH_FILTER_NTUPLE' value='5'/>
      <enumerator name='RTE_ETH_FILTER_TUNNEL' value='6'/>
      <enumerator name='RTE_ETH_FILTER_FDIR' value='7'/>
      <enumerator name='RTE_ETH_FILTER_HASH' value='8'/>
      <enumerator name='RTE_ETH_FILTER_L2_TUNNEL' value='9'/>
      <enumerator name='RTE_ETH_FILTER_GENERIC' value='10'/>
      <enumerator name='RTE_ETH_FILTER_MAX' value='11'/>
    </enum-decl>
    <enum-decl name='rte_filter_op' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='46' column='1' id='type-id-453'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_ETH_FILTER_NOP' value='0'/>
      <enumerator name='RTE_ETH_FILTER_ADD' value='1'/>
      <enumerator name='RTE_ETH_FILTER_UPDATE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_DELETE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_FLUSH' value='4'/>
      <enumerator name='RTE_ETH_FILTER_GET' value='5'/>
      <enumerator name='RTE_ETH_FILTER_SET' value='6'/>
      <enumerator name='RTE_ETH_FILTER_INFO' value='7'/>
      <enumerator name='RTE_ETH_FILTER_STATS' value='8'/>
      <enumerator name='RTE_ETH_FILTER_OP_MAX' value='9'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-455'/>
    <typedef-decl name='eth_filter_ctrl_t' type-id='type-id-455' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='506' column='1' id='type-id-231'/>
    <class-decl name='rte_eth_dcb_info' size-in-bits='16520' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1377' column='1' id='type-id-456'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='prio_tc' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='tc_bws' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='tc_queue' type-id='type-id-457' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1382' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tc_queue_mapping' size-in-bits='16384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1360' column='1' id='type-id-457'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tc_rxq' type-id='type-id-458' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='tc_txq' type-id='type-id-458' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1362' column='1' id='type-id-459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_queue' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1364' column='1'/>
      </data-member>
    </class-decl>


    <array-type-def dimensions='2' type-id='type-id-459' size-in-bits='1152' id='type-id-458'>
      <subrange length='64' type-id='type-id-43' id='type-id-107'/>

      <subrange length='8' type-id='type-id-43' id='type-id-129'/>

    </array-type-def>


    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-460'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <typedef-decl name='eth_get_dcb_info' type-id='type-id-462' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='518' column='1' id='type-id-232'/>
    <typedef-decl name='eth_timesync_enable_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='441' column='1' id='type-id-233'/>
    <typedef-decl name='eth_timesync_disable_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='444' column='1' id='type-id-234'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-463'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-464' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-465' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-466'/>
    <typedef-decl name='__time_t' type-id='type-id-466' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-464'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-466' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-465'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-467'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <typedef-decl name='eth_timesync_read_rx_timestamp_t' type-id='type-id-469' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='447' column='1' id='type-id-235'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <typedef-decl name='eth_timesync_read_tx_timestamp_t' type-id='type-id-471' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='452' column='1' id='type-id-236'/>
    <typedef-decl name='__int64_t' type-id='type-id-466' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-472'/>
    <typedef-decl name='int64_t' type-id='type-id-472' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-473'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-475'/>
    <typedef-decl name='eth_timesync_adjust_time' type-id='type-id-475' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='456' column='1' id='type-id-237'/>
    <typedef-decl name='eth_timesync_read_time' type-id='type-id-471' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='459' column='1' id='type-id-238'/>
    <qualified-type-def type-id='type-id-463' const='yes' id='type-id-476'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <typedef-decl name='eth_timesync_write_time' type-id='type-id-479' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='463' column='1' id='type-id-239'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-482'/>
    <typedef-decl name='eth_read_clock' type-id='type-id-482' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='467' column='1' id='type-id-240'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-483'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <typedef-decl name='eth_xstats_get_by_id_t' type-id='type-id-486' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='188' column='1' id='type-id-241'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <typedef-decl name='eth_xstats_get_names_by_id_t' type-id='type-id-488' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='219' column='1' id='type-id-242'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <typedef-decl name='eth_tm_ops_get_t' type-id='type-id-490' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='512' column='1' id='type-id-243'/>
    <typedef-decl name='eth_mtr_ops_get_t' type-id='type-id-490' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='515' column='1' id='type-id-244'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <typedef-decl name='eth_pool_ops_supported_t' type-id='type-id-492' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='522' column='1' id='type-id-245'/>
    <class-decl name='rte_eth_hairpin_cap' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='861' column='1' id='type-id-493'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_nb_queues' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_rx_2_tx' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_tx_2_rx' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='max_nb_desc' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='868' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-494'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-496'/>
    <typedef-decl name='eth_hairpin_cap_get_t' type-id='type-id-496' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='543' column='1' id='type-id-246'/>
    <class-decl name='rte_eth_hairpin_conf' size-in-bits='1040' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='890' column='1' id='type-id-497'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='peer_count' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='peers' type-id='type-id-498' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='892' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_hairpin_peer' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='879' column='1' id='type-id-499'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='queue' type-id='type-id-32' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='881' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-499' size-in-bits='1024' id='type-id-498'>
      <subrange length='32' type-id='type-id-43' id='type-id-57'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-500'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <pointer-type-def type-id='type-id-502' size-in-bits='64' id='type-id-503'/>
    <typedef-decl name='eth_rx_hairpin_queue_setup_t' type-id='type-id-503' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='571' column='1' id='type-id-247'/>
    <typedef-decl name='eth_tx_hairpin_queue_setup_t' type-id='type-id-503' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='601' column='1' id='type-id-248'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-22'/>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-505'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-506' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-507' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-102' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-508' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-509' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-510' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-506'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-507'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='16384' id='type-id-508'>
      <subrange length='512' type-id='type-id-43' id='type-id-511'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-512'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-513' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-514' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-5' volatile='yes' id='type-id-513'/>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-514'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-515' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-517'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-517' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-515'/>

    <array-type-def dimensions='1' type-id='type-id-512' size-in-bits='196608' id='type-id-509'>
      <subrange length='512' type-id='type-id-43' id='type-id-511'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-24'/>
    <class-decl name='rte_eth_dev_cb_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-518' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-519' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_callback' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-520'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-518'/>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <class-decl name='rte_eth_rxtx_callback' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='758' column='1' id='type-id-521'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-522' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn' type-id='type-id-523' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='param' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='760' column='1' id='type-id-523'>
      <data-member access='private'>
        <var-decl name='rx' type-id='type-id-524' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='761' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tx' type-id='type-id-525' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='762' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <typedef-decl name='rte_rx_callback_fn' type-id='type-id-527' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1437' column='1' id='type-id-524'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <typedef-decl name='rte_tx_callback_fn' type-id='type-id-529' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1461' column='1' id='type-id-525'/>

    <array-type-def dimensions='1' type-id='type-id-522' size-in-bits='65536' id='type-id-26'>
      <subrange length='1024' type-id='type-id-43' id='type-id-156'/>

    </array-type-def>
    <enum-decl name='rte_eth_dev_state' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1467' column='1' id='type-id-27'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_ETH_DEV_UNUSED' value='0'/>
      <enumerator name='RTE_ETH_DEV_ATTACHED' value='1'/>
      <enumerator name='RTE_ETH_DEV_REMOVED' value='2'/>
    </enum-decl>
    <class-decl name='rte_flow_attr' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='75' column='1' id='type-id-530'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='group' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='priority' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='ingress' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='egress' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='transfer' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-530' const='yes' id='type-id-531'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <class-decl name='rte_flow_item' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1517' column='1' id='type-id-533'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-534' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='spec' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mask' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_flow_item_type' filepath='../lib/librte_ethdev/rte_flow.h' line='118' column='1' id='type-id-534'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_END' value='0'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VOID' value='1'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_INVERT' value='2'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ANY' value='3'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PF' value='4'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VF' value='5'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PHY_PORT' value='6'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PORT_ID' value='7'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_RAW' value='8'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ETH' value='9'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VLAN' value='10'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IPV4' value='11'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IPV6' value='12'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP' value='13'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_UDP' value='14'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_TCP' value='15'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_SCTP' value='16'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VXLAN' value='17'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_E_TAG' value='18'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_NVGRE' value='19'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_MPLS' value='20'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GRE' value='21'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_FUZZY' value='22'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTP' value='23'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTPC' value='24'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTPU' value='25'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ESP' value='26'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GENEVE' value='27'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_VXLAN_GPE' value='28'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ARP_ETH_IPV4' value='29'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IPV6_EXT' value='30'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6' value='31'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_NS' value='32'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_NA' value='33'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_OPT' value='34'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_OPT_SLA_ETH' value='35'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_ICMP6_ND_OPT_TLA_ETH' value='36'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_MARK' value='37'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_META' value='38'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GRE_KEY' value='39'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_GTP_PSC' value='40'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PPPOES' value='41'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PPPOED' value='42'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_PPPOE_PROTO_ID' value='43'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_NSH' value='44'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_IGMP' value='45'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_AH' value='46'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_HIGIG2' value='47'/>
      <enumerator name='RTE_FLOW_ITEM_TYPE_TAG' value='48'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-535'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <class-decl name='rte_flow_action' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2568' column='1' id='type-id-537'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-538' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conf' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_flow_action_type' filepath='../lib/librte_ethdev/rte_flow.h' line='1550' column='1' id='type-id-538'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_END' value='0'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VOID' value='1'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PASSTHRU' value='2'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_JUMP' value='3'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_MARK' value='4'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_FLAG' value='5'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_QUEUE' value='6'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DROP' value='7'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_COUNT' value='8'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_RSS' value='9'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PF' value='10'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VF' value='11'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PHY_PORT' value='12'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_PORT_ID' value='13'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_METER' value='14'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SECURITY' value='15'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_MPLS_TTL' value='16'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_DEC_MPLS_TTL' value='17'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_NW_TTL' value='18'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_DEC_NW_TTL' value='19'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_COPY_TTL_OUT' value='20'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_COPY_TTL_IN' value='21'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_POP_VLAN' value='22'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_PUSH_VLAN' value='23'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_VLAN_VID' value='24'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_SET_VLAN_PCP' value='25'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_POP_MPLS' value='26'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_OF_PUSH_MPLS' value='27'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VXLAN_ENCAP' value='28'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_VXLAN_DECAP' value='29'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_NVGRE_ENCAP' value='30'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_NVGRE_DECAP' value='31'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_RAW_ENCAP' value='32'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_RAW_DECAP' value='33'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV4_SRC' value='34'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV4_DST' value='35'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV6_SRC' value='36'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_IPV6_DST' value='37'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TP_SRC' value='38'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TP_DST' value='39'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_MAC_SWAP' value='40'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DEC_TTL' value='41'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TTL' value='42'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_MAC_SRC' value='43'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_MAC_DST' value='44'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_INC_TCP_SEQ' value='45'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DEC_TCP_SEQ' value='46'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_INC_TCP_ACK' value='47'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_DEC_TCP_ACK' value='48'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_TAG' value='49'/>
      <enumerator name='RTE_FLOW_ACTION_TYPE_SET_META' value='50'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-537' const='yes' id='type-id-539'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <class-decl name='rte_flow_error' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2618' column='1' id='type-id-541'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-542' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cause' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='message' type-id='type-id-282' visibility='default' filepath='../lib/librte_ethdev/rte_flow.h' line='2621' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_flow_error_type' filepath='../lib/librte_ethdev/rte_flow.h' line='2587' column='1' id='type-id-542'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_NONE' value='0'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_UNSPECIFIED' value='1'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_HANDLE' value='2'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_GROUP' value='3'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_PRIORITY' value='4'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_INGRESS' value='5'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_EGRESS' value='6'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR_TRANSFER' value='7'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ATTR' value='8'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_NUM' value='9'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_SPEC' value='10'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_LAST' value='11'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM_MASK' value='12'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ITEM' value='13'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ACTION_NUM' value='14'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ACTION_CONF' value='15'/>
      <enumerator name='RTE_FLOW_ERROR_TYPE_ACTION' value='16'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-543'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-10'/>
    <class-decl name='rte_flow' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='826' column='1' id='type-id-545'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-546' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='filter_type' type-id='type-id-452' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rule' type-id='type-id-21' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='829' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='827' column='1' id='type-id-546'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-547' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-548' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='827' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-547'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-548'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-15'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-554'/>
    <var-decl name='i40e_flow_ops' type-id='type-id-554' visibility='default' filepath='../drivers/net/i40e/i40e_ethdev.h' line='1136' column='1'/>
    <function-type size-in-bits='64' id='type-id-374'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-283'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-335'>
      <return type-id='type-id-334'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-318'>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-329'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-322'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-327'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-331'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-372'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-353'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-491'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-544'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-532'/>
      <parameter type-id='type-id-536'/>
      <parameter type-id='type-id-540'/>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-478'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-477'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-485'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-484'/>
      <parameter type-id='type-id-480'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-454'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-452'/>
      <parameter type-id='type-id-453'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-381'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-380'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-553'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-446'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-445'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-442'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-441'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-461'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-460'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-357'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-356'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-450'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-449'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-404'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-403'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-495'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-494'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-427'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-426'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-429'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-426'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-418'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-417'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-408'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-407'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-434'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-433'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-438'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-437'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-269'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-422'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-421'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-273'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-487'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-276'/>
      <parameter type-id='type-id-484'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-276'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-260'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-262'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-258'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-410'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-552'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-547'/>
      <parameter type-id='type-id-540'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-550'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-547'/>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-551'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-470'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-467'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-468'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-467'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-474'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-473'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-378'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-370'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-369'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-431'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-502'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-501'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-387'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-397'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-396'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-279'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-376'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-412'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-481'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-480'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-489'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-344'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-393'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-399'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-325'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-324'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-549'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-532'/>
      <parameter type-id='type-id-536'/>
      <parameter type-id='type-id-540'/>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-547'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-526'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-528'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-391'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-516'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-383'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-361'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-360'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-365'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-364'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-256'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-389'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-83'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-342'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-341'/>
      <return type-id='type-id-21'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/i40e/rte_pmd_i40e.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_pmd_i40e_inset' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='304' column='1' id='type-id-555'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inset' type-id='type-id-38' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mask' type-id='type-id-556' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pmd_i40e_inset_mask' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='299' column='1' id='type-id-557'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='field_idx' type-id='type-id-102' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mask' type-id='type-id-32' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='301' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-557' size-in-bits='64' id='type-id-556'>
      <subrange length='2' type-id='type-id-43' id='type-id-90'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-558'/>
    <enum-decl name='rte_pmd_i40e_inset_type' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='292' column='1' id='type-id-559'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='INSET_NONE' value='0'/>
      <enumerator name='INSET_HASH' value='1'/>
      <enumerator name='INSET_FDIR' value='2'/>
      <enumerator name='INSET_FDIR_FLX' value='3'/>
    </enum-decl>
    <function-decl name='rte_pmd_i40e_inset_set' mangled-name='rte_pmd_i40e_inset_set' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_inset_set@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3138' column='1'/>
      <parameter type-id='type-id-102' name='pctype' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3138' column='1'/>
      <parameter type-id='type-id-558' name='inset' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3139' column='1'/>
      <parameter type-id='type-id-559' name='inset_type' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3140' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_inset_get' mangled-name='rte_pmd_i40e_inset_get' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_inset_get@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3066' column='1'/>
      <parameter type-id='type-id-102' name='pctype' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3066' column='1'/>
      <parameter type-id='type-id-558' name='inset' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3067' column='1'/>
      <parameter type-id='type-id-559' name='inset_type' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3068' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='rte_pmd_i40e_pkt_template_conf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='283' column='1' id='type-id-560'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='input' type-id='type-id-561' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='action' type-id='type-id-562' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='soft_id' type-id='type-id-5' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='289' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pmd_i40e_pkt_template_input' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='270' column='1' id='type-id-561'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pctype' type-id='type-id-32' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='packet' type-id='type-id-21' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='276' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pmd_i40e_pkt_template_action' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='252' column='1' id='type-id-562'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_queue' type-id='type-id-32' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='behavior' type-id='type-id-563' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='report_status' type-id='type-id-564' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flex_off' type-id='type-id-102' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='264' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_pmd_i40e_pkt_template_behavior' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='228' column='1' id='type-id-563'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_ACCEPT' value='0'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_REJECT' value='1'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_PASSTHRU' value='2'/>
    </enum-decl>
    <enum-decl name='rte_pmd_i40e_pkt_template_status' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='238' column='1' id='type-id-564'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_NO_REPORT_STATUS' value='0'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_REPORT_ID' value='1'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_REPORT_ID_FLEX_4' value='2'/>
      <enumerator name='RTE_PMD_I40E_PKT_TEMPLATE_REPORT_FLEX_8' value='3'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-560' const='yes' id='type-id-565'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <function-decl name='rte_pmd_i40e_flow_add_del_packet_template' mangled-name='rte_pmd_i40e_flow_add_del_packet_template' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_flow_add_del_packet_template@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3036' column='1'/>
      <parameter type-id='type-id-566' name='conf' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3037' column='1'/>
      <parameter type-id='type-id-102' name='add' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='3038' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='rte_pmd_i40e_queue_region_op' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='75' column='1' id='type-id-567'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_UNDEFINED' value='0'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_SET' value='1'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_FLOWTYPE_SET' value='2'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_USER_PRIORITY_SET' value='3'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_ALL_FLUSH_ON' value='4'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_ALL_FLUSH_OFF' value='5'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_INFO_GET' value='6'/>
      <enumerator name='RTE_PMD_I40E_RSS_QUEUE_REGION_OP_MAX' value='7'/>
    </enum-decl>
    <function-decl name='rte_pmd_i40e_rss_queue_region_conf' mangled-name='rte_pmd_i40e_rss_queue_region_conf' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_rss_queue_region_conf@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port_id' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2970' column='1'/>
      <parameter type-id='type-id-567' name='op_type' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2971' column='1'/>
      <parameter type-id='type-id-21' name='arg' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2971' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-568'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <function-decl name='rte_pmd_i40e_query_vfid_by_mac' mangled-name='rte_pmd_i40e_query_vfid_by_mac' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_query_vfid_by_mac@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2500' column='1'/>
      <parameter type-id='type-id-569' name='vf_mac' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2501' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='rte_pmd_i40e_flow_type_mapping' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='862' column='1' id='type-id-570'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flow_type' type-id='type-id-32' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pctype' type-id='type-id-38' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='864' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-571'/>
    <function-decl name='rte_pmd_i40e_flow_type_mapping_update' mangled-name='rte_pmd_i40e_flow_type_mapping_update' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_flow_type_mapping_update@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2447' column='1'/>
      <parameter type-id='type-id-571' name='mapping_items' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2448' column='1'/>
      <parameter type-id='type-id-32' name='count' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2449' column='1'/>
      <parameter type-id='type-id-102' name='exclusive' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2450' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_flow_type_mapping_get' mangled-name='rte_pmd_i40e_flow_type_mapping_get' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_flow_type_mapping_get@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2420' column='1'/>
      <parameter type-id='type-id-571' name='mapping_items' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2421' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_flow_type_mapping_reset' mangled-name='rte_pmd_i40e_flow_type_mapping_reset' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_flow_type_mapping_reset@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2402' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_add_vf_mac_addr' mangled-name='rte_pmd_i40e_add_vf_mac_addr' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_add_vf_mac_addr@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2359' column='1'/>
      <parameter type-id='type-id-32' name='vf_id' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2359' column='1'/>
      <parameter type-id='type-id-100' name='mac_addr' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2360' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_ptype_mapping_replace' mangled-name='rte_pmd_i40e_ptype_mapping_replace' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_ptype_mapping_replace@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2320' column='1'/>
      <parameter type-id='type-id-5' name='target' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2321' column='1'/>
      <parameter type-id='type-id-102' name='mask' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2322' column='1'/>
      <parameter type-id='type-id-5' name='pkt_type' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2323' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='rte_pmd_i40e_ptype_mapping' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='172' column='1' id='type-id-572'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw_ptype' type-id='type-id-32' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sw_ptype' type-id='type-id-5' visibility='default' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-574'/>
    <function-decl name='rte_pmd_i40e_ptype_mapping_get' mangled-name='rte_pmd_i40e_ptype_mapping_get' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_ptype_mapping_get@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2286' column='1'/>
      <parameter type-id='type-id-573' name='mapping_items' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2287' column='1'/>
      <parameter type-id='type-id-32' name='size' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2288' column='1'/>
      <parameter type-id='type-id-574' name='count' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2289' column='1'/>
      <parameter type-id='type-id-102' name='valid_only' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2290' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_ptype_mapping_reset' mangled-name='rte_pmd_i40e_ptype_mapping_reset' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_ptype_mapping_reset@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2402' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_ptype_mapping_update' mangled-name='rte_pmd_i40e_ptype_mapping_update' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_ptype_mapping_update@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2233' column='1'/>
      <parameter type-id='type-id-573' name='mapping_items' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2234' column='1'/>
      <parameter type-id='type-id-32' name='count' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2235' column='1'/>
      <parameter type-id='type-id-102' name='exclusive' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2236' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_pmd_i40e_get_ddp_list' mangled-name='rte_pmd_i40e_get_ddp_list' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pmd_i40e_get_ddp_list@@DPDK_20.0'>
      <parameter type-id='type-id-32' name='port' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2101' column='1'/>
      <parameter type-id='type-id-124' name='buff' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2101' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='../drivers/net/i40e/rte_pmd_i40e.c' line='2101' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='rte_pmd_i40e_package_info' filepath='../drivers/net/i40e/rte_pmd_i40e.h' line='54' column='1' id='type-id-575'>
      <underlying-type type-id='type-id-118'/>
      <enumerator name='RTE_PMD_I40E_PKG_INFO_UNDEFINED' value='0'/>
      <enumerator name='RTE_PMD_I40E_PKG_INFO_GLOBAL_HEADER' value='1'/>
      <enumerator name='RTE_PMD_I40E_PKG_INFO_GLOBAL_NOTES_SIZE' value='2'/>
      <enumerator name='RTE_PMD_I40E_PKG_INFO_GLOBAL_NOTES' value='3'/>
      <enumerator name='RTE_PMD_I40E_PKG_INFO_GLOBAL_MAX' value='1024'/>
      <enumerator name='RTE_PMD_I40E_PKG_INFO_HEADER' value='1025'/>
