<abi-corpus path='gcc//drivers/librte_bus_ifpga.so.20.0' architecture='elf-amd-x86_64' soname='librte_bus_ifpga.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_rawdev.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_ifpga_driver_register' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ifpga_driver_unregister' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ifpga_find_afu_by_name' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ifpga_get_integer32_arg' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ifpga_get_string_arg' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/bus/ifpga/ifpga_common.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <type-decl name='void' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-6'/>
    <function-decl name='rte_ifpga_get_integer32_arg' mangled-name='rte_ifpga_get_integer32_arg' filepath='../drivers/bus/ifpga/ifpga_common.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ifpga_get_integer32_arg@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='key' filepath='../drivers/bus/ifpga/ifpga_common.c' line='45' column='1'/>
      <parameter type-id='type-id-4' name='value' filepath='../drivers/bus/ifpga/ifpga_common.c' line='46' column='1'/>
      <parameter type-id='type-id-6' name='extra_args' filepath='../drivers/bus/ifpga/ifpga_common.c' line='46' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_ifpga_get_string_arg' mangled-name='rte_ifpga_get_string_arg' filepath='../drivers/bus/ifpga/ifpga_common.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ifpga_get_string_arg@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='key' filepath='../drivers/bus/ifpga/ifpga_common.c' line='45' column='1'/>
      <parameter type-id='type-id-4' name='value' filepath='../drivers/bus/ifpga/ifpga_common.c' line='46' column='1'/>
      <parameter type-id='type-id-6' name='extra_args' filepath='../drivers/bus/ifpga/ifpga_common.c' line='46' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/bus/ifpga/ifpga_bus.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='ifpga_bus_logtype' type-id='type-id-1' visibility='default' filepath='../drivers/bus/ifpga/ifpga_logs.h' line='10' column='1'/>
    <class-decl name='rte_afu_device' size-in-bits='217472' is-struct='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='72' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-8' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-9' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rawdev' type-id='type-id-10' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='id' type-id='type-id-11' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='num_region' type-id='type-id-12' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mem_resource' type-id='type-id-13' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='shared' type-id='type-id-14' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='intr_handle' type-id='type-id-15' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215360'>
        <var-decl name='driver' type-id='type-id-16' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215424'>
        <var-decl name='path' type-id='type-id-17' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='73' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-18' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-19' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-22' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-25' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-27' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-29' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-21'/>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-33' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-34' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-35' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-36' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-37' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-38' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-39' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-40' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-41' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-42' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-44' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-45' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-47' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-49' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-33'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-49' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-34'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-53' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-54'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-56' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-36'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-37'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-60' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-38'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='__uint64_t' type-id='type-id-61' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-62'/>
    <typedef-decl name='uint64_t' type-id='type-id-62' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-63'/>
    <typedef-decl name='size_t' type-id='type-id-61' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-64'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-66' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-39'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-66' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-40'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-67' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-68'/>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-67'>
      <underlying-type type-id='type-id-68'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-69'>
      <underlying-type type-id='type-id-68'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-71' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-42'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-73' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-73'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-78' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-43'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-44'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-80'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-80' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-45'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-22'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-83' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-84' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-85' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-86' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-73' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-88' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-88'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-84'>
      <underlying-type type-id='type-id-68'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-85'>
      <underlying-type type-id='type-id-68'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='512' id='type-id-86'>
      <subrange length='64' type-id='type-id-61' id='type-id-89'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-87'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-90' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-90'/>
    <class-decl name='rte_rawdev' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='263' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dev_id' type-id='type-id-92' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_ops' type-id='type-id-93' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-24' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver_name' type-id='type-id-4' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='attached' type-id='type-id-94' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='started' type-id='type-id-94' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_private' type-id='type-id-95' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name' type-id='type-id-86' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-96'/>
    <typedef-decl name='__uint16_t' type-id='type-id-96' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-97'/>
    <typedef-decl name='uint16_t' type-id='type-id-97' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-92'/>
    <class-decl name='rte_rawdev_ops' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='505' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_info_get' type-id='type-id-99' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_configure' type-id='type-id-100' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_start' type-id='type-id-101' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_stop' type-id='type-id-102' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_close' type-id='type-id-103' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_reset' type-id='type-id-104' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='queue_def_conf' type-id='type-id-105' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='queue_setup' type-id='type-id-106' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='queue_release' type-id='type-id-107' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='queue_count' type-id='type-id-108' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='enqueue_bufs' type-id='type-id-109' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dequeue_bufs' type-id='type-id-110' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dump' type-id='type-id-111' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='attr_get' type-id='type-id-112' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='attr_set' type-id='type-id-113' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xstats_get' type-id='type-id-114' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='xstats_get_names' type-id='type-id-115' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='xstats_get_by_name' type-id='type-id-116' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='xstats_reset' type-id='type-id-117' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='firmware_status_get' type-id='type-id-118' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='firmware_version_get' type-id='type-id-119' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='firmware_load' type-id='type-id-120' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='firmware_unload' type-id='type-id-121' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='dev_selftest' type-id='type-id-122' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='561' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='rte_rawdev_obj_t' type-id='type-id-6' filepath='../lib/librte_rawdev/rte_rawdev.h' line='29' column='1' id='type-id-95'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='rawdev_info_get_t' type-id='type-id-124' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='148' column='1' id='type-id-99'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='rawdev_configure_t' type-id='type-id-128' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='162' column='1' id='type-id-100'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='rawdev_start_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='174' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <typedef-decl name='rawdev_stop_t' type-id='type-id-132' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='182' column='1' id='type-id-102'/>
    <typedef-decl name='rawdev_close_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='194' column='1' id='type-id-103'/>
    <typedef-decl name='rawdev_reset_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='205' column='1' id='type-id-104'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <typedef-decl name='rawdev_queue_conf_get_t' type-id='type-id-134' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='218' column='1' id='type-id-105'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <typedef-decl name='rawdev_queue_setup_t' type-id='type-id-136' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='235' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <typedef-decl name='rawdev_queue_release_t' type-id='type-id-138' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='248' column='1' id='type-id-107'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <typedef-decl name='rawdev_queue_count_t' type-id='type-id-140' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='267' column='1' id='type-id-108'/>
    <class-decl name='rte_rawdev_buf' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='302' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-6' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-144'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <typedef-decl name='rawdev_enqueue_bufs_t' type-id='type-id-146' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='291' column='1' id='type-id-109'/>
    <typedef-decl name='rawdev_dequeue_bufs_t' type-id='type-id-146' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='316' column='1' id='type-id-110'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-90' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-148' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-149' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-150' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-96' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-151' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-152' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-153' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-154' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-156' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-149' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-157' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-149'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-159'/>
    <typedef-decl name='__off_t' type-id='type-id-159' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-150'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-151'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-152'>
      <subrange length='1' type-id='type-id-61' id='type-id-160'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-5' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-161'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-153'/>
    <typedef-decl name='__off64_t' type-id='type-id-159' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-154'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-155'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-163'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-156'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='160' id='type-id-157'>
      <subrange length='20' type-id='type-id-61' id='type-id-164'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-147' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <typedef-decl name='rawdev_dump_t' type-id='type-id-168' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='333' column='1' id='type-id-111'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='rawdev_get_attr_t' type-id='type-id-171' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='350' column='1' id='type-id-112'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-172'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <typedef-decl name='rawdev_set_attr_t' type-id='type-id-174' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='368' column='1' id='type-id-113'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <typedef-decl name='rawdev_xstats_get_t' type-id='type-id-178' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='388' column='1' id='type-id-114'/>
    <class-decl name='rte_rawdev_xstats_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='433' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-86' visibility='default' filepath='../lib/librte_rawdev/rte_rawdev.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <typedef-decl name='rawdev_xstats_get_names_t' type-id='type-id-182' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='413' column='1' id='type-id-115'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <typedef-decl name='rawdev_xstats_get_by_name_t' type-id='type-id-185' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='432' column='1' id='type-id-116'/>
    <typedef-decl name='__uint32_t' type-id='type-id-144' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-186'/>
    <typedef-decl name='uint32_t' type-id='type-id-186' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-12'/>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-187'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <typedef-decl name='rawdev_xstats_reset_t' type-id='type-id-190' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='394' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <typedef-decl name='rawdev_firmware_status_get_t' type-id='type-id-192' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='448' column='1' id='type-id-118'/>
    <typedef-decl name='rawdev_firmware_version_get_t' type-id='type-id-192' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='462' column='1' id='type-id-119'/>
    <typedef-decl name='rawdev_firmware_load_t' type-id='type-id-192' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='479' column='1' id='type-id-120'/>
    <typedef-decl name='rawdev_firmware_unload_t' type-id='type-id-130' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='494' column='1' id='type-id-121'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <typedef-decl name='rawdev_selftest_t' type-id='type-id-194' filepath='../lib/librte_rawdev/rte_rawdev_pmd.h' line='502' column='1' id='type-id-122'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-195'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-93'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-196'/>
    <typedef-decl name='__uint8_t' type-id='type-id-196' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-197'/>
    <typedef-decl name='uint8_t' type-id='type-id-197' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-94'/>
    <class-decl name='rte_afu_id' size-in-bits='160' is-struct='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='47' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uuid' type-id='type-id-198' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='port' type-id='type-id-1' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_afu_uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='36' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uuid_low' type-id='type-id-63' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid_high' type-id='type-id-63' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mem_resource' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='80' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phys_addr' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='83' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='1152' id='type-id-13'>
      <subrange length='6' type-id='type-id-61' id='type-id-200'/>

    </array-type-def>
    <class-decl name='rte_afu_shared' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='64' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-201' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-6' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-201' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='30' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-203' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-1' volatile='yes' id='type-id-203'/>
    <typedef-decl name='rte_spinlock_t' type-id='type-id-202' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='32' column='1' id='type-id-201'/>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-205' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-206' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-207' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-208' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-204'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-68'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='16384' id='type-id-206'>
      <subrange length='512' type-id='type-id-61' id='type-id-209'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-211' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-212' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-12' volatile='yes' id='type-id-211'/>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-213' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-215'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-215' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-213'/>

    <array-type-def dimensions='1' type-id='type-id-210' size-in-bits='196608' id='type-id-207'>
      <subrange length='512' type-id='type-id-61' id='type-id-209'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-208'/>
    <class-decl name='rte_afu_driver' size-in-bits='576' is-struct='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='106' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-217' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver' type-id='type-id-26' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='probe' type-id='type-id-218' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='remove' type-id='type-id-219' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='id_table' type-id='type-id-220' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='107' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-16' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-221' visibility='default' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-221'/>
    <typedef-decl name='afu_probe_t' type-id='type-id-222' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='96' column='1' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-218'/>
    <typedef-decl name='afu_remove_t' type-id='type-id-222' filepath='../drivers/bus/ifpga/rte_bus_ifpga.h' line='101' column='1' id='type-id-224'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-219'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-220'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='2048' id='type-id-17'>
      <subrange length='256' type-id='type-id-61' id='type-id-226'/>

    </array-type-def>
    <function-decl name='rte_ifpga_find_afu_by_name' mangled-name='rte_ifpga_find_afu_by_name' filepath='../drivers/bus/ifpga/ifpga_bus.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ifpga_find_afu_by_name@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='name' filepath='../drivers/bus/ifpga/ifpga_bus.c' line='77' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='rte_ifpga_driver_unregister' mangled-name='rte_ifpga_driver_unregister' filepath='../drivers/bus/ifpga/ifpga_bus.c' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ifpga_driver_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-16' name='driver' filepath='../drivers/bus/ifpga/ifpga_bus.c' line='56' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='rte_ifpga_driver_register' mangled-name='rte_ifpga_driver_register' filepath='../drivers/bus/ifpga/ifpga_bus.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ifpga_driver_register@@DPDK_20.0'>
      <parameter type-id='type-id-16' name='driver' filepath='../drivers/bus/ifpga/ifpga_bus.c' line='48' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-70'>
      <return type-id='type-id-69'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-48'>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-59'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-52'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-144'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-181'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-144'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-222'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-1'/>
    </function-type>
