<abi-corpus path='gcc//drivers/librte_bus_pci.so.20.0' architecture='elf-amd-x86_64' soname='librte_bus_pci.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_pci_dump' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_get_sysfs_path' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_ioport_map' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_ioport_read' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_ioport_unmap' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_ioport_write' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_map_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_read_config' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_register' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_unmap_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_unregister' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pci_write_config' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/bus/pci/pci_common.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_pci_bus' size-in-bits='1280' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='172' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bus' type-id='type-id-2' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='device_list' type-id='type-id-3' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='driver_list' type-id='type-id-4' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-9' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-11' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-14' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-15' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-16' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-17' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <type-decl name='char' size-in-bits='8' id='type-id-22'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-6'/>
    <type-decl name='int' size-in-bits='32' id='type-id-24'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-26'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-26' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-7'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-26' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-8'/>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-29' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-30' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-33' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-35' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-36' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-37' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-30'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-41' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-42' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-44' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-47' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-47'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-48'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-42'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-43'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-49'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='512' id='type-id-44'>
      <subrange length='64' type-id='type-id-49' id='type-id-50'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-45'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-51' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-51'/>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-46'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <type-decl name='void' id='type-id-55'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-59'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-61' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-63' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-10'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-63' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-11'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-65'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-65' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-12'/>
    <typedef-decl name='__uint64_t' type-id='type-id-49' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-66'/>
    <typedef-decl name='uint64_t' type-id='type-id-66' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-67'/>
    <typedef-decl name='size_t' type-id='type-id-49' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-68'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-70' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-13'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-70' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-14'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-71' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-71'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-72'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-74' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-16'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-46' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-79' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-17'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-63' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-18'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-81' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-19'/>
    <class-decl name='rte_pci_device_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='41' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-82' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-83' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_device' size-in-bits='428736' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='57' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-85' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-27' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='addr' type-id='type-id-86' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='id' type-id='type-id-87' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mem_resource' type-id='type-id-88' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='intr_handle' type-id='type-id-89' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215168'>
        <var-decl name='driver' type-id='type-id-90' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215232'>
        <var-decl name='max_vfs' type-id='type-id-91' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215264'>
        <var-decl name='kdrv' type-id='type-id-92' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215296'>
        <var-decl name='name' type-id='type-id-93' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215488'>
        <var-decl name='vfio_req_intr_handle' type-id='type-id-89' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-82' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-83' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <class-decl name='rte_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='61' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-94' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='type-id-95' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='devid' type-id='type-id-95' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='function' type-id='type-id-95' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-96'/>
    <typedef-decl name='__uint32_t' type-id='type-id-96' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-97'/>
    <typedef-decl name='uint32_t' type-id='type-id-97' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-94'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-98'/>
    <typedef-decl name='__uint8_t' type-id='type-id-98' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-99'/>
    <typedef-decl name='uint8_t' type-id='type-id-99' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-95'/>
    <class-decl name='rte_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='50' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='type-id-94' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-91' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='type-id-91' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subsystem_vendor_id' type-id='type-id-91' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subsystem_device_id' type-id='type-id-91' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-100'/>
    <typedef-decl name='__uint16_t' type-id='type-id-100' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-101'/>
    <typedef-decl name='uint16_t' type-id='type-id-101' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-91'/>
    <class-decl name='rte_mem_resource' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='80' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phys_addr' type-id='type-id-67' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-67' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='83' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='1152' id='type-id-88'>
      <subrange length='6' type-id='type-id-49' id='type-id-103'/>

    </array-type-def>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-105' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-95' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-106' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-107' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-108' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-104'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-105'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='16384' id='type-id-106'>
      <subrange length='512' type-id='type-id-49' id='type-id-109'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-111' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-94' volatile='yes' id='type-id-111'/>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-113' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-115' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-113'/>

    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='196608' id='type-id-107'>
      <subrange length='512' type-id='type-id-49' id='type-id-109'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-108'/>
    <class-decl name='rte_pci_driver' size-in-bits='832' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='157' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-117' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver' type-id='type-id-34' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bus' type-id='type-id-118' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='probe' type-id='type-id-119' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='remove' type-id='type-id-120' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-121' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-122' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='id_table' type-id='type-id-123' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drv_flags' type-id='type-id-94' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-90' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-124' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-118'/>
    <typedef-decl name='pci_probe_t' type-id='type-id-125' filepath='../drivers/bus/pci/rte_bus_pci.h' line='109' column='1' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-119'/>
    <typedef-decl name='pci_remove_t' type-id='type-id-127' filepath='../drivers/bus/pci/rte_bus_pci.h' line='114' column='1' id='type-id-128'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-120'/>
    <typedef-decl name='pci_dma_map_t' type-id='type-id-129' filepath='../drivers/bus/pci/rte_bus_pci.h' line='132' column='1' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-121'/>
    <typedef-decl name='pci_dma_unmap_t' type-id='type-id-129' filepath='../drivers/bus/pci/rte_bus_pci.h' line='151' column='1' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-122'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-132'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-123'/>
    <enum-decl name='rte_kernel_driver' filepath='../lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-92'>
      <underlying-type type-id='type-id-48'/>
      <enumerator name='RTE_KDRV_UNKNOWN' value='0'/>
      <enumerator name='RTE_KDRV_IGB_UIO' value='1'/>
      <enumerator name='RTE_KDRV_VFIO' value='2'/>
      <enumerator name='RTE_KDRV_UIO_GENERIC' value='3'/>
      <enumerator name='RTE_KDRV_NIC_UIO' value='4'/>
      <enumerator name='RTE_KDRV_NONE' value='5'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='144' id='type-id-93'>
      <subrange length='18' type-id='type-id-49' id='type-id-133'/>

    </array-type-def>
    <class-decl name='rte_pci_driver_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='43' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-90' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-124' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='rte_pci_bus' type-id='type-id-1' visibility='default' filepath='../drivers/bus/pci/private.h' line='13' column='1'/>
    <function-decl name='rte_pci_unregister' mangled-name='rte_pci_unregister' filepath='../drivers/bus/pci/pci_common.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-90' name='driver' filepath='../drivers/bus/pci/pci_common.c' line='383' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_pci_register' mangled-name='rte_pci_register' filepath='../drivers/bus/pci/pci_common.c' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_register@@DPDK_20.0'>
      <parameter type-id='type-id-90' name='driver' filepath='../drivers/bus/pci/pci_common.c' line='383' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-135' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-137' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-100' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-138' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-139' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-140' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-141' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-142' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-143' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-56' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-144' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-136'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-146'/>
    <typedef-decl name='__off_t' type-id='type-id-146' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-137'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-138'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='8' id='type-id-139'>
      <subrange length='1' type-id='type-id-49' id='type-id-147'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-55' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-140'/>
    <typedef-decl name='__off64_t' type-id='type-id-146' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-141'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-142'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-143'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='160' id='type-id-144'>
      <subrange length='20' type-id='type-id-49' id='type-id-151'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-134' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-152'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <function-decl name='rte_pci_dump' mangled-name='rte_pci_dump' filepath='../drivers/bus/pci/pci_common.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_dump@@DPDK_20.0'>
      <parameter type-id='type-id-153' name='f' filepath='../drivers/bus/pci/pci_common.c' line='351' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_pci_get_sysfs_path' mangled-name='rte_pci_get_sysfs_path' filepath='../drivers/bus/pci/pci_common.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_get_sysfs_path@@DPDK_20.0'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-73'>
      <return type-id='type-id-72'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-25'>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-57'>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-62'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-69'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-80'>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-60'>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-55'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-56'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/bus/pci/linux/pci.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_pci_ioport' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='293' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev' type-id='type-id-82' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base' type-id='type-id-67' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-67' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <function-decl name='rte_pci_ioport_unmap' mangled-name='rte_pci_ioport_unmap' filepath='../drivers/bus/pci/linux/pci.c' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_ioport_unmap@@DPDK_20.0'>
      <parameter type-id='type-id-155' name='p' filepath='../drivers/bus/pci/linux/pci.c' line='804' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <typedef-decl name='off_t' type-id='type-id-141' filepath='/usr/include/stdio.h' line='65' column='1' id='type-id-156'/>
    <function-decl name='rte_pci_ioport_write' mangled-name='rte_pci_ioport_write' filepath='../drivers/bus/pci/linux/pci.c' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_ioport_write@@DPDK_20.0'>
      <parameter type-id='type-id-155' name='p' filepath='../drivers/bus/pci/linux/pci.c' line='778' column='1'/>
      <parameter type-id='type-id-56' name='data' filepath='../drivers/bus/pci/linux/pci.c' line='779' column='1'/>
      <parameter type-id='type-id-68' name='len' filepath='../drivers/bus/pci/linux/pci.c' line='779' column='1'/>
      <parameter type-id='type-id-156' name='offset' filepath='../drivers/bus/pci/linux/pci.c' line='779' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_pci_ioport_read' mangled-name='rte_pci_ioport_read' filepath='../drivers/bus/pci/linux/pci.c' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_ioport_read@@DPDK_20.0'>
      <parameter type-id='type-id-155' name='p' filepath='../drivers/bus/pci/linux/pci.c' line='778' column='1'/>
      <parameter type-id='type-id-56' name='data' filepath='../drivers/bus/pci/linux/pci.c' line='779' column='1'/>
      <parameter type-id='type-id-68' name='len' filepath='../drivers/bus/pci/linux/pci.c' line='779' column='1'/>
      <parameter type-id='type-id-156' name='offset' filepath='../drivers/bus/pci/linux/pci.c' line='779' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_pci_ioport_map' mangled-name='rte_pci_ioport_map' filepath='../drivers/bus/pci/linux/pci.c' line='714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_ioport_map@@DPDK_20.0'>
      <parameter type-id='type-id-82' name='dev' filepath='../drivers/bus/pci/linux/pci.c' line='714' column='1'/>
      <parameter type-id='type-id-24' name='bar' filepath='../drivers/bus/pci/linux/pci.c' line='714' column='1'/>
      <parameter type-id='type-id-155' name='p' filepath='../drivers/bus/pci/linux/pci.c' line='715' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <function-decl name='rte_pci_write_config' mangled-name='rte_pci_write_config' filepath='../drivers/bus/pci/linux/pci.c' line='625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pci_write_config@@DPDK_20.0'>
      <parameter type-id='type-id-158' name='device' filepath='../drivers/bus/pci/linux/pci.c' line='625' column='1'/>
      <parameter type-id='type-id-56' name='buf' filepath='../drivers/bus/pci/linux/pci.c' line='626' column='1'/>
      <parameter type-id='type-id-68' name='len' filepath='../drivers/bus/pci/linux/pci.c' line='626' column='1'/>
      <parameter type-id='type-id-156' name='offset' filepath='../drivers/bus/pci/linux/pci.c' line='626' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
