<abi-corpus path='gcc//drivers/librte_pmd_virtio.so.20.0' architecture='elf-amd-x86_64' soname='librte_pmd_virtio.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_vdev.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/virtio/virtio_ethdev.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='virtio_logtype_init' type-id='type-id-1' visibility='default' filepath='../drivers/net/virtio/virtio_logs.h' line='10' column='1'/>
    <var-decl name='virtio_logtype_driver' type-id='type-id-1' visibility='default' filepath='../drivers/net/virtio/virtio_logs.h' line='31' column='1'/>
    <class-decl name='virtio_hw_internal' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='279' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtpci_ops' type-id='type-id-3' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io' type-id='type-id-4' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='281' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_pci_ops' size-in-bits='832' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='209' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_dev_cfg' type-id='type-id-6' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_dev_cfg' type-id='type-id-6' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_status' type-id='type-id-7' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_status' type-id='type-id-8' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_features' type-id='type-id-9' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_features' type-id='type-id-10' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_isr' type-id='type-id-7' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='set_config_irq' type-id='type-id-11' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='set_queue_irq' type-id='type-id-12' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_queue_num' type-id='type-id-11' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='setup_queue' type-id='type-id-13' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='del_queue' type-id='type-id-14' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='notify_queue' type-id='type-id-14' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='231' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-15'/>
    <class-decl name='virtio_hw' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='236' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cvq' type-id='type-id-17' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='req_guest_features' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='guest_features' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_queue_pairs' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='started' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='max_mtu' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vtnet_hdr_size' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='vlan_strip' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='use_msix' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='modern' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='use_simple_rx' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='use_inorder_rx' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='312'>
        <var-decl name='use_inorder_tx' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='weak_barriers' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='has_tx_offload' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='has_rx_offload' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='port_id' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='mac_addr' type-id='type-id-23' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='notify_off_multiplier' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='isr' type-id='type-id-24' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='notify_base' type-id='type-id-25' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='common_cfg' type-id='type-id-26' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dev_cfg' type-id='type-id-27' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='virtio_user_dev' type-id='type-id-28' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='state_lock' type-id='type-id-29' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='inject_pkts' type-id='type-id-30' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='opened' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='vqs' type-id='type-id-31' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtnet_ctl' size-in-bits='384' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='51' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vq' type-id='type-id-33' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='virtio_net_hdr_mz' type-id='type-id-34' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='virtio_net_hdr_mem' type-id='type-id-35' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='port_id' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mz' type-id='type-id-34' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock' type-id='type-id-29' visibility='default' filepath='../drivers/net/virtio/virtio_rxtx.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtqueue' size-in-bits='4608' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='239' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw' type-id='type-id-37' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vq_used_cons_idx' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='vq_nentries' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vq_free_cnt' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='vq_avail_idx' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vq_free_thresh' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='vq_ring_virt_mem' type-id='type-id-28' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='vq_ring_size' type-id='type-id-39' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='vq_ring_mem' type-id='type-id-35' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='vq_desc_head_idx' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='vq_desc_tail_idx' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='vq_queue_index' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='offset' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='notify_addr' type-id='type-id-25' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sw_ring' type-id='type-id-30' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='vq_descx' type-id='type-id-40' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='285' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-37'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='241' column='1' id='type-id-38'>
      <data-member access='private'>
        <var-decl name='vq_split' type-id='type-id-41' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='245' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vq_packed' type-id='type-id-42' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='253' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='242' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ring' type-id='type-id-43' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='244' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vring' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_user/../virtio_ring.h' line='91' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='type-id-39' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='type-id-44' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avail' type-id='type-id-45' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='used' type-id='type-id-46' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-39'/>
    <class-decl name='vring_desc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='39' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='next' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-48'/>
    <typedef-decl name='__uint64_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-49'/>
    <typedef-decl name='uint64_t' type-id='type-id-49' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-18'/>
    <typedef-decl name='__uint32_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-50'/>
    <typedef-decl name='uint32_t' type-id='type-id-50' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-19'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-51'/>
    <typedef-decl name='__uint16_t' type-id='type-id-51' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-52'/>
    <typedef-decl name='uint16_t' type-id='type-id-52' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-44'/>
    <class-decl name='vring_avail' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='46' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='idx' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ring' type-id='type-id-54' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='49' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='infinite' id='type-id-54'>
      <subrange length='infinite' type-id='type-id-48' id='type-id-55'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-45'/>
    <class-decl name='vring_used' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='60' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='idx' type-id='type-id-57' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ring' type-id='type-id-58' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-21' volatile='yes' id='type-id-57'/>
    <class-decl name='vring_used_elem' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='53' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='57' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='infinite' id='type-id-58'>
      <subrange length='infinite' type-id='type-id-48' id='type-id-55'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-46'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='247' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ring' type-id='type-id-60' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='used_wrap_counter' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='cached_flags' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='event_flags_shadow' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='252' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_packed' size-in-bits='256' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_user/../virtio_ring.h' line='84' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='type-id-39' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='type-id-61' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver' type-id='type-id-62' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device' type-id='type-id-62' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_packed_desc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='69' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='id' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='flags' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-61'/>
    <class-decl name='vring_packed_desc_event' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='79' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='desc_event_off_wrap' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='desc_event_flags' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_ring.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-62'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-20'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-28'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-18' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-25'/>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-66' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-28' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-68' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-66' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-19' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-66' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-69' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-70' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-19' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-71' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-72' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='infinite' id='type-id-73'>
      <subrange length='infinite' type-id='type-id-48' id='type-id-55'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-73' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-66'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-67'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-35' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-35' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='infinite' id='type-id-74'>
      <subrange length='infinite' type-id='type-id-48' id='type-id-55'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-74' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-68'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-76' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-34' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-78' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-79' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-80' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-81' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-82'/>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='256' id='type-id-76'>
      <subrange length='32' type-id='type-id-48' id='type-id-83'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-77'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-76' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-86' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-78' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-85'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-87' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-35' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-18' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-87'/>
    <typedef-decl name='size_t' type-id='type-id-48' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-86'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-88'/>
    <typedef-decl name='int32_t' type-id='type-id-88' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-78'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-34'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-91' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='98304' id='type-id-91'>
      <subrange length='1536' type-id='type-id-48' id='type-id-92'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-79'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-93' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-94' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-96' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-69' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-97' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-93' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-69'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-97'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-35' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-87' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-98' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-99' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-101' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-69' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-86' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-103' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-98' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-98'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-102'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-35' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-87' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-104' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-105'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-70'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-107' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-28' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-108' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-110' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-107'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-108' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-113'/>
    <typedef-decl name='__int16_t' type-id='type-id-113' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-114'/>
    <typedef-decl name='int16_t' type-id='type-id-114' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-115'/>
    <qualified-type-def type-id='type-id-115' volatile='yes' id='type-id-112'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-111' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-108'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-71'/>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='128' id='type-id-72'>
      <subrange length='2' type-id='type-id-48' id='type-id-116'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-30'/>
    <class-decl name='vq_desc_extra' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='233' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cookie' type-id='type-id-28' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ndescs' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='next' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtqueue.h' line='236' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-117' size-in-bits='infinite' id='type-id-40'>
      <subrange length='infinite' type-id='type-id-48' id='type-id-55'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-33'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-29' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='30' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-119' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-1' volatile='yes' id='type-id-119'/>
    <typedef-decl name='rte_spinlock_t' type-id='type-id-118' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='32' column='1' id='type-id-29'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-17'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-120'/>
    <typedef-decl name='__uint8_t' type-id='type-id-120' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-121'/>
    <typedef-decl name='uint8_t' type-id='type-id-121' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-22'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='48' id='type-id-23'>
      <subrange length='6' type-id='type-id-48' id='type-id-122'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-24'/>
    <class-decl name='virtio_pci_common_cfg' size-in-bits='448' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='182' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device_feature_select' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_feature' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guest_feature_select' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='guest_feature' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='msix_config' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='num_queues' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_status' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='config_generation' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='queue_select' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='queue_size' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='queue_msix_vector' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='queue_enable' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='queue_notify_off' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queue_desc_lo' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='queue_desc_hi' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='queue_avail_lo' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='queue_avail_hi' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='queue_used_lo' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='queue_used_hi' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='204' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-26'/>
    <class-decl name='virtio_net_config' size-in-bits='96' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='295' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mac' type-id='type-id-23' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_virtqueue_pairs' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='mtu' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-14'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-3'/>
    <class-decl name='rte_pci_ioport' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='293' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev' type-id='type-id-135' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base' type-id='type-id-18' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_device' size-in-bits='428736' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='57' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-137' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-138' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='addr' type-id='type-id-139' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='id' type-id='type-id-140' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mem_resource' type-id='type-id-141' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='intr_handle' type-id='type-id-142' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215168'>
        <var-decl name='driver' type-id='type-id-143' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215232'>
        <var-decl name='max_vfs' type-id='type-id-21' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215264'>
        <var-decl name='kdrv' type-id='type-id-144' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215296'>
        <var-decl name='name' type-id='type-id-145' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='215488'>
        <var-decl name='vfio_req_intr_handle' type-id='type-id-142' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-135' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-146' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-146'/>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-147' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-149' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-150' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-151' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-152' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-153' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-154'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-148'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-156' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-157' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-158' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <qualified-type-def type-id='type-id-155' const='yes' id='type-id-159'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-149'/>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-161' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-162' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-163' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-164' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-165' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-166' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-167' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-168' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-169' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-170' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-171' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-172' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-173' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-174' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-175' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-176' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-178' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-162'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-178' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-163'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-179'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-182' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-183'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-185' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-164'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-187' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-165'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-187' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-166'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-189' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-167'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-191' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-168'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-191' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-169'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-192' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-193'/>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-192'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-194'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-196' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-171'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-175' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-198' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-152' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-199'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-203'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-203' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-172'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-187' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-205' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-174'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-150'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-208' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-209' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-210' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-211' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-175' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-198' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-151' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-213' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-213'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-209'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-210'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='512' id='type-id-211'>
      <subrange length='64' type-id='type-id-48' id='type-id-214'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-212'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-215' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-148' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-215'/>
    <class-decl name='rte_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='61' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-19' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='type-id-22' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='devid' type-id='type-id-22' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='function' type-id='type-id-22' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='50' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='type-id-19' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subsystem_vendor_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subsystem_device_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mem_resource' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='80' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phys_addr' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='83' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-216' size-in-bits='1152' id='type-id-141'>
      <subrange length='6' type-id='type-id-48' id='type-id-122'/>

    </array-type-def>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-218' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-22' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-219' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-220' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-221' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-217'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-218'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='16384' id='type-id-219'>
      <subrange length='512' type-id='type-id-48' id='type-id-222'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-224' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-225' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-19' volatile='yes' id='type-id-224'/>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-226' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-228'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-228' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-226'/>

    <array-type-def dimensions='1' type-id='type-id-223' size-in-bits='196608' id='type-id-220'>
      <subrange length='512' type-id='type-id-48' id='type-id-222'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-221'/>
    <class-decl name='rte_pci_driver' size-in-bits='832' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='157' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-230' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver' type-id='type-id-155' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bus' type-id='type-id-231' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='probe' type-id='type-id-232' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='remove' type-id='type-id-233' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-234' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-235' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='id_table' type-id='type-id-236' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drv_flags' type-id='type-id-19' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-143' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-237' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-237'/>
    <class-decl name='rte_pci_bus' size-in-bits='1280' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='172' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bus' type-id='type-id-160' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='device_list' type-id='type-id-239' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='driver_list' type-id='type-id-240' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_device_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='41' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-135' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-146' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_driver_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='43' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-143' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-237' visibility='default' filepath='../drivers/bus/pci/rte_bus_pci.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-231'/>
    <typedef-decl name='pci_probe_t' type-id='type-id-241' filepath='../drivers/bus/pci/rte_bus_pci.h' line='109' column='1' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-232'/>
    <typedef-decl name='pci_remove_t' type-id='type-id-243' filepath='../drivers/bus/pci/rte_bus_pci.h' line='114' column='1' id='type-id-244'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-233'/>
    <typedef-decl name='pci_dma_map_t' type-id='type-id-245' filepath='../drivers/bus/pci/rte_bus_pci.h' line='132' column='1' id='type-id-246'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-234'/>
    <typedef-decl name='pci_dma_unmap_t' type-id='type-id-245' filepath='../drivers/bus/pci/rte_bus_pci.h' line='151' column='1' id='type-id-247'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-235'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-236'/>
    <enum-decl name='rte_kernel_driver' filepath='../lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-144'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_KDRV_UNKNOWN' value='0'/>
      <enumerator name='RTE_KDRV_IGB_UIO' value='1'/>
      <enumerator name='RTE_KDRV_VFIO' value='2'/>
      <enumerator name='RTE_KDRV_UIO_GENERIC' value='3'/>
      <enumerator name='RTE_KDRV_NIC_UIO' value='4'/>
      <enumerator name='RTE_KDRV_NONE' value='5'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='144' id='type-id-145'>
      <subrange length='18' type-id='type-id-48' id='type-id-249'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8192' id='type-id-250'>
      <subrange length='32' type-id='type-id-48' id='type-id-83'/>

    </array-type-def>
    <var-decl name='virtio_hw_internal' type-id='type-id-250' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='287' column='1'/>
    <class-decl name='eth_dev_ops' size-in-bits='6016' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='609' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_configure' type-id='type-id-252' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_start' type-id='type-id-253' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_stop' type-id='type-id-254' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_set_link_up' type-id='type-id-255' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_set_link_down' type-id='type-id-256' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_close' type-id='type-id-257' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dev_reset' type-id='type-id-258' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link_update' type-id='type-id-259' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='is_removed' type-id='type-id-260' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='promiscuous_enable' type-id='type-id-261' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='promiscuous_disable' type-id='type-id-262' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='allmulticast_enable' type-id='type-id-263' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='allmulticast_disable' type-id='type-id-264' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mac_addr_remove' type-id='type-id-265' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='mac_addr_add' type-id='type-id-266' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='mac_addr_set' type-id='type-id-267' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_mc_addr_list' type-id='type-id-268' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mtu_set' type-id='type-id-269' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='stats_get' type-id='type-id-270' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='stats_reset' type-id='type-id-271' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='xstats_get' type-id='type-id-272' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='xstats_reset' type-id='type-id-273' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='xstats_get_names' type-id='type-id-274' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='queue_stats_mapping_set' type-id='type-id-275' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='dev_infos_get' type-id='type-id-276' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rxq_info_get' type-id='type-id-277' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='txq_info_get' type-id='type-id-278' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='rx_burst_mode_get' type-id='type-id-279' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tx_burst_mode_get' type-id='type-id-279' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='fw_version_get' type-id='type-id-280' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dev_supported_ptypes_get' type-id='type-id-281' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='dev_ptypes_set' type-id='type-id-282' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='vlan_filter_set' type-id='type-id-283' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='vlan_tpid_set' type-id='type-id-284' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='vlan_strip_queue_set' type-id='type-id-285' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='vlan_offload_set' type-id='type-id-286' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='vlan_pvid_set' type-id='type-id-287' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='rx_queue_start' type-id='type-id-288' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='rx_queue_stop' type-id='type-id-289' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tx_queue_start' type-id='type-id-288' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tx_queue_stop' type-id='type-id-289' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='rx_queue_setup' type-id='type-id-290' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='rx_queue_release' type-id='type-id-291' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='rx_queue_count' type-id='type-id-292' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='rx_descriptor_done' type-id='type-id-293' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='rx_descriptor_status' type-id='type-id-294' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tx_descriptor_status' type-id='type-id-295' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='rx_queue_intr_enable' type-id='type-id-296' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='rx_queue_intr_disable' type-id='type-id-297' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tx_queue_setup' type-id='type-id-298' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tx_queue_release' type-id='type-id-291' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tx_done_cleanup' type-id='type-id-299' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dev_led_on' type-id='type-id-300' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dev_led_off' type-id='type-id-301' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='flow_ctrl_get' type-id='type-id-302' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='flow_ctrl_set' type-id='type-id-303' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='priority_flow_ctrl_set' type-id='type-id-304' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='uc_hash_table_set' type-id='type-id-305' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='uc_all_hash_table_set' type-id='type-id-306' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='mirror_rule_set' type-id='type-id-307' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='mirror_rule_reset' type-id='type-id-308' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='udp_tunnel_port_add' type-id='type-id-309' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='udp_tunnel_port_del' type-id='type-id-310' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='l2_tunnel_eth_type_conf' type-id='type-id-311' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='l2_tunnel_offload_set' type-id='type-id-312' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='set_queue_rate_limit' type-id='type-id-313' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='rss_hash_update' type-id='type-id-314' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='rss_hash_conf_get' type-id='type-id-315' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='reta_update' type-id='type-id-316' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='reta_query' type-id='type-id-317' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='get_reg' type-id='type-id-318' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='get_eeprom_length' type-id='type-id-319' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='get_eeprom' type-id='type-id-320' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='set_eeprom' type-id='type-id-321' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='get_module_info' type-id='type-id-322' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='get_module_eeprom' type-id='type-id-323' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='filter_ctrl' type-id='type-id-324' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='get_dcb_info' type-id='type-id-325' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='timesync_enable' type-id='type-id-326' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='timesync_disable' type-id='type-id-327' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='timesync_read_rx_timestamp' type-id='type-id-328' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='timesync_read_tx_timestamp' type-id='type-id-329' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='timesync_adjust_time' type-id='type-id-330' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='timesync_read_time' type-id='type-id-331' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='timesync_write_time' type-id='type-id-332' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='read_clock' type-id='type-id-333' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='xstats_get_by_id' type-id='type-id-334' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='xstats_get_names_by_id' type-id='type-id-335' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='tm_ops_get' type-id='type-id-336' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='mtr_ops_get' type-id='type-id-337' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='pool_ops_supported' type-id='type-id-338' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='hairpin_cap_get' type-id='type-id-339' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='rx_hairpin_queue_setup' type-id='type-id-340' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='tx_hairpin_queue_setup' type-id='type-id-341' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev' size-in-bits='132608' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='777' column='1' id='type-id-342'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_pkt_burst' type-id='type-id-343' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_pkt_burst' type-id='type-id-344' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tx_pkt_prepare' type-id='type-id-345' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-346' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='process_private' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_ops' type-id='type-id-347' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='device' type-id='type-id-152' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='intr_handle' type-id='type-id-348' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='link_intr_cbs' type-id='type-id-349' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='post_rx_burst_cbs' type-id='type-id-350' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='pre_tx_burst_cbs' type-id='type-id-350' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131712'>
        <var-decl name='state' type-id='type-id-351' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131776'>
        <var-decl name='security_ctx' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131840'>
        <var-decl name='reserved_64s' type-id='type-id-352' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132096'>
        <var-decl name='reserved_ptrs' type-id='type-id-353' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='807' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <typedef-decl name='eth_rx_burst_t' type-id='type-id-355' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='340' column='1' id='type-id-343'/>
    <typedef-decl name='eth_tx_burst_t' type-id='type-id-355' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='345' column='1' id='type-id-344'/>
    <typedef-decl name='eth_tx_prep_t' type-id='type-id-355' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='350' column='1' id='type-id-345'/>
    <class-decl name='rte_eth_dev_data' size-in-bits='55808' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='820' column='1' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-211' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_queues' type-id='type-id-357' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_queues' type-id='type-id-357' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_rx_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='nb_tx_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='sriov' type-id='type-id-358' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dev_private' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_link' type-id='type-id-359' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dev_conf' type-id='type-id-360' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='mtu' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25568'>
        <var-decl name='min_rx_buf_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='rx_mbuf_alloc_failed' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25664'>
        <var-decl name='mac_addrs' type-id='type-id-361' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='mac_pool_sel' type-id='type-id-362' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='hash_mac_addrs' type-id='type-id-361' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33984'>
        <var-decl name='port_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='promiscuous' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='scattered_rx' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='all_multicast' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dev_started' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='lro' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34008'>
        <var-decl name='rx_queue_state' type-id='type-id-363' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42200'>
        <var-decl name='tx_queue_state' type-id='type-id-363' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50400'>
        <var-decl name='dev_flags' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50432'>
        <var-decl name='kdrv' type-id='type-id-144' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50464'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50496'>
        <var-decl name='vlan_filter_conf' type-id='type-id-364' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54592'>
        <var-decl name='owner' type-id='type-id-365' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55168'>
        <var-decl name='representor_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55232'>
        <var-decl name='reserved_64s' type-id='type-id-352' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55488'>
        <var-decl name='reserved_ptrs' type-id='type-id-353' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='876' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-357'/>
    <class-decl name='rte_eth_dev_sriov' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1476' column='1' id='type-id-358'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='active' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_q_per_pool' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='def_vmdq_idx' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='def_pool_q_idx' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1480' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_link' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='308' column='1' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speed' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='link_duplex' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='link_autoneg' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='link_status' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_conf' size-in-bits='24640' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1045' column='1' id='type-id-360'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speeds' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rxmode' type-id='type-id-366' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='txmode' type-id='type-id-367' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='lpbk_mode' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rx_adv_conf' type-id='type-id-368' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1068' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='tx_adv_conf' type-id='type-id-369' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18080'>
        <var-decl name='dcb_capability_en' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='fdir_conf' type-id='type-id-370' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='intr_conf' type-id='type-id-371' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1081' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rxmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='394' column='1' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-372' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_rx_pkt_len' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='split_hdr_size' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-72' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-373' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='409' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_rx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='344' column='1' id='type-id-372'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='ETH_MQ_RX_NONE' value='0'/>
      <enumerator name='ETH_MQ_RX_RSS' value='1'/>
      <enumerator name='ETH_MQ_RX_DCB' value='2'/>
      <enumerator name='ETH_MQ_RX_DCB_RSS' value='3'/>
      <enumerator name='ETH_MQ_RX_VMDQ_ONLY' value='4'/>
      <enumerator name='ETH_MQ_RX_VMDQ_RSS' value='5'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB' value='6'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB_RSS' value='7'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='128' id='type-id-373'>
      <subrange length='2' type-id='type-id-48' id='type-id-116'/>

    </array-type-def>
    <class-decl name='rte_eth_txmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='792' column='1' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-374' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pvid' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='hw_vlan_reject_tagged' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='hw_vlan_reject_untagged' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='hw_vlan_insert_pvid' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-72' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-373' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='812' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='377' column='1' id='type-id-374'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='ETH_MQ_TX_NONE' value='0'/>
      <enumerator name='ETH_MQ_TX_DCB' value='1'/>
      <enumerator name='ETH_MQ_TX_VMDQ_DCB' value='2'/>
      <enumerator name='ETH_MQ_TX_VMDQ_ONLY' value='3'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1060' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_conf' type-id='type-id-375' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vmdq_dcb_conf' type-id='type-id-376' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='dcb_rx_conf' type-id='type-id-377' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='vmdq_rx_conf' type-id='type-id-378' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1066' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rss_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='448' column='1' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_key' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rss_key_len' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rss_hf' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='451' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vmdq_dcb_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='745' column='1' id='type-id-376'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-379' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_pool_maps' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_map' type-id='type-id-380' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='dcb_tc' type-id='type-id-381' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='754' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_pools' filepath='../lib/librte_ethdev/rte_ethdev.h' line='704' column='1' id='type-id-379'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='ETH_8_POOLS' value='8'/>
      <enumerator name='ETH_16_POOLS' value='16'/>
      <enumerator name='ETH_32_POOLS' value='32'/>
      <enumerator name='ETH_64_POOLS' value='64'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='750' column='1' id='type-id-382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pools' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='752' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-382' size-in-bits='8192' id='type-id-380'>
      <subrange length='64' type-id='type-id-48' id='type-id-214'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='64' id='type-id-381'>
      <subrange length='8' type-id='type-id-48' id='type-id-383'/>

    </array-type-def>
    <class-decl name='rte_eth_dcb_rx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='712' column='1' id='type-id-377'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-384' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-381' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_tcs' filepath='../lib/librte_ethdev/rte_ethdev.h' line='695' column='1' id='type-id-384'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='ETH_4_TCS' value='4'/>
      <enumerator name='ETH_8_TCS' value='8'/>
    </enum-decl>
    <class-decl name='rte_eth_vmdq_rx_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='776' column='1' id='type-id-378'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-379' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='enable_loop_back' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='nb_pool_maps' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rx_mode' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool_map' type-id='type-id-380' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='786' column='1'/>
      </data-member>
    </class-decl>

    <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1069' column='1' id='type-id-369'>
      <data-member access='private'>
        <var-decl name='vmdq_dcb_tx_conf' type-id='type-id-385' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1070' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dcb_tx_conf' type-id='type-id-386' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1072' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vmdq_tx_conf' type-id='type-id-387' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1074' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_eth_vmdq_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='718' column='1' id='type-id-385'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-379' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-381' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='721' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='724' column='1' id='type-id-386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-384' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-381' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vmdq_tx_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='730' column='1' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-379' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_fdir_conf' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1005' column='1' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-388' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pballoc' type-id='type-id-389' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='status' type-id='type-id-390' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drop_queue' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mask' type-id='type-id-391' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flex_conf' type-id='type-id-392' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1012' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fdir_mode' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='603' column='1' id='type-id-388'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_FDIR_MODE_NONE' value='0'/>
      <enumerator name='RTE_FDIR_MODE_SIGNATURE' value='1'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT' value='2'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_MAC_VLAN' value='3'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_TUNNEL' value='4'/>
    </enum-decl>
    <enum-decl name='rte_fdir_pballoc_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='984' column='1' id='type-id-389'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_FDIR_PBALLOC_64K' value='0'/>
      <enumerator name='RTE_FDIR_PBALLOC_128K' value='1'/>
      <enumerator name='RTE_FDIR_PBALLOC_256K' value='2'/>
    </enum-decl>
    <enum-decl name='rte_fdir_status_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='993' column='1' id='type-id-390'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_FDIR_NO_REPORT_STATUS' value='0'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS' value='1'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS_ALWAYS' value='2'/>
    </enum-decl>
    <class-decl name='rte_eth_fdir_masks' size-in-bits='544' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='533' column='1' id='type-id-391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_tci_mask' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv4_mask' type-id='type-id-393' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ipv6_mask' type-id='type-id-394' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='src_port_mask' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='dst_port_mask' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mac_addr_byte_mask' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='tunnel_id_mask' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tunnel_type_mask' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv4_flow' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='342' column='1' id='type-id-393'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dst_ip' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tos' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='ttl' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='proto' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv6_flow' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='381' column='1' id='type-id-394'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-395' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_ip' type-id='type-id-395' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tc' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='proto' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='hop_limits' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='386' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-395'>
      <subrange length='4' type-id='type-id-48' id='type-id-396'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_conf' size-in-bits='5792' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='591' column='1' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_payloads' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_flexmasks' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flex_set' type-id='type-id-397' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='flex_mask' type-id='type-id-398' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='596' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_flex_payload_cfg' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='568' column='1' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-400' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='src_offset' type-id='type-id-401' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_payload_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='555' column='1' id='type-id-400'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_ETH_PAYLOAD_UNKNOWN' value='0'/>
      <enumerator name='RTE_ETH_RAW_PAYLOAD' value='1'/>
      <enumerator name='RTE_ETH_L2_PAYLOAD' value='2'/>
      <enumerator name='RTE_ETH_L3_PAYLOAD' value='3'/>
      <enumerator name='RTE_ETH_L4_PAYLOAD' value='4'/>
      <enumerator name='RTE_ETH_PAYLOAD_MAX' value='8'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-401'>
      <subrange length='16' type-id='type-id-48' id='type-id-402'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-399' size-in-bits='2304' id='type-id-397'>
      <subrange length='8' type-id='type-id-48' id='type-id-383'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_mask' size-in-bits='144' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='581' column='1' id='type-id-403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flow_type' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mask' type-id='type-id-404' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='583' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='128' id='type-id-404'>
      <subrange length='16' type-id='type-id-48' id='type-id-402'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-403' size-in-bits='3456' id='type-id-398'>
      <subrange length='24' type-id='type-id-48' id='type-id-405'/>

    </array-type-def>
    <class-decl name='rte_intr_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1031' column='1' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lsc' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='rxq' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='rmv' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1037' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_ether_addr' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='60' column='1' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr_bytes' type-id='type-id-23' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-361'/>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='8192' id='type-id-362'>
      <subrange length='128' type-id='type-id-48' id='type-id-407'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='8192' id='type-id-363'>
      <subrange length='1024' type-id='type-id-48' id='type-id-408'/>

    </array-type-def>
    <class-decl name='rte_vlan_filter_conf' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='427' column='1' id='type-id-364'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ids' type-id='type-id-409' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='428' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='4096' id='type-id-409'>
      <subrange length='64' type-id='type-id-48' id='type-id-214'/>

    </array-type-def>
    <class-decl name='rte_eth_dev_owner' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1490' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-211' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1492' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='256' id='type-id-352'>
      <subrange length='4' type-id='type-id-48' id='type-id-396'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='256' id='type-id-353'>
      <subrange length='4' type-id='type-id-48' id='type-id-396'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-346'/>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-410'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-348'/>
    <class-decl name='rte_eth_dev_cb_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-411' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-412' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_callback' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-413'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-411'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <class-decl name='rte_eth_rxtx_callback' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='758' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-415' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn' type-id='type-id-416' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='param' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='760' column='1' id='type-id-416'>
      <data-member access='private'>
        <var-decl name='rx' type-id='type-id-417' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='761' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tx' type-id='type-id-418' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='762' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <typedef-decl name='rte_rx_callback_fn' type-id='type-id-420' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1437' column='1' id='type-id-417'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <typedef-decl name='rte_tx_callback_fn' type-id='type-id-422' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1461' column='1' id='type-id-418'/>

    <array-type-def dimensions='1' type-id='type-id-415' size-in-bits='65536' id='type-id-350'>
      <subrange length='1024' type-id='type-id-48' id='type-id-408'/>

    </array-type-def>
    <enum-decl name='rte_eth_dev_state' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1467' column='1' id='type-id-351'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_ETH_DEV_UNUSED' value='0'/>
      <enumerator name='RTE_ETH_DEV_ATTACHED' value='1'/>
      <enumerator name='RTE_ETH_DEV_REMOVED' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-423'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-425'/>
    <typedef-decl name='eth_dev_configure_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='31' column='1' id='type-id-252'/>
    <typedef-decl name='eth_dev_start_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='34' column='1' id='type-id-253'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <typedef-decl name='eth_dev_stop_t' type-id='type-id-427' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='37' column='1' id='type-id-254'/>
    <typedef-decl name='eth_dev_set_link_up_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='40' column='1' id='type-id-255'/>
    <typedef-decl name='eth_dev_set_link_down_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='43' column='1' id='type-id-256'/>
    <typedef-decl name='eth_dev_close_t' type-id='type-id-427' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='46' column='1' id='type-id-257'/>
    <typedef-decl name='eth_dev_reset_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='49' column='1' id='type-id-258'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-429'/>
    <typedef-decl name='eth_link_update_t' type-id='type-id-429' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='155' column='1' id='type-id-259'/>
    <typedef-decl name='eth_is_removed_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='52' column='1' id='type-id-260'/>
    <typedef-decl name='eth_promiscuous_enable_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='78' column='1' id='type-id-261'/>
    <typedef-decl name='eth_promiscuous_disable_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='103' column='1' id='type-id-262'/>
    <typedef-decl name='eth_allmulticast_enable_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='128' column='1' id='type-id-263'/>
    <typedef-decl name='eth_allmulticast_disable_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='153' column='1' id='type-id-264'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-431'/>
    <typedef-decl name='eth_mac_addr_remove_t' type-id='type-id-431' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='391' column='1' id='type-id-265'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <typedef-decl name='eth_mac_addr_add_t' type-id='type-id-433' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='394' column='1' id='type-id-266'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <typedef-decl name='eth_mac_addr_set_t' type-id='type-id-435' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='400' column='1' id='type-id-267'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <typedef-decl name='eth_set_mc_addr_list_t' type-id='type-id-437' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='436' column='1' id='type-id-268'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <typedef-decl name='mtu_set_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='315' column='1' id='type-id-269'/>
    <class-decl name='rte_eth_stats' size-in-bits='5632' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='243' column='1' id='type-id-440'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipackets' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opackets' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ibytes' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='obytes' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='imissed' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ierrors' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='oerrors' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rx_nombuf' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='q_ipackets' type-id='type-id-441' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='q_opackets' type-id='type-id-441' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='q_ibytes' type-id='type-id-441' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='q_obytes' type-id='type-id-441' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='q_errors' type-id='type-id-441' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='263' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='1024' id='type-id-441'>
      <subrange length='16' type-id='type-id-48' id='type-id-402'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-442'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <typedef-decl name='eth_stats_get_t' type-id='type-id-444' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='159' column='1' id='type-id-270'/>
    <typedef-decl name='eth_stats_reset_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='182' column='1' id='type-id-271'/>
    <class-decl name='rte_eth_xstat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1337' column='1' id='type-id-445'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1339' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-446'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-448'/>
    <typedef-decl name='eth_xstats_get_t' type-id='type-id-448' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='184' column='1' id='type-id-272'/>
    <typedef-decl name='eth_xstats_reset_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='213' column='1' id='type-id-273'/>
    <class-decl name='rte_eth_xstat_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1349' column='1' id='type-id-449'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-211' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1350' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-452'/>
    <typedef-decl name='eth_xstats_get_names_t' type-id='type-id-452' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='215' column='1' id='type-id-274'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <typedef-decl name='eth_queue_stats_mapping_set_t' type-id='type-id-454' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='224' column='1' id='type-id-275'/>
    <class-decl name='rte_eth_dev_info' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1226' column='1' id='type-id-455'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='type-id-152' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driver_name' type-id='type-id-148' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='if_index' type-id='type-id-39' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='min_mtu' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='max_mtu' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_flags' type-id='type-id-456' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_rx_bufsize' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_rx_pktlen' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='max_rx_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='max_tx_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_mac_addrs' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='max_hash_mac_addrs' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='max_vfs' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='max_vmdq_pools' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_offload_capa' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_offload_capa' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rx_queue_offload_capa' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tx_queue_offload_capa' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reta_size' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='hash_key_size' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='flow_type_rss_offloads' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_rxconf' type-id='type-id-457' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='default_txconf' type-id='type-id-458' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='vmdq_queue_base' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1744'>
        <var-decl name='vmdq_queue_num' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='vmdq_pool_base' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1776'>
        <var-decl name='rx_desc_lim' type-id='type-id-459' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tx_desc_lim' type-id='type-id-459' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='speed_capa' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_rx_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2000'>
        <var-decl name='nb_tx_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='default_rxportconf' type-id='type-id-460' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='default_txportconf' type-id='type-id-460' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='dev_capa' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='switch_info' type-id='type-id-461' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='reserved_64s' type-id='type-id-72' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='reserved_ptrs' type-id='type-id-373' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1282' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-462'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-456'/>
    <class-decl name='rte_eth_rxconf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='818' column='1' id='type-id-457'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_thresh' type-id='type-id-463' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rx_free_thresh' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rx_drop_en' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='rx_deferred_start' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved_64s' type-id='type-id-72' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='reserved_ptrs' type-id='type-id-373' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='831' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_thresh' size-in-bits='24' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='327' column='1' id='type-id-463'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pthresh' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='hthresh' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='wthresh' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_txconf' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='837' column='1' id='type-id-458'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tx_thresh' type-id='type-id-463' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tx_rs_thresh' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='tx_free_thresh' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_deferred_start' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-72' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-373' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='852' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_desc_lim' size-in-bits='80' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='898' column='1' id='type-id-459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_max' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_min' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_align' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_seg_max' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_mtu_seg_max' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='924' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_portconf' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1189' column='1' id='type-id-460'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='burst_size' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ring_size' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1192' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_switch_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1204' column='1' id='type-id-461'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-148' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='domain_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='port_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1207' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-464'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <typedef-decl name='eth_dev_infos_get_t' type-id='type-id-466' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='230' column='1' id='type-id-276'/>
    <class-decl name='rte_eth_rxq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1289' column='1' id='type-id-467'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='type-id-69' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conf' type-id='type-id-457' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scattered_rx' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='nb_desc' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1293' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-470'/>
    <typedef-decl name='eth_rxq_info_get_t' type-id='type-id-470' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='306' column='1' id='type-id-277'/>
    <class-decl name='rte_eth_txq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1300' column='1' id='type-id-471'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='conf' type-id='type-id-458' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_desc' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1302' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-472'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <typedef-decl name='eth_txq_info_get_t' type-id='type-id-474' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='309' column='1' id='type-id-278'/>
    <class-decl name='rte_eth_burst_mode' size-in-bits='8256' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1318' column='1' id='type-id-475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='info' type-id='type-id-476' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1322' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='8192' id='type-id-476'>
      <subrange length='1024' type-id='type-id-48' id='type-id-408'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <typedef-decl name='eth_burst_mode_get_t' type-id='type-id-479' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='312' column='1' id='type-id-279'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <typedef-decl name='eth_fw_version_get_t' type-id='type-id-481' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='299' column='1' id='type-id-280'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <typedef-decl name='eth_dev_supported_ptypes_get_t' type-id='type-id-483' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='234' column='1' id='type-id-281'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' id='type-id-485'/>
    <typedef-decl name='eth_dev_ptypes_set_t' type-id='type-id-485' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='249' column='1' id='type-id-282'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-487'/>
    <typedef-decl name='vlan_filter_set_t' type-id='type-id-487' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='318' column='1' id='type-id-283'/>
    <enum-decl name='rte_vlan_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='416' column='1' id='type-id-488'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='ETH_VLAN_TYPE_UNKNOWN' value='0'/>
      <enumerator name='ETH_VLAN_TYPE_INNER' value='1'/>
      <enumerator name='ETH_VLAN_TYPE_OUTER' value='2'/>
      <enumerator name='ETH_VLAN_TYPE_MAX' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <typedef-decl name='vlan_tpid_set_t' type-id='type-id-490' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='323' column='1' id='type-id-284'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <typedef-decl name='vlan_strip_queue_set_t' type-id='type-id-492' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='335' column='1' id='type-id-285'/>
    <typedef-decl name='vlan_offload_set_t' type-id='type-id-429' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='327' column='1' id='type-id-286'/>
    <typedef-decl name='vlan_pvid_set_t' type-id='type-id-487' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='330' column='1' id='type-id-287'/>
    <typedef-decl name='eth_queue_start_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='252' column='1' id='type-id-288'/>
    <typedef-decl name='eth_queue_stop_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='256' column='1' id='type-id-289'/>
    <qualified-type-def type-id='type-id-457' const='yes' id='type-id-493'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-494'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-496'/>
    <typedef-decl name='eth_rx_queue_setup_t' type-id='type-id-496' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='260' column='1' id='type-id-290'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-498'/>
    <typedef-decl name='eth_queue_release_t' type-id='type-id-498' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='283' column='1' id='type-id-291'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <typedef-decl name='eth_rx_queue_count_t' type-id='type-id-500' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='286' column='1' id='type-id-292'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <typedef-decl name='eth_rx_descriptor_done_t' type-id='type-id-502' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='290' column='1' id='type-id-293'/>
    <typedef-decl name='eth_rx_descriptor_status_t' type-id='type-id-502' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='293' column='1' id='type-id-294'/>
    <typedef-decl name='eth_tx_descriptor_status_t' type-id='type-id-502' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='296' column='1' id='type-id-295'/>
    <typedef-decl name='eth_rx_enable_intr_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='275' column='1' id='type-id-296'/>
    <typedef-decl name='eth_rx_disable_intr_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='279' column='1' id='type-id-297'/>
    <qualified-type-def type-id='type-id-458' const='yes' id='type-id-503'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <typedef-decl name='eth_tx_queue_setup_t' type-id='type-id-506' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='268' column='1' id='type-id-298'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <typedef-decl name='eth_tx_done_cleanup_t' type-id='type-id-508' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='303' column='1' id='type-id-299'/>
    <typedef-decl name='eth_dev_led_on_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='385' column='1' id='type-id-300'/>
    <typedef-decl name='eth_dev_led_off_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='388' column='1' id='type-id-301'/>
    <class-decl name='rte_eth_fc_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='942' column='1' id='type-id-509'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='high_water' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='low_water' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pause_time' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='send_xon' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mode' type-id='type-id-510' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_ctrl_frame_fwd' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='autoneg' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='949' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_fc_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='930' column='1' id='type-id-510'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_FC_NONE' value='0'/>
      <enumerator name='RTE_FC_RX_PAUSE' value='1'/>
      <enumerator name='RTE_FC_TX_PAUSE' value='2'/>
      <enumerator name='RTE_FC_FULL' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-511'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' id='type-id-513'/>
    <typedef-decl name='flow_ctrl_get_t' type-id='type-id-513' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='355' column='1' id='type-id-302'/>
    <typedef-decl name='flow_ctrl_set_t' type-id='type-id-513' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='359' column='1' id='type-id-303'/>
    <class-decl name='rte_eth_pfc_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='957' column='1' id='type-id-514'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='type-id-509' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='priority' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-517'/>
    <typedef-decl name='priority_flow_ctrl_set_t' type-id='type-id-517' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='363' column='1' id='type-id-304'/>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <typedef-decl name='eth_uc_hash_table_set_t' type-id='type-id-519' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='404' column='1' id='type-id-305'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <typedef-decl name='eth_uc_all_hash_table_set_t' type-id='type-id-521' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='409' column='1' id='type-id-306'/>
    <class-decl name='rte_eth_mirror_conf' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='670' column='1' id='type-id-522'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rule_type' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dst_pool' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_mask' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vlan' type-id='type-id-523' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='675' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vlan_mirror' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='661' column='1' id='type-id-523'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_mask' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vlan_id' type-id='type-id-524' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='664' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='1024' id='type-id-524'>
      <subrange length='64' type-id='type-id-48' id='type-id-214'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <typedef-decl name='eth_mirror_rule_set_t' type-id='type-id-527' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='418' column='1' id='type-id-307'/>
    <typedef-decl name='eth_mirror_rule_reset_t' type-id='type-id-521' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='424' column='1' id='type-id-308'/>
    <class-decl name='rte_eth_udp_tunnel' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1023' column='1' id='type-id-528'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='udp_port' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='prot_type' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1025' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <typedef-decl name='eth_udp_tunnel_port_add_t' type-id='type-id-531' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='428' column='1' id='type-id-309'/>
    <typedef-decl name='eth_udp_tunnel_port_del_t' type-id='type-id-531' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='432' column='1' id='type-id-310'/>
    <class-decl name='rte_eth_l2_tunnel_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='751' column='1' id='type-id-532'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l2_tunnel_type' type-id='type-id-533' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ether_type' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tunnel_id' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vf_id' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tunnel_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='965' column='1' id='type-id-533'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_TUNNEL_TYPE_NONE' value='0'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN' value='1'/>
      <enumerator name='RTE_TUNNEL_TYPE_GENEVE' value='2'/>
      <enumerator name='RTE_TUNNEL_TYPE_TEREDO' value='3'/>
      <enumerator name='RTE_TUNNEL_TYPE_NVGRE' value='4'/>
      <enumerator name='RTE_TUNNEL_TYPE_IP_IN_GRE' value='5'/>
      <enumerator name='RTE_L2_TUNNEL_TYPE_E_TAG' value='6'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN_GPE' value='7'/>
      <enumerator name='RTE_TUNNEL_TYPE_MAX' value='8'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-534'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <typedef-decl name='eth_l2_tunnel_eth_type_conf_t' type-id='type-id-536' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='494' column='1' id='type-id-311'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' id='type-id-538'/>
    <typedef-decl name='eth_l2_tunnel_offload_set_t' type-id='type-id-538' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='498' column='1' id='type-id-312'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <typedef-decl name='eth_set_queue_rate_limit_t' type-id='type-id-540' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='413' column='1' id='type-id-313'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-541'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-543'/>
    <typedef-decl name='rss_hash_update_t' type-id='type-id-543' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='377' column='1' id='type-id-314'/>
    <typedef-decl name='rss_hash_conf_get_t' type-id='type-id-543' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='381' column='1' id='type-id-315'/>
    <class-decl name='rte_eth_rss_reta_entry64' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='684' column='1' id='type-id-544'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mask' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reta' type-id='type-id-524' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='687' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <typedef-decl name='reta_update_t' type-id='type-id-547' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='367' column='1' id='type-id-316'/>
    <typedef-decl name='reta_query_t' type-id='type-id-547' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='372' column='1' id='type-id-317'/>
    <class-decl name='rte_dev_reg_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='13' column='1' id='type-id-548'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='width' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='version' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-549'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-551'/>
    <typedef-decl name='eth_get_reg_t' type-id='type-id-551' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='471' column='1' id='type-id-318'/>
    <typedef-decl name='eth_get_eeprom_length_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='475' column='1' id='type-id-319'/>
    <class-decl name='rte_dev_eeprom_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='24' column='1' id='type-id-552'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-28' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='magic' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-553'/>
    <pointer-type-def type-id='type-id-554' size-in-bits='64' id='type-id-555'/>
    <typedef-decl name='eth_get_eeprom_t' type-id='type-id-555' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='478' column='1' id='type-id-320'/>
    <typedef-decl name='eth_set_eeprom_t' type-id='type-id-555' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='482' column='1' id='type-id-321'/>
    <class-decl name='rte_eth_dev_module_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='34' column='1' id='type-id-556'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eeprom_len' type-id='type-id-19' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-559'/>
    <typedef-decl name='eth_get_module_info_t' type-id='type-id-559' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='486' column='1' id='type-id-322'/>
    <typedef-decl name='eth_get_module_eeprom_t' type-id='type-id-555' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='490' column='1' id='type-id-323'/>
    <enum-decl name='rte_filter_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='28' column='1' id='type-id-560'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_ETH_FILTER_NONE' value='0'/>
      <enumerator name='RTE_ETH_FILTER_MACVLAN' value='1'/>
      <enumerator name='RTE_ETH_FILTER_ETHERTYPE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_FLEXIBLE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_SYN' value='4'/>
      <enumerator name='RTE_ETH_FILTER_NTUPLE' value='5'/>
      <enumerator name='RTE_ETH_FILTER_TUNNEL' value='6'/>
      <enumerator name='RTE_ETH_FILTER_FDIR' value='7'/>
      <enumerator name='RTE_ETH_FILTER_HASH' value='8'/>
      <enumerator name='RTE_ETH_FILTER_L2_TUNNEL' value='9'/>
      <enumerator name='RTE_ETH_FILTER_GENERIC' value='10'/>
      <enumerator name='RTE_ETH_FILTER_MAX' value='11'/>
    </enum-decl>
    <enum-decl name='rte_filter_op' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='46' column='1' id='type-id-561'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='RTE_ETH_FILTER_NOP' value='0'/>
      <enumerator name='RTE_ETH_FILTER_ADD' value='1'/>
      <enumerator name='RTE_ETH_FILTER_UPDATE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_DELETE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_FLUSH' value='4'/>
      <enumerator name='RTE_ETH_FILTER_GET' value='5'/>
      <enumerator name='RTE_ETH_FILTER_SET' value='6'/>
      <enumerator name='RTE_ETH_FILTER_INFO' value='7'/>
      <enumerator name='RTE_ETH_FILTER_STATS' value='8'/>
      <enumerator name='RTE_ETH_FILTER_OP_MAX' value='9'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <typedef-decl name='eth_filter_ctrl_t' type-id='type-id-563' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='506' column='1' id='type-id-324'/>
    <class-decl name='rte_eth_dcb_info' size-in-bits='16520' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1377' column='1' id='type-id-564'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='prio_tc' type-id='type-id-381' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='tc_bws' type-id='type-id-381' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='tc_queue' type-id='type-id-565' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1382' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tc_queue_mapping' size-in-bits='16384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1360' column='1' id='type-id-565'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tc_rxq' type-id='type-id-566' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='tc_txq' type-id='type-id-566' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1362' column='1' id='type-id-567'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_queue' type-id='type-id-22' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1364' column='1'/>
      </data-member>
    </class-decl>


    <array-type-def dimensions='2' type-id='type-id-567' size-in-bits='1152' id='type-id-566'>
      <subrange length='64' type-id='type-id-48' id='type-id-214'/>

      <subrange length='8' type-id='type-id-48' id='type-id-383'/>

    </array-type-def>


    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-568'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <typedef-decl name='eth_get_dcb_info' type-id='type-id-570' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='518' column='1' id='type-id-325'/>
    <typedef-decl name='eth_timesync_enable_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='441' column='1' id='type-id-326'/>
    <typedef-decl name='eth_timesync_disable_t' type-id='type-id-425' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='444' column='1' id='type-id-327'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-571'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-572' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-573' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-574'/>
    <typedef-decl name='__time_t' type-id='type-id-574' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-572'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-574' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-573'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-575'/>
    <pointer-type-def type-id='type-id-576' size-in-bits='64' id='type-id-577'/>
    <typedef-decl name='eth_timesync_read_rx_timestamp_t' type-id='type-id-577' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='447' column='1' id='type-id-328'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <typedef-decl name='eth_timesync_read_tx_timestamp_t' type-id='type-id-579' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='452' column='1' id='type-id-329'/>
    <typedef-decl name='__int64_t' type-id='type-id-574' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-580'/>
    <typedef-decl name='int64_t' type-id='type-id-580' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-581'/>
    <pointer-type-def type-id='type-id-582' size-in-bits='64' id='type-id-583'/>
    <typedef-decl name='eth_timesync_adjust_time' type-id='type-id-583' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='456' column='1' id='type-id-330'/>
    <typedef-decl name='eth_timesync_read_time' type-id='type-id-579' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='459' column='1' id='type-id-331'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-584'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <typedef-decl name='eth_timesync_write_time' type-id='type-id-587' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='463' column='1' id='type-id-332'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-588'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <typedef-decl name='eth_read_clock' type-id='type-id-590' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='467' column='1' id='type-id-333'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-591'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' id='type-id-594'/>
    <typedef-decl name='eth_xstats_get_by_id_t' type-id='type-id-594' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='188' column='1' id='type-id-334'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-596'/>
    <typedef-decl name='eth_xstats_get_names_by_id_t' type-id='type-id-596' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='219' column='1' id='type-id-335'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <typedef-decl name='eth_tm_ops_get_t' type-id='type-id-598' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='512' column='1' id='type-id-336'/>
    <typedef-decl name='eth_mtr_ops_get_t' type-id='type-id-598' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='515' column='1' id='type-id-337'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' id='type-id-600'/>
    <typedef-decl name='eth_pool_ops_supported_t' type-id='type-id-600' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='522' column='1' id='type-id-338'/>
    <class-decl name='rte_eth_hairpin_cap' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='861' column='1' id='type-id-601'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_nb_queues' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_rx_2_tx' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_tx_2_rx' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='max_nb_desc' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='868' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-604'/>
    <typedef-decl name='eth_hairpin_cap_get_t' type-id='type-id-604' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='543' column='1' id='type-id-339'/>
    <class-decl name='rte_eth_hairpin_conf' size-in-bits='1040' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='890' column='1' id='type-id-605'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='peer_count' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='peers' type-id='type-id-606' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='892' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_hairpin_peer' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='879' column='1' id='type-id-607'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='queue' type-id='type-id-21' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='881' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-607' size-in-bits='1024' id='type-id-606'>
      <subrange length='32' type-id='type-id-48' id='type-id-83'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-605' const='yes' id='type-id-608'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-609'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <typedef-decl name='eth_rx_hairpin_queue_setup_t' type-id='type-id-611' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='571' column='1' id='type-id-340'/>
    <typedef-decl name='eth_tx_hairpin_queue_setup_t' type-id='type-id-611' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='601' column='1' id='type-id-341'/>
    <var-decl name='virtio_user_secondary_eth_dev_ops' type-id='type-id-410' visibility='default' filepath='../drivers/net/virtio/virtio_ethdev.h' line='50' column='1'/>
    <function-type size-in-bits='64' id='type-id-482'>
      <parameter type-id='type-id-423'/>
      <return type-id='type-id-456'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-195'>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-181'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-424'>
      <parameter type-id='type-id-423'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-480'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-215'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-599'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-586'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-585'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-593'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-592'/>
      <parameter type-id='type-id-588'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-562'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-560'/>
      <parameter type-id='type-id-561'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-489'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-488'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-428'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-554'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-553'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-550'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-549'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-569'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-568'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-465'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-464'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-558'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-557'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-512'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-511'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-603'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-602'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-535'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-534'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-537'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-534'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-526'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-525'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-516'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-515'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-542'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-541'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-546'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-545'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-443'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-530'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-529'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-447'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-446'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-595'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-450'/>
      <parameter type-id='type-id-592'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-451'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-450'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-434'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-361'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-436'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-432'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-518'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-578'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-575'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-576'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-575'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-582'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-581'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-438'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-486'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-478'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-477'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-539'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-610'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-609'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-495'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-494'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-505'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-504'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-453'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-484'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-520'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-589'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-588'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-597'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-245'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-501'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-507'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-152'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-419'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-421'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-354'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-499'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-126'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-426'>
      <parameter type-id='type-id-423'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-491'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-469'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-468'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-473'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-472'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-430'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-104'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-497'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-202'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-28'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/virtio/virtio_pci.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='legacy_ops' type-id='type-id-134' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='352' column='1'/>
    <var-decl name='modern_ops' type-id='type-id-134' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='353' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/virtio/virtio_user_ethdev.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='virtio_user_ops' type-id='type-id-134' visibility='default' filepath='../drivers/net/virtio/virtio_pci.h' line='354' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/virtio/virtio_user/vhost_kernel.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='virtio_user_backend_ops' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='81' column='1' id='type-id-612'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='setup' type-id='type-id-613' visibility='default' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send_request' type-id='type-id-614' visibility='default' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='enable_qp' type-id='type-id-615' visibility='default' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_user_dev' size-in-bits='40064' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='19' column='1' id='type-id-616'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vhostfd' type-id='type-id-1' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='listenfd' type-id='type-id-1' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='is_server' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ifname' type-id='type-id-215' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vhostfds' type-id='type-id-221' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tapfds' type-id='type-id-221' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='callfds' type-id='type-id-617' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='kickfds' type-id='type-id-617' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='mac_specified' type-id='type-id-1' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='max_queue_pairs' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='queue_pairs' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='queue_size' type-id='type-id-19' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='features' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='device_features' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='frontend_features' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='unsupported_features' type-id='type-id-18' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='status' type-id='type-id-22' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1808'>
        <var-decl name='port_id' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='mac_addr' type-id='type-id-23' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1872'>
        <var-decl name='path' type-id='type-id-618' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34688'>
        <var-decl name='' type-id='type-id-619' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39040'>
        <var-decl name='packed_queues' type-id='type-id-620' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39616'>
        <var-decl name='ops' type-id='type-id-621' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39680'>
        <var-decl name='mutex' type-id='type-id-622' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40000'>
        <var-decl name='started' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='55' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='544' id='type-id-617'>
      <subrange length='17' type-id='type-id-48' id='type-id-623'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='32768' id='type-id-618'>
      <subrange length='4096' type-id='type-id-48' id='type-id-624'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='4352' is-anonymous='yes' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='47' column='1' id='type-id-619'>
      <data-member access='private'>
        <var-decl name='vrings' type-id='type-id-625' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='48' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='packed_vrings' type-id='type-id-626' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='49' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='4352' id='type-id-625'>
      <subrange length='17' type-id='type-id-48' id='type-id-623'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='4352' id='type-id-626'>
      <subrange length='17' type-id='type-id-48' id='type-id-623'/>

    </array-type-def>
    <class-decl name='virtio_user_queue' size-in-bits='32' is-struct='yes' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='13' column='1' id='type-id-627'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='used_idx' type-id='type-id-21' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='avail_wrap_counter' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='used_wrap_counter' type-id='type-id-20' visibility='default' filepath='../drivers/net/virtio/virtio_user/virtio_user_dev.h' line='16' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-627' size-in-bits='544' id='type-id-620'>
      <subrange length='17' type-id='type-id-48' id='type-id-623'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-621'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-628'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-629' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-630' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-574' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='118' column='1' id='type-id-629'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-631' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='82' column='1' id='type-id-632'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-633' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-633' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-632' filepath='/usr/include/bits/thread-shared-types.h' line='86' column='1' id='type-id-631'/>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='320' id='type-id-630'>
      <subrange length='40' type-id='type-id-48' id='type-id-634'/>

    </array-type-def>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-628' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-622'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' id='type-id-635'/>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' id='type-id-613'/>
    <enum-decl name='vhost_user_request' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='47' column='1' id='type-id-637'>
      <underlying-type type-id='type-id-193'/>
      <enumerator name='VHOST_USER_NONE' value='0'/>
      <enumerator name='VHOST_USER_GET_FEATURES' value='1'/>
      <enumerator name='VHOST_USER_SET_FEATURES' value='2'/>
      <enumerator name='VHOST_USER_SET_OWNER' value='3'/>
      <enumerator name='VHOST_USER_RESET_OWNER' value='4'/>
      <enumerator name='VHOST_USER_SET_MEM_TABLE' value='5'/>
      <enumerator name='VHOST_USER_SET_LOG_BASE' value='6'/>
      <enumerator name='VHOST_USER_SET_LOG_FD' value='7'/>
      <enumerator name='VHOST_USER_SET_VRING_NUM' value='8'/>
      <enumerator name='VHOST_USER_SET_VRING_ADDR' value='9'/>
      <enumerator name='VHOST_USER_SET_VRING_BASE' value='10'/>
      <enumerator name='VHOST_USER_GET_VRING_BASE' value='11'/>
      <enumerator name='VHOST_USER_SET_VRING_KICK' value='12'/>
      <enumerator name='VHOST_USER_SET_VRING_CALL' value='13'/>
      <enumerator name='VHOST_USER_SET_VRING_ERR' value='14'/>
      <enumerator name='VHOST_USER_GET_PROTOCOL_FEATURES' value='15'/>
      <enumerator name='VHOST_USER_SET_PROTOCOL_FEATURES' value='16'/>
      <enumerator name='VHOST_USER_GET_QUEUE_NUM' value='17'/>
      <enumerator name='VHOST_USER_SET_VRING_ENABLE' value='18'/>
      <enumerator name='VHOST_USER_MAX' value='19'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-614'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' id='type-id-615'/>
    <var-decl name='virtio_ops_kernel' type-id='type-id-612' visibility='default' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='92' column='1'/>
    <function-type size-in-bits='64' id='type-id-636'>
      <parameter type-id='type-id-635'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-638'>
      <parameter type-id='type-id-635'/>
      <parameter type-id='type-id-637'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-639'>
      <parameter type-id='type-id-635'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/virtio/virtio_user/vhost_user.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-640'/>

    <array-type-def dimensions='1' type-id='type-id-640' size-in-bits='1216' id='type-id-641'>
      <subrange length='19' type-id='type-id-48' id='type-id-642'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-641' const='yes' id='type-id-643'/>
    <var-decl name='vhost_msg_strings' type-id='type-id-643' visibility='default' filepath='../drivers/net/virtio/virtio_user/vhost.h' line='70' column='1'/>
