<abi-corpus path='gcc//drivers/librte_pmd_fm10k.so.20.0' architecture='elf-amd-x86_64' soname='librte_pmd_fm10k.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_vdev.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/fm10k/base/fm10k_pf.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='fm10k_msg_data' size-in-bits='192' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='83' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attr' type-id='type-id-3' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-4' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-2'/>
    <class-decl name='fm10k_tlv_attr' size-in-bits='96' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='62' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-6' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-8'/>
    <enum-decl name='fm10k_tlv_type' filepath='../drivers/net/fm10k/base/fm10k_tlv.h' line='49' column='1' id='type-id-6'>
      <underlying-type type-id='type-id-8'/>
      <enumerator name='FM10K_TLV_NULL_STRING' value='0'/>
      <enumerator name='FM10K_TLV_MAC_ADDR' value='1'/>
      <enumerator name='FM10K_TLV_BOOL' value='2'/>
      <enumerator name='FM10K_TLV_UNSIGNED' value='3'/>
      <enumerator name='FM10K_TLV_SIGNED' value='4'/>
      <enumerator name='FM10K_TLV_LE_STRUCT' value='5'/>
      <enumerator name='FM10K_TLV_NESTED' value='6'/>
      <enumerator name='FM10K_TLV_MAX_TYPE' value='7'/>
    </enum-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-9'/>
    <typedef-decl name='__uint16_t' type-id='type-id-9' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-10' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-11'/>
    <typedef-decl name='u16' type-id='type-id-11' filepath='../drivers/net/fm10k/base/fm10k_osdep.h' line='44' column='1' id='type-id-7'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-3'/>
    <type-decl name='int' size-in-bits='32' id='type-id-13'/>
    <typedef-decl name='__int32_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-14'/>
    <typedef-decl name='int32_t' type-id='type-id-14' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-15'/>
    <typedef-decl name='s32' type-id='type-id-15' filepath='../drivers/net/fm10k/base/fm10k_osdep.h' line='47' column='1' id='type-id-16'/>
    <class-decl name='fm10k_hw' size-in-bits='25664' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='704' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw_addr' type-id='type-id-18' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sw_addr' type-id='type-id-18' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='back' type-id='type-id-19' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mac' type-id='type-id-20' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='bus' type-id='type-id-21' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='bus_caps' type-id='type-id-21' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='iov' type-id='type-id-22' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='mbx' type-id='type-id-23' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25280'>
        <var-decl name='swapi' type-id='type-id-24' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25504'>
        <var-decl name='device_id' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25520'>
        <var-decl name='vendor_id' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='subsystem_device_id' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25552'>
        <var-decl name='subsystem_vendor_id' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25568'>
        <var-decl name='revision_id' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='flags' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='719' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-2' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-27'/>
    <typedef-decl name='uint32_t' type-id='type-id-27' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-28'/>
    <typedef-decl name='u32' type-id='type-id-28' filepath='../drivers/net/fm10k/base/fm10k_osdep.h' line='46' column='1' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-18'/>
    <type-decl name='void' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-19'/>
    <class-decl name='fm10k_mac_info' size-in-bits='1920' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='602' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-30' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='type' type-id='type-id-31' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='addr' type-id='type-id-32' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='perm_addr' type-id='type-id-32' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='default_vid' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1616'>
        <var-decl name='max_msix_vectors' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='max_queues' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='vlan_override' type-id='type-id-33' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='get_host_state' type-id='type-id-33' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tx_ready' type-id='type-id-33' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='dglort_map' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='itr_scale' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='reset_while_pending' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='615' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fm10k_mac_ops' size-in-bits='1472' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='564' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reset_hw' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_hw' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_hw' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stop_hw' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_bus_info' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_host_state' type-id='type-id-36' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='request_lport_map' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='is_slot_appropriate' type-id='type-id-37' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='update_vlan' type-id='type-id-38' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='read_mac_addr' type-id='type-id-35' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='update_uc_addr' type-id='type-id-39' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='update_mc_addr' type-id='type-id-40' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='update_xcast_mode' type-id='type-id-41' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='update_int_moderator' type-id='type-id-42' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='update_lport_state' type-id='type-id-43' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='update_hw_stats' type-id='type-id-44' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rebind_hw_stats' type-id='type-id-44' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='configure_dglort_map' type-id='type-id-45' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='set_dma_mask' type-id='type-id-46' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_fault' type-id='type-id-47' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='adjust_systime' type-id='type-id-48' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='notify_offset' type-id='type-id-49' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='read_systime' type-id='type-id-50' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='592' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-35'/>
    <typedef-decl name='bool' type-id='type-id-13' filepath='../drivers/net/fm10k/base/fm10k_osdep.h' line='50' column='1' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-37'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-56'/>
    <typedef-decl name='__uint8_t' type-id='type-id-56' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-57'/>
    <typedef-decl name='uint8_t' type-id='type-id-57' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-58'/>
    <typedef-decl name='u8' type-id='type-id-58' filepath='../drivers/net/fm10k/base/fm10k_osdep.h' line='42' column='1' id='type-id-25'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-43'/>
    <class-decl name='fm10k_hw_stats' size-in-bits='82944' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='486' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='timeout' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ur' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ca' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='um' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='xec' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='vlan_drop' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='loopback_drop' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nodesc_drop' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='q' type-id='type-id-69' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fm10k_hw_stat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='470' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base_l' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='base_h' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='473' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='__uint64_t' type-id='type-id-70' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-71'/>
    <typedef-decl name='uint64_t' type-id='type-id-71' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-72'/>
    <typedef-decl name='u64' type-id='type-id-72' filepath='../drivers/net/fm10k/base/fm10k_osdep.h' line='49' column='1' id='type-id-34'/>
    <class-decl name='fm10k_hw_stats_q' size-in-bits='640' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='476' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tx_bytes' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tx_packets' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_bytes' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rx_packets' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_drops' type-id='type-id-68' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='483' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-73' size-in-bits='81920' id='type-id-69'>
      <subrange length='128' type-id='type-id-70' id='type-id-74'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-44'/>
    <class-decl name='fm10k_dglort_cfg' size-in-bits='96' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='511' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='glort' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='queue_b' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vsi_b' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='idx' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rss_l' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pc_l' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vsi_l' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='queue_l' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='shared_l' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='inner_rss' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='521' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-46'/>
    <class-decl name='fm10k_fault' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='557' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='specinfo' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='func' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='561' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-50'/>
    <enum-decl name='fm10k_mac_type' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='595' column='1' id='type-id-31'>
      <underlying-type type-id='type-id-8'/>
      <enumerator name='fm10k_mac_unknown' value='0'/>
      <enumerator name='fm10k_mac_pf' value='1'/>
      <enumerator name='fm10k_mac_vf' value='2'/>
      <enumerator name='fm10k_num_macs' value='3'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='48' id='type-id-32'>
      <subrange length='6' type-id='type-id-70' id='type-id-87'/>

    </array-type-def>
    <class-decl name='fm10k_bus_info' size-in-bits='96' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='463' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='speed' type-id='type-id-88' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='width' type-id='type-id-89' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='payload' type-id='type-id-90' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='466' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='fm10k_bus_speed' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='435' column='1' id='type-id-88'>
      <underlying-type type-id='type-id-8'/>
      <enumerator name='fm10k_bus_speed_unknown' value='0'/>
      <enumerator name='fm10k_bus_speed_2500' value='2500'/>
      <enumerator name='fm10k_bus_speed_5000' value='5000'/>
      <enumerator name='fm10k_bus_speed_8000' value='8000'/>
      <enumerator name='fm10k_bus_speed_reserved' value='8001'/>
    </enum-decl>
    <enum-decl name='fm10k_bus_width' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='444' column='1' id='type-id-89'>
      <underlying-type type-id='type-id-8'/>
      <enumerator name='fm10k_bus_width_unknown' value='0'/>
      <enumerator name='fm10k_bus_width_pcie_x1' value='1'/>
      <enumerator name='fm10k_bus_width_pcie_x2' value='2'/>
      <enumerator name='fm10k_bus_width_pcie_x4' value='4'/>
      <enumerator name='fm10k_bus_width_pcie_x8' value='8'/>
      <enumerator name='fm10k_bus_width_reserved' value='9'/>
    </enum-decl>
    <enum-decl name='fm10k_bus_payload' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='454' column='1' id='type-id-90'>
      <underlying-type type-id='type-id-8'/>
      <enumerator name='fm10k_bus_payload_unknown' value='0'/>
      <enumerator name='fm10k_bus_payload_128' value='1'/>
      <enumerator name='fm10k_bus_payload_256' value='2'/>
      <enumerator name='fm10k_bus_payload_512' value='3'/>
      <enumerator name='fm10k_bus_payload_reserved' value='4'/>
    </enum-decl>
    <class-decl name='fm10k_iov_info' size-in-bits='640' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='697' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-91' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='total_vfs' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='num_vfs' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='num_pools' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='701' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fm10k_iov_ops' size-in-bits='576' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='682' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='assign_resources' type-id='type-id-92' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='configure_tc' type-id='type-id-93' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='assign_int_moderator' type-id='type-id-94' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='assign_default_mac_vlan' type-id='type-id-95' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='reset_resources' type-id='type-id-95' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_lport' type-id='type-id-96' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reset_lport' type-id='type-id-97' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='update_stats' type-id='type-id-98' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='notify_offset' type-id='type-id-99' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='694' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-94'/>
    <class-decl name='fm10k_vf_info' size-in-bits='22528' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='647' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mbx' type-id='type-id-23' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22336'>
        <var-decl name='rate' type-id='type-id-13' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22368'>
        <var-decl name='glort' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22384'>
        <var-decl name='sw_vid' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22400'>
        <var-decl name='pf_vid' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22416'>
        <var-decl name='mac' type-id='type-id-32' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22464'>
        <var-decl name='vsi' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22472'>
        <var-decl name='vf_idx' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22480'>
        <var-decl name='vf_flags' type-id='type-id-25' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22496'>
        <var-decl name='trusted' type-id='type-id-33' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='664' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fm10k_mbx_info' size-in-bits='22336' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='253' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-104' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='msg_data' type-id='type-id-105' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rx' type-id='type-id-106' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tx' type-id='type-id-106' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='timeout' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='rte_delay_us' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='mbx_reg' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='mbmem_reg' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='mbx_lock' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='mbx_hdr' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='max_size' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='mbmem_len' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='tail' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='tail_len' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='pulled' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='head' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='head_len' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='pushed' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='local' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='remote' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='state' type-id='type-id-107' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='test_result' type-id='type-id-16' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tx_busy' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tx_dropped' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tx_messages' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tx_dwords' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tx_mbmem_pulled' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rx_messages' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='rx_dwords' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='rx_mbmem_pushed' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='rx_parse_err' type-id='type-id-34' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='buffer' type-id='type-id-108' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='289' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fm10k_mbx_ops' size-in-bits='512' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='219' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connect' type-id='type-id-109' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='disconnect' type-id='type-id-110' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rx_ready' type-id='type-id-111' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tx_ready' type-id='type-id-112' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tx_complete' type-id='type-id-111' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='enqueue_tx' type-id='type-id-113' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='process' type-id='type-id-109' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='register_handlers' type-id='type-id-114' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='228' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-112'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-120'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-114'/>
    <class-decl name='fm10k_mbx_fifo' size-in-bits='128' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='232' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-18' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='tail' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-7' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='236' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='fm10k_mbx_state' filepath='../drivers/net/fm10k/base/fm10k_mbx.h' line='83' column='1' id='type-id-107'>
      <underlying-type type-id='type-id-8'/>
      <enumerator name='FM10K_STATE_CLOSED' value='0'/>
      <enumerator name='FM10K_STATE_CONNECT' value='1'/>
      <enumerator name='FM10K_STATE_OPEN' value='2'/>
      <enumerator name='FM10K_STATE_DISCONNECT' value='3'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='20480' id='type-id-108'>
      <subrange length='640' type-id='type-id-70' id='type-id-125'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-99'/>
    <class-decl name='fm10k_swapi_info' size-in-bits='224' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='623' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac' type-id='type-id-133' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nexthop' type-id='type-id-133' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ffu' type-id='type-id-133' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='627' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fm10k_swapi_table_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='618' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='used' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='avail' type-id='type-id-26' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_type.h' line='620' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-4'/>

    <array-type-def dimensions='1' type-id='type-id-123' size-in-bits='infinite' id='type-id-136'>
      <subrange length='infinite' id='type-id-137'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-136' const='yes' id='type-id-138'/>
    <var-decl name='fm10k_iov_msg_data_pf' type-id='type-id-138' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='154' column='1'/>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='infinite' id='type-id-139'>
      <subrange length='infinite' id='type-id-137'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-140'/>
    <var-decl name='fm10k_lport_map_msg_attr' type-id='type-id-140' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='117' column='1'/>
    <var-decl name='fm10k_update_pvid_msg_attr' type-id='type-id-140' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='121' column='1'/>
    <var-decl name='fm10k_err_msg_attr' type-id='type-id-140' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='127' column='1'/>
    <var-decl name='fm10k_1588_timestamp_msg_attr' type-id='type-id-140' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='131' column='1'/>
    <var-decl name='fm10k_1588_clock_owner_attr' type-id='type-id-140' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='138' column='1'/>
    <var-decl name='fm10k_master_clk_offset_attr' type-id='type-id-140' visibility='default' filepath='../drivers/net/fm10k/base/fm10k_pf.h' line='143' column='1'/>
    <function-type size-in-bits='64' id='type-id-55'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-119'>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-52'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-54'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-79'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-116'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-122'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-83'>
