<abi-corpus path='gcc//drivers/librte_pmd_ring.so.20.0' architecture='elf-amd-x86_64' soname='librte_pmd_ring.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_bus_pci.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='librte_bus_vdev.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_eth_from_ring' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_eth_from_rings' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../drivers/net/ring/rte_eth_ring.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='rte_ring' size-in-bits='3072' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='81' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-1' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memzone' type-id='type-id-4' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='capacity' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pad0' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='prod' type-id='type-id-7' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='pad1' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='cons' type-id='type-id-7' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad2' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-8'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='256' id='type-id-3'>
      <subrange length='32' type-id='type-id-8' id='type-id-9'/>

    </array-type-def>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-14' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-11'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-15' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-16' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-17'/>
    <typedef-decl name='uint64_t' type-id='type-id-17' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-13'/>
    <typedef-decl name='phys_addr_t' type-id='type-id-13' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-15'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-13' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-16'/>
    <typedef-decl name='size_t' type-id='type-id-8' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-12'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-18'/>
    <typedef-decl name='int32_t' type-id='type-id-18' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-14'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-19'/>
    <typedef-decl name='__uint32_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-20'/>
    <typedef-decl name='uint32_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-4'/>
    <class-decl name='rte_ring_headtail' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='65' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-22' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tail' type-id='type-id-22' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='single' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-5' volatile='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-23'/>
    <function-decl name='rte_eth_from_ring' mangled-name='rte_eth_from_ring' filepath='../drivers/net/ring/rte_eth_ring.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_from_ring@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='r' filepath='../drivers/net/ring/rte_eth_ring.c' line='404' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-28'/>
    <function-decl name='rte_eth_from_rings' mangled-name='rte_eth_from_rings' filepath='../drivers/net/ring/rte_eth_ring.c' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_from_rings@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../drivers/net/ring/rte_eth_ring.c' line='346' column='1'/>
      <parameter type-id='type-id-27' name='rx_queues' filepath='../drivers/net/ring/rte_eth_ring.c' line='346' column='1'/>
      <parameter type-id='type-id-28' name='nb_rx_queues' filepath='../drivers/net/ring/rte_eth_ring.c' line='347' column='1'/>
      <parameter type-id='type-id-27' name='tx_queues' filepath='../drivers/net/ring/rte_eth_ring.c' line='348' column='1'/>
      <parameter type-id='type-id-28' name='nb_tx_queues' filepath='../drivers/net/ring/rte_eth_ring.c' line='349' column='1'/>
      <parameter type-id='type-id-28' name='numa_node' filepath='../drivers/net/ring/rte_eth_ring.c' line='350' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
