<abi-corpus path='gcc//lib/librte_bpf.so.0.200' architecture='elf-amd-x86_64' soname='librte_bpf.so.0.200'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='libelf.so.1'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_bpf_destroy' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_elf_load' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_eth_rx_elf_load' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_eth_rx_unload' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_eth_tx_elf_load' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_eth_tx_unload' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_exec' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_exec_burst' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_get_jit' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bpf_load' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_bpf/bpf.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='rte_bpf_logtype' type-id='type-id-1' visibility='default' filepath='../lib/librte_bpf/bpf_impl.h' line='31' column='1'/>
    <class-decl name='rte_bpf' size-in-bits='704' is-struct='yes' visibility='default' filepath='../lib/librte_bpf/bpf_impl.h' line='17' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prm' type-id='type-id-3' visibility='default' filepath='../lib/librte_bpf/bpf_impl.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='jit' type-id='type-id-4' visibility='default' filepath='../lib/librte_bpf/bpf_impl.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sz' type-id='type-id-5' visibility='default' filepath='../lib/librte_bpf/bpf_impl.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='stack_sz' type-id='type-id-6' visibility='default' filepath='../lib/librte_bpf/bpf_impl.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_bpf_prm' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='91' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ins' type-id='type-id-7' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_ins' type-id='type-id-6' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xsym' type-id='type-id-8' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_xsym' type-id='type-id-6' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='prog_arg' type-id='type-id-9' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ebpf_insn' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_bpf/bpf_def.h' line='134' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-11' visibility='default' filepath='../lib/librte_bpf/bpf_def.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dst_reg' type-id='type-id-11' visibility='default' filepath='../lib/librte_bpf/bpf_def.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='src_reg' type-id='type-id-11' visibility='default' filepath='../lib/librte_bpf/bpf_def.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='off' type-id='type-id-12' visibility='default' filepath='../lib/librte_bpf/bpf_def.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='imm' type-id='type-id-13' visibility='default' filepath='../lib/librte_bpf/bpf_def.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-14'/>
    <typedef-decl name='__uint8_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-15'/>
    <typedef-decl name='uint8_t' type-id='type-id-15' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-11'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-16'/>
    <typedef-decl name='__int16_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-17'/>
    <typedef-decl name='int16_t' type-id='type-id-17' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-12'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-18'/>
    <typedef-decl name='int32_t' type-id='type-id-18' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-13'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-7'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-20'/>
    <typedef-decl name='__uint32_t' type-id='type-id-20' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-21'/>
    <typedef-decl name='uint32_t' type-id='type-id-21' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-6'/>
    <class-decl name='rte_bpf_xsym' size-in-bits='1408' is-struct='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='69' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-23' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-24' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-25' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-26'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-23'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-28'/>
    <enum-decl name='rte_bpf_xtype' filepath='../lib/librte_bpf/rte_bpf.h' line='60' column='1' id='type-id-24'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='RTE_BPF_XTYPE_FUNC' value='0'/>
      <enumerator name='RTE_BPF_XTYPE_VAR' value='1'/>
      <enumerator name='RTE_BPF_XTYPE_NUM' value='2'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='1280' is-anonymous='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='72' column='1' id='type-id-25'>
      <data-member access='private'>
        <var-decl name='func' type-id='type-id-29' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='80' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='var' type-id='type-id-30' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='84' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1280' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='73' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-31' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_args' type-id='type-id-6' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='args' type-id='type-id-32' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ret' type-id='type-id-9' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-33'/>
    <typedef-decl name='__uint64_t' type-id='type-id-33' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-34'/>
    <typedef-decl name='uint64_t' type-id='type-id-34' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-31'/>
    <class-decl name='rte_bpf_arg' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='41' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-37' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buf_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bpf_arg_type' filepath='../lib/librte_bpf/rte_bpf.h' line='30' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='RTE_BPF_ARG_UNDEF' value='0'/>
      <enumerator name='RTE_BPF_ARG_RAW' value='1'/>
      <enumerator name='RTE_BPF_ARG_PTR' value='16'/>
      <enumerator name='RTE_BPF_ARG_PTR_MBUF' value='17'/>
      <enumerator name='RTE_BPF_ARG_RESERVED' value='18'/>
    </enum-decl>
    <typedef-decl name='size_t' type-id='type-id-33' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-5'/>

    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='960' id='type-id-32'>
      <subrange length='5' type-id='type-id-33' id='type-id-38'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='81' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-39' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='type-id-9' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-8'/>
    <class-decl name='rte_bpf_jit' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='103' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-42' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sz' type-id='type-id-5' visibility='default' filepath='../lib/librte_bpf/rte_bpf.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-46'/>
    <function-decl name='rte_bpf_get_jit' mangled-name='rte_bpf_get_jit' filepath='../lib/librte_bpf/bpf.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_get_jit@@EXPERIMENTAL'>
      <parameter type-id='type-id-45' name='bpf' filepath='../lib/librte_bpf/bpf.c' line='30' column='1'/>
      <parameter type-id='type-id-46' name='jit' filepath='../lib/librte_bpf/bpf.c' line='30' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-47'/>
    <function-decl name='rte_bpf_destroy' mangled-name='rte_bpf_destroy' filepath='../lib/librte_bpf/bpf.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_destroy@@EXPERIMENTAL'>
      <parameter type-id='type-id-47' name='bpf' filepath='../lib/librte_bpf/bpf.c' line='20' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-35'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_bpf/bpf_exec.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-49'/>
    <function-decl name='rte_bpf_exec_burst' mangled-name='rte_bpf_exec_burst' filepath='../lib/librte_bpf/bpf_exec.c' line='428' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_exec_burst@@EXPERIMENTAL'>
      <parameter type-id='type-id-45' name='bpf' filepath='../lib/librte_bpf/bpf_exec.c' line='428' column='1'/>
      <parameter type-id='type-id-48' name='ctx' filepath='../lib/librte_bpf/bpf_exec.c' line='428' column='1'/>
      <parameter type-id='type-id-49' name='rc' filepath='../lib/librte_bpf/bpf_exec.c' line='428' column='1'/>
      <parameter type-id='type-id-6' name='num' filepath='../lib/librte_bpf/bpf_exec.c' line='429' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='rte_bpf_exec' mangled-name='rte_bpf_exec' filepath='../lib/librte_bpf/bpf_exec.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_exec@@EXPERIMENTAL'>
      <parameter type-id='type-id-45' name='bpf' filepath='../lib/librte_bpf/bpf_exec.c' line='447' column='1'/>
      <parameter type-id='type-id-39' name='ctx' filepath='../lib/librte_bpf/bpf_exec.c' line='447' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_bpf/bpf_load.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <function-decl name='rte_bpf_load' mangled-name='rte_bpf_load' filepath='../lib/librte_bpf/bpf_load.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_load@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='prm' filepath='../lib/librte_bpf/bpf_load.c' line='90' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_bpf/bpf_pkt.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-52'/>
    <typedef-decl name='__uint16_t' type-id='type-id-52' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-53'/>
    <typedef-decl name='uint16_t' type-id='type-id-53' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-54'/>
    <function-decl name='rte_bpf_eth_tx_elf_load' mangled-name='rte_bpf_eth_tx_elf_load' filepath='../lib/librte_bpf/bpf_pkt.c' line='592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_eth_tx_elf_load@@EXPERIMENTAL'>
      <parameter type-id='type-id-54' name='port' filepath='../lib/librte_bpf/bpf_pkt.c' line='592' column='1'/>
      <parameter type-id='type-id-54' name='queue' filepath='../lib/librte_bpf/bpf_pkt.c' line='592' column='1'/>
      <parameter type-id='type-id-51' name='prm' filepath='../lib/librte_bpf/bpf_pkt.c' line='593' column='1'/>
      <parameter type-id='type-id-23' name='fname' filepath='../lib/librte_bpf/bpf_pkt.c' line='593' column='1'/>
      <parameter type-id='type-id-23' name='sname' filepath='../lib/librte_bpf/bpf_pkt.c' line='593' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='../lib/librte_bpf/bpf_pkt.c' line='594' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_bpf_eth_rx_elf_load' mangled-name='rte_bpf_eth_rx_elf_load' filepath='../lib/librte_bpf/bpf_pkt.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_eth_rx_elf_load@@EXPERIMENTAL'>
      <parameter type-id='type-id-54' name='port' filepath='../lib/librte_bpf/bpf_pkt.c' line='592' column='1'/>
      <parameter type-id='type-id-54' name='queue' filepath='../lib/librte_bpf/bpf_pkt.c' line='592' column='1'/>
      <parameter type-id='type-id-51' name='prm' filepath='../lib/librte_bpf/bpf_pkt.c' line='593' column='1'/>
      <parameter type-id='type-id-23' name='fname' filepath='../lib/librte_bpf/bpf_pkt.c' line='593' column='1'/>
      <parameter type-id='type-id-23' name='sname' filepath='../lib/librte_bpf/bpf_pkt.c' line='593' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='../lib/librte_bpf/bpf_pkt.c' line='594' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_bpf_eth_tx_unload' mangled-name='rte_bpf_eth_tx_unload' filepath='../lib/librte_bpf/bpf_pkt.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_eth_tx_unload@@EXPERIMENTAL'>
      <parameter type-id='type-id-54' name='port' filepath='../lib/librte_bpf/bpf_pkt.c' line='495' column='1'/>
      <parameter type-id='type-id-54' name='queue' filepath='../lib/librte_bpf/bpf_pkt.c' line='495' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='rte_bpf_eth_rx_unload' mangled-name='rte_bpf_eth_rx_unload' filepath='../lib/librte_bpf/bpf_pkt.c' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_eth_rx_unload@@EXPERIMENTAL'>
      <parameter type-id='type-id-54' name='port' filepath='../lib/librte_bpf/bpf_pkt.c' line='495' column='1'/>
      <parameter type-id='type-id-54' name='queue' filepath='../lib/librte_bpf/bpf_pkt.c' line='495' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_bpf/bpf_load_elf.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_bpf_elf_load' mangled-name='rte_bpf_elf_load' filepath='../lib/librte_bpf/bpf_load_elf.c' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bpf_elf_load@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='prm' filepath='../lib/librte_bpf/bpf_load_elf.c' line='298' column='1'/>
      <parameter type-id='type-id-23' name='fname' filepath='../lib/librte_bpf/bpf_load_elf.c' line='298' column='1'/>
      <parameter type-id='type-id-23' name='sname' filepath='../lib/librte_bpf/bpf_load_elf.c' line='299' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
