<abi-corpus path='gcc//lib/librte_stack.so.0.200' architecture='elf-amd-x86_64' soname='librte_stack.so.0.200'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_stack_create' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_stack_free' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_stack_lookup' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_stack/rte_stack.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='stack_logtype' type-id='type-id-1' visibility='default' filepath='../lib/librte_stack/stack_pvt.h' line='14' column='1'/>
    <class-decl name='rte_stack' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='77' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='memzone' type-id='type-id-4' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='capacity' type-id='type-id-5' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-7'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-8'/>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='224' id='type-id-3'>
      <subrange length='28' type-id='type-id-8' id='type-id-9'/>

    </array-type-def>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-14' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-15' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='256' id='type-id-11'>
      <subrange length='32' type-id='type-id-8' id='type-id-16'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-12'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-17' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-19'/>
    <typedef-decl name='uint64_t' type-id='type-id-19' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-14'/>
    <typedef-decl name='phys_addr_t' type-id='type-id-14' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-17'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-14' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-18'/>
    <typedef-decl name='size_t' type-id='type-id-8' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-13'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-20'/>
    <typedef-decl name='int32_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-15'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-21'/>
    <typedef-decl name='__uint32_t' type-id='type-id-21' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-22'/>
    <typedef-decl name='uint32_t' type-id='type-id-22' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-4'/>
    <union-decl name='__anonymous_union__' size-in-bits='1024' is-anonymous='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='85' column='1' id='type-id-6'>
      <data-member access='private'>
        <var-decl name='stack_lf' type-id='type-id-24' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='86' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='stack_std' type-id='type-id-25' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='87' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_stack_lf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='56' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='used' type-id='type-id-26' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='free' type-id='type-id-26' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='elems' type-id='type-id-27' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_stack_lf_list' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='46' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-28' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-14' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_stack_lf_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='41' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='top' type-id='type-id-29' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cnt' type-id='type-id-14' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_stack_lf_elem' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='36' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-31' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-29' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-29'/>

    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='infinite' id='type-id-27'>
      <subrange length='infinite' type-id='type-id-8' id='type-id-33'/>

    </array-type-def>
    <class-decl name='rte_stack_std' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='68' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-34' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='type-id-5' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='objs' type-id='type-id-35' visibility='default' filepath='../lib/librte_stack/rte_stack.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-34' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='30' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-37' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-1' volatile='yes' id='type-id-37'/>
    <typedef-decl name='rte_spinlock_t' type-id='type-id-36' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='32' column='1' id='type-id-34'/>

    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='infinite' id='type-id-35'>
      <subrange length='infinite' type-id='type-id-8' id='type-id-33'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <function-decl name='rte_stack_lookup' mangled-name='rte_stack_lookup' filepath='../lib/librte_stack/rte_stack.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_stack_lookup@@EXPERIMENTAL'>
      <parameter type-id='type-id-40' name='name' filepath='../lib/librte_stack/rte_stack.c' line='161' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='rte_stack_free' mangled-name='rte_stack_free' filepath='../lib/librte_stack/rte_stack.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_stack_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-38' name='s' filepath='../lib/librte_stack/rte_stack.c' line='129' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='rte_stack_create' mangled-name='rte_stack_create' filepath='../lib/librte_stack/rte_stack.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_stack_create@@EXPERIMENTAL'>
      <parameter type-id='type-id-40' name='name' filepath='../lib/librte_stack/rte_stack.c' line='51' column='1'/>
      <parameter type-id='type-id-21' name='count' filepath='../lib/librte_stack/rte_stack.c' line='51' column='1'/>
      <parameter type-id='type-id-1' name='socket_id' filepath='../lib/librte_stack/rte_stack.c' line='51' column='1'/>
      <parameter type-id='type-id-5' name='flags' filepath='../lib/librte_stack/rte_stack.c' line='52' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
