<abi-corpus path='gcc//lib/librte_kni.so.20.0' architecture='elf-amd-x86_64' soname='librte_kni.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_kni_alloc' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_close' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_get_name' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_handle_request' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_init' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_register_handlers' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_release' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_rx_burst' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_tx_burst' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_unregister_handlers' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_kni_update_link' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_kni/rte_kni.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='void' id='type-id-1'/>
    <function-decl name='rte_kni_close' mangled-name='rte_kni_close' filepath='../lib/librte_kni/rte_kni.c' line='816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_close@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <class-decl name='rte_kni' size-in-bits='1600' is-struct='yes' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='58' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='group_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='slot_id' type-id='type-id-6' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pktmbuf_pool' type-id='type-id-7' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mbuf_size' type-id='type-id-8' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_tx_q' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='m_rx_q' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='m_alloc_q' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='m_free_q' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_q' type-id='type-id-10' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rx_q' type-id='type-id-10' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_q' type-id='type-id-10' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='free_q' type-id='type-id-10' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='m_req_q' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='m_resp_q' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='m_sync_addr' type-id='type-id-9' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='req_q' type-id='type-id-10' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='resp_q' type-id='type-id-10' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sync_addr' type-id='type-id-11' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ops' type-id='type-id-12' visibility='default' filepath='../lib/librte_kni/rte_kni.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-13'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-14'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-4'>
      <subrange length='16' type-id='type-id-14' id='type-id-15'/>

    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-16'/>
    <typedef-decl name='__uint16_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-17'/>
    <typedef-decl name='uint16_t' type-id='type-id-17' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-5'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <typedef-decl name='__uint32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-18'/>
    <typedef-decl name='uint32_t' type-id='type-id-18' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-6'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-20' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-8' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-2' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-8' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-23' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='256' id='type-id-20'>
      <subrange length='32' type-id='type-id-14' id='type-id-26'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-21'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-27' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-11'/>
    <typedef-decl name='__uint64_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-28'/>
    <typedef-decl name='uint64_t' type-id='type-id-28' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-27'/>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-27' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-22' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-30'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-27' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-32'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-27' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-33'/>
    <typedef-decl name='size_t' type-id='type-id-14' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-31'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-34'/>
    <typedef-decl name='int32_t' type-id='type-id-34' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-22'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-9'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-37' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='98304' id='type-id-37'>
      <subrange length='1536' type-id='type-id-14' id='type-id-38'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-23'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-42' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-7'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-43'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-32' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-45' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-47' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-31' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-44'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-48'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-32' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-50' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <class-decl name='rte_kni_fifo' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_eal/linux/eal/include/rte_kni_common.h' line='59' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write' type-id='type-id-53' visibility='default' filepath='../lib/librte_eal/linux/eal/include/rte_kni_common.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='read' type-id='type-id-53' visibility='default' filepath='../lib/librte_eal/linux/eal/include/rte_kni_common.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/linux/eal/include/rte_kni_common.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='elem_size' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/linux/eal/include/rte_kni_common.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer' type-id='type-id-54' visibility='default' filepath='../lib/librte_eal/linux/eal/include/rte_kni_common.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-8' volatile='yes' id='type-id-53'/>
    <qualified-type-def type-id='type-id-11' volatile='yes' id='type-id-55'/>

    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='infinite' id='type-id-56'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-57'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-56' volatile='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-10'/>
    <class-decl name='rte_kni_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='37' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='change_mtu' type-id='type-id-58' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='config_network_if' type-id='type-id-59' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='config_mac_address' type-id='type-id-60' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_promiscusity' type-id='type-id-59' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='config_allmulticast' type-id='type-id-59' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-58'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-62'/>
    <typedef-decl name='__uint8_t' type-id='type-id-62' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-63'/>
    <typedef-decl name='uint8_t' type-id='type-id-63' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-64'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-68'/>
    <function-decl name='rte_kni_unregister_handlers' mangled-name='rte_kni_unregister_handlers' filepath='../lib/librte_kni/rte_kni.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_unregister_handlers@@DPDK_20.0'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='763' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-69'/>
    <function-decl name='rte_kni_register_handlers' mangled-name='rte_kni_register_handlers' filepath='../lib/librte_kni/rte_kni.c' line='738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_register_handlers@@DPDK_20.0'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='738' column='1'/>
      <parameter type-id='type-id-69' name='ops' filepath='../lib/librte_kni/rte_kni.c' line='738' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <function-decl name='rte_kni_get_name' mangled-name='rte_kni_get_name' filepath='../lib/librte_kni/rte_kni.c' line='715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_get_name@@DPDK_20.0'>
      <parameter type-id='type-id-73' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='715' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='rte_kni_get' mangled-name='rte_kni_get' filepath='../lib/librte_kni/rte_kni.c' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_get@@DPDK_20.0'>
      <parameter type-id='type-id-71' name='name' filepath='../lib/librte_kni/rte_kni.c' line='698' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-75' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-11' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-77' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-27' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-75' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-27' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-75' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-7' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-78' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-79' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-80' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='infinite' id='type-id-81'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-57'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-81' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-75'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-76'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-33' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-27' size-in-bits='infinite' id='type-id-82'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-57'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-82' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-78'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-84' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-11' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-85' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-87' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-84'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-85' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-89' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-90'/>
    <typedef-decl name='__int16_t' type-id='type-id-90' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-91'/>
    <typedef-decl name='int16_t' type-id='type-id-91' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-92'/>
    <qualified-type-def type-id='type-id-92' volatile='yes' id='type-id-89'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-88' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-85'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-79'/>

    <array-type-def dimensions='1' type-id='type-id-27' size-in-bits='128' id='type-id-80'>
      <subrange length='2' type-id='type-id-14' id='type-id-93'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-94'/>
    <function-decl name='rte_kni_rx_burst' mangled-name='rte_kni_rx_burst' filepath='../lib/librte_kni/rte_kni.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_rx_burst@@DPDK_20.0'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='617' column='1'/>
      <parameter type-id='type-id-94' name='mbufs' filepath='../lib/librte_kni/rte_kni.c' line='617' column='1'/>
      <parameter type-id='type-id-8' name='num' filepath='../lib/librte_kni/rte_kni.c' line='617' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_kni_tx_burst' mangled-name='rte_kni_tx_burst' filepath='../lib/librte_kni/rte_kni.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_tx_burst@@DPDK_20.0'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='598' column='1'/>
      <parameter type-id='type-id-94' name='mbufs' filepath='../lib/librte_kni/rte_kni.c' line='598' column='1'/>
      <parameter type-id='type-id-8' name='num' filepath='../lib/librte_kni/rte_kni.c' line='598' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rte_kni_handle_request' mangled-name='rte_kni_handle_request' filepath='../lib/librte_kni/rte_kni.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_handle_request@@DPDK_20.0'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='527' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rte_kni_release' mangled-name='rte_kni_release' filepath='../lib/librte_kni/rte_kni.c' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_release@@DPDK_20.0'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='397' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <class-decl name='rte_kni_conf' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='59' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='core_id' type-id='type-id-6' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='group_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mbuf_size' type-id='type-id-8' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='addr' type-id='type-id-96' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='id' type-id='type-id-97' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='force_bind' type-id='type-id-64' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='mac_addr' type-id='type-id-98' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mtu' type-id='type-id-5' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='min_mtu' type-id='type-id-5' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='max_mtu' type-id='type-id-5' visibility='default' filepath='../lib/librte_kni/rte_kni.h' line='77' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='61' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-6' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='type-id-64' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='devid' type-id='type-id-64' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='function' type-id='type-id-64' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='50' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='type-id-6' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subsystem_vendor_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subsystem_device_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='55' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-64' size-in-bits='48' id='type-id-98'>
      <subrange length='6' type-id='type-id-14' id='type-id-99'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-100'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <function-decl name='rte_kni_alloc' mangled-name='rte_kni_alloc' filepath='../lib/librte_kni/rte_kni.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_alloc@@DPDK_20.0'>
      <parameter type-id='type-id-7' name='pktmbuf_pool' filepath='../lib/librte_kni/rte_kni.c' line='206' column='1'/>
      <parameter type-id='type-id-101' name='conf' filepath='../lib/librte_kni/rte_kni.c' line='207' column='1'/>
      <parameter type-id='type-id-69' name='ops' filepath='../lib/librte_kni/rte_kni.c' line='208' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='rte_kni_init' mangled-name='rte_kni_init' filepath='../lib/librte_kni/rte_kni.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_init@@DPDK_20.0'>
      <parameter type-id='type-id-8' name='max_kni_ifaces' filepath='../lib/librte_kni/rte_kni.c' line='99' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rte_kni_update_link' mangled-name='rte_kni_update_link' filepath='../lib/librte_kni/rte_kni.c' line='776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_kni_update_link@@EXPERIMENTAL'>
      <parameter type-id='type-id-68' name='kni' filepath='../lib/librte_kni/rte_kni.c' line='776' column='1'/>
      <parameter type-id='type-id-8' name='linkup' filepath='../lib/librte_kni/rte_kni.c' line='776' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-65'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-67'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-61'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-86'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
</abi-corpus>
