<abi-corpus path='gcc//lib/librte_lpm.so.20.0' architecture='elf-amd-x86_64' soname='librte_lpm.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_lpm6_add' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_delete_all' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_delete_bulk_func' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_find_existing' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_is_rule_present' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_lookup' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm6_lookup_bulk_func' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_add' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_delete_all' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_find_existing' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_lpm_is_rule_present' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_lpm/rte_lpm.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='void' id='type-id-1'/>
    <class-decl name='rte_lpm' size-in-bits='536873984' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='121' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_rules' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='number_tbl8s' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rule_info' type-id='type-id-5' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tbl24' type-id='type-id-6' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536873472'>
        <var-decl name='tbl8' type-id='type-id-7' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536873536'>
        <var-decl name='rules_tbl' type-id='type-id-8' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-9'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-10'/>

    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='256' id='type-id-3'>
      <subrange length='32' type-id='type-id-10' id='type-id-11'/>

    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-12'/>
    <typedef-decl name='__uint32_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-13'/>
    <typedef-decl name='uint32_t' type-id='type-id-13' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-4'/>
    <class-decl name='rte_lpm_rule_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='115' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='used_rules' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='first_rule' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='117' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='2048' id='type-id-5'>
      <subrange length='32' type-id='type-id-10' id='type-id-11'/>

    </array-type-def>
    <class-decl name='rte_lpm_tbl_entry' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='68' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='next_hop' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='valid' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='valid_group' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='depth' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='85' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='536870912' id='type-id-6'>
      <subrange length='16777216' type-id='type-id-10' id='type-id-16'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-7'/>
    <class-decl name='rte_lpm_rule' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='109' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ip' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='next_hop' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-18'/>
    <function-decl name='rte_lpm_delete_all' mangled-name='rte_lpm_delete_all' filepath='../lib/librte_lpm/rte_lpm.c' line='1053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_delete_all@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='lpm' filepath='../lib/librte_lpm/rte_lpm.c' line='1053' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-20'/>
    <typedef-decl name='__uint8_t' type-id='type-id-20' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-21'/>
    <typedef-decl name='uint8_t' type-id='type-id-21' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-22'/>
    <function-decl name='rte_lpm_delete' mangled-name='rte_lpm_delete' filepath='../lib/librte_lpm/rte_lpm.c' line='997' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_delete@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='lpm' filepath='../lib/librte_lpm/rte_lpm.c' line='997' column='1'/>
      <parameter type-id='type-id-4' name='ip' filepath='../lib/librte_lpm/rte_lpm.c' line='997' column='1'/>
      <parameter type-id='type-id-22' name='depth' filepath='../lib/librte_lpm/rte_lpm.c' line='997' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-23'/>
    <function-decl name='rte_lpm_is_rule_present' mangled-name='rte_lpm_is_rule_present' filepath='../lib/librte_lpm/rte_lpm.c' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_is_rule_present@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='lpm' filepath='../lib/librte_lpm/rte_lpm.c' line='706' column='1'/>
      <parameter type-id='type-id-4' name='ip' filepath='../lib/librte_lpm/rte_lpm.c' line='706' column='1'/>
      <parameter type-id='type-id-22' name='depth' filepath='../lib/librte_lpm/rte_lpm.c' line='706' column='1'/>
      <parameter type-id='type-id-23' name='next_hop' filepath='../lib/librte_lpm/rte_lpm.c' line='707' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm_add' mangled-name='rte_lpm_add' filepath='../lib/librte_lpm/rte_lpm.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_add@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='lpm' filepath='../lib/librte_lpm/rte_lpm.c' line='663' column='1'/>
      <parameter type-id='type-id-4' name='ip' filepath='../lib/librte_lpm/rte_lpm.c' line='663' column='1'/>
      <parameter type-id='type-id-22' name='depth' filepath='../lib/librte_lpm/rte_lpm.c' line='663' column='1'/>
      <parameter type-id='type-id-4' name='next_hop' filepath='../lib/librte_lpm/rte_lpm.c' line='664' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm_free' mangled-name='rte_lpm_free' filepath='../lib/librte_lpm/rte_lpm.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_free@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='lpm' filepath='../lib/librte_lpm/rte_lpm.c' line='227' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <class-decl name='rte_lpm_config' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='102' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_rules' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='number_tbl8s' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='../lib/librte_lpm/rte_lpm.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <function-decl name='rte_lpm_create' mangled-name='rte_lpm_create' filepath='../lib/librte_lpm/rte_lpm.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_create@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_lpm/rte_lpm.c' line='122' column='1'/>
      <parameter type-id='type-id-19' name='socket_id' filepath='../lib/librte_lpm/rte_lpm.c' line='122' column='1'/>
      <parameter type-id='type-id-28' name='config' filepath='../lib/librte_lpm/rte_lpm.c' line='123' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='rte_lpm_find_existing' mangled-name='rte_lpm_find_existing' filepath='../lib/librte_lpm/rte_lpm.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm_find_existing@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_lpm/rte_lpm.c' line='94' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_lpm/rte_lpm6.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_lpm6' size-in-bits='536871936' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='99' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_rules' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='used_rules' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='number_tbl8s' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rules_tbl' type-id='type-id-30' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tbl24' type-id='type-id-31' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536871424'>
        <var-decl name='tbl8_pool' type-id='type-id-23' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536871488'>
        <var-decl name='tbl8_pool_pos' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536871552'>
        <var-decl name='tbl8_hdrs' type-id='type-id-32' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536871936'>
        <var-decl name='tbl8' type-id='type-id-33' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_hash' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-30'/>
    <class-decl name='rte_lpm6_tbl_entry' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='64' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='next_hop' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='depth' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='valid' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='valid_group' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ext_entry' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='71' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='536870912' id='type-id-31'>
      <subrange length='16777216' type-id='type-id-10' id='type-id-16'/>

    </array-type-def>
    <class-decl name='rte_lpm_tbl8_hdr' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='88' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='owner_tbl_ind' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='owner_entry_ind' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_cnt' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.c' line='95' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-32'/>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='infinite' id='type-id-33'>
      <subrange length='infinite' type-id='type-id-10' id='type-id-37'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-39'/>
    <function-decl name='rte_lpm6_delete' mangled-name='rte_lpm6_delete' filepath='../lib/librte_lpm/rte_lpm6.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_delete@@DPDK_20.0'>
      <parameter type-id='type-id-38' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='1294' column='1'/>
      <parameter type-id='type-id-39' name='ip' filepath='../lib/librte_lpm/rte_lpm6.c' line='1294' column='1'/>
      <parameter type-id='type-id-22' name='depth' filepath='../lib/librte_lpm/rte_lpm6.c' line='1294' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm6_delete_all' mangled-name='rte_lpm6_delete_all' filepath='../lib/librte_lpm/rte_lpm6.c' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_delete_all@@DPDK_20.0'>
      <parameter type-id='type-id-38' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='1111' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='128' id='type-id-40'>
      <subrange length='16' type-id='type-id-10' id='type-id-41'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-42'/>
    <function-decl name='rte_lpm6_delete_bulk_func' mangled-name='rte_lpm6_delete_bulk_func' filepath='../lib/librte_lpm/rte_lpm6.c' line='1072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_delete_bulk_func@@DPDK_20.0'>
      <parameter type-id='type-id-38' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='1072' column='1'/>
      <parameter type-id='type-id-42' name='ips' filepath='../lib/librte_lpm/rte_lpm6.c' line='1073' column='1'/>
      <parameter type-id='type-id-39' name='depths' filepath='../lib/librte_lpm/rte_lpm6.c' line='1073' column='1'/>
      <parameter type-id='type-id-12' name='n' filepath='../lib/librte_lpm/rte_lpm6.c' line='1074' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm6_is_rule_present' mangled-name='rte_lpm6_is_rule_present' filepath='../lib/librte_lpm/rte_lpm6.c' line='1023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_is_rule_present@@DPDK_20.0'>
      <parameter type-id='type-id-38' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='1023' column='1'/>
      <parameter type-id='type-id-39' name='ip' filepath='../lib/librte_lpm/rte_lpm6.c' line='1023' column='1'/>
      <parameter type-id='type-id-22' name='depth' filepath='../lib/librte_lpm/rte_lpm6.c' line='1023' column='1'/>
      <parameter type-id='type-id-23' name='next_hop' filepath='../lib/librte_lpm/rte_lpm6.c' line='1024' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <typedef-decl name='__int32_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-45'/>
    <typedef-decl name='int32_t' type-id='type-id-45' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <function-decl name='rte_lpm6_lookup_bulk_func' mangled-name='rte_lpm6_lookup_bulk_func' filepath='../lib/librte_lpm/rte_lpm6.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_lookup_bulk_func@@DPDK_20.0'>
      <parameter type-id='type-id-44' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='978' column='1'/>
      <parameter type-id='type-id-42' name='ips' filepath='../lib/librte_lpm/rte_lpm6.c' line='979' column='1'/>
      <parameter type-id='type-id-47' name='next_hops' filepath='../lib/librte_lpm/rte_lpm6.c' line='980' column='1'/>
      <parameter type-id='type-id-12' name='n' filepath='../lib/librte_lpm/rte_lpm6.c' line='980' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm6_lookup' mangled-name='rte_lpm6_lookup' filepath='../lib/librte_lpm/rte_lpm6.c' line='946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_lookup@@DPDK_20.0'>
      <parameter type-id='type-id-44' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='946' column='1'/>
      <parameter type-id='type-id-39' name='ip' filepath='../lib/librte_lpm/rte_lpm6.c' line='946' column='1'/>
      <parameter type-id='type-id-23' name='next_hop' filepath='../lib/librte_lpm/rte_lpm6.c' line='947' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm6_add' mangled-name='rte_lpm6_add' filepath='../lib/librte_lpm/rte_lpm6.c' line='857' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_add@@DPDK_20.0'>
      <parameter type-id='type-id-38' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='857' column='1'/>
      <parameter type-id='type-id-39' name='ip' filepath='../lib/librte_lpm/rte_lpm6.c' line='857' column='1'/>
      <parameter type-id='type-id-22' name='depth' filepath='../lib/librte_lpm/rte_lpm6.c' line='857' column='1'/>
      <parameter type-id='type-id-4' name='next_hop' filepath='../lib/librte_lpm/rte_lpm6.c' line='858' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_lpm6_free' mangled-name='rte_lpm6_free' filepath='../lib/librte_lpm/rte_lpm6.c' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_free@@DPDK_20.0'>
      <parameter type-id='type-id-38' name='lpm' filepath='../lib/librte_lpm/rte_lpm6.c' line='414' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_lpm6_find_existing' mangled-name='rte_lpm6_find_existing' filepath='../lib/librte_lpm/rte_lpm6.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_find_existing@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_lpm/rte_lpm6.c' line='386' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <class-decl name='rte_lpm6_config' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.h' line='29' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_rules' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='number_tbl8s' type-id='type-id-4' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='../lib/librte_lpm/rte_lpm6.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <function-decl name='rte_lpm6_create' mangled-name='rte_lpm6_create' filepath='../lib/librte_lpm/rte_lpm6.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lpm6_create@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_lpm/rte_lpm6.c' line='248' column='1'/>
      <parameter type-id='type-id-19' name='socket_id' filepath='../lib/librte_lpm/rte_lpm6.c' line='248' column='1'/>
      <parameter type-id='type-id-50' name='config' filepath='../lib/librte_lpm/rte_lpm6.c' line='249' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
