<abi-corpus path='gcc//lib/librte_vhost.so.20.0' architecture='elf-amd-x86_64' soname='librte_vhost.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_cryptodev.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='librte_pci.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_vdpa_find_device_id' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vdpa_get_device' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vdpa_get_device_num' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rte_vhost_enable_guest_notification' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_enqueue_burst' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_extern_callback_register' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_ifname' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_log_base' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_mem_table' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_mtu' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_negotiated_features' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_numa_node' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_queue_num' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_vdpa_device_id' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_vhost_ring_inflight' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_vhost_vring' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_vring_base' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_vring_base_from_inflight' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_get_vring_num' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_host_notifier_ctrl' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_log_used_vring' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_log_write' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_rx_queue_count' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_set_inflight_desc_packed' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_set_inflight_desc_split' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_set_last_inflight_io_packed' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_set_last_inflight_io_split' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_set_vring_base' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vhost_vring_call' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_vhost/socket.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <function-decl name='rte_vhost_driver_start' mangled-name='rte_vhost_driver_start' filepath='../lib/librte_vhost/socket.c' line='1132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_start@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='1132' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='vhost_device_ops' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='237' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='new_device' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_device' type-id='type-id-7' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vring_state_changed' type-id='type-id-8' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='features_changed' type-id='type-id-9' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='new_connection' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='destroy_connection' type-id='type-id-7' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='guest_notified' type-id='type-id-7' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='reserved' type-id='type-id-10' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-6'/>
    <type-decl name='void' id='type-id-12'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-7'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-14'/>
    <typedef-decl name='__uint16_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-15'/>
    <typedef-decl name='uint16_t' type-id='type-id-15' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-16'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-8'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-18'/>
    <typedef-decl name='__uint64_t' type-id='type-id-18' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-19'/>
    <typedef-decl name='uint64_t' type-id='type-id-19' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-20'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-22'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='64' id='type-id-10'>
      <subrange length='1' type-id='type-id-18' id='type-id-23'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-26'/>
    <function-decl name='rte_vhost_driver_callback_register' mangled-name='rte_vhost_driver_callback_register' filepath='../lib/librte_vhost/socket.c' line='1105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_callback_register@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='1105' column='1'/>
      <parameter type-id='type-id-26' name='ops' filepath='../lib/librte_vhost/socket.c' line='1106' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_unregister' mangled-name='rte_vhost_driver_unregister' filepath='../lib/librte_vhost/socket.c' line='1031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='1031' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_register' mangled-name='rte_vhost_driver_register' filepath='../lib/librte_vhost/socket.c' line='846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_register@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='846' column='1'/>
      <parameter type-id='type-id-20' name='flags' filepath='../lib/librte_vhost/socket.c' line='846' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-27'/>
    <function-decl name='rte_vhost_driver_get_features' mangled-name='rte_vhost_driver_get_features' filepath='../lib/librte_vhost/socket.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_get_features@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='690' column='1'/>
      <parameter type-id='type-id-27' name='features' filepath='../lib/librte_vhost/socket.c' line='690' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_set_features' mangled-name='rte_vhost_driver_set_features' filepath='../lib/librte_vhost/socket.c' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_set_features@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <parameter type-id='type-id-20' name='features' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_enable_features' mangled-name='rte_vhost_driver_enable_features' filepath='../lib/librte_vhost/socket.c' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_enable_features@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <parameter type-id='type-id-20' name='features' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_disable_features' mangled-name='rte_vhost_driver_disable_features' filepath='../lib/librte_vhost/socket.c' line='626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_disable_features@@DPDK_20.0'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <parameter type-id='type-id-20' name='features' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-28'/>
    <typedef-decl name='__uint32_t' type-id='type-id-28' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-29'/>
    <typedef-decl name='uint32_t' type-id='type-id-29' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <function-decl name='rte_vhost_driver_get_queue_num' mangled-name='rte_vhost_driver_get_queue_num' filepath='../lib/librte_vhost/socket.c' line='787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_get_queue_num@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='787' column='1'/>
      <parameter type-id='type-id-31' name='queue_num' filepath='../lib/librte_vhost/socket.c' line='787' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_get_protocol_features' mangled-name='rte_vhost_driver_get_protocol_features' filepath='../lib/librte_vhost/socket.c' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_get_protocol_features@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='690' column='1'/>
      <parameter type-id='type-id-27' name='features' filepath='../lib/librte_vhost/socket.c' line='690' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_set_protocol_features' mangled-name='rte_vhost_driver_set_protocol_features' filepath='../lib/librte_vhost/socket.c' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_set_protocol_features@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <parameter type-id='type-id-20' name='features' filepath='../lib/librte_vhost/socket.c' line='669' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_get_vdpa_device_id' mangled-name='rte_vhost_driver_get_vdpa_device_id' filepath='../lib/librte_vhost/socket.c' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_get_vdpa_device_id@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='611' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_detach_vdpa_device' mangled-name='rte_vhost_driver_detach_vdpa_device' filepath='../lib/librte_vhost/socket.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_detach_vdpa_device@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='597' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_driver_attach_vdpa_device' mangled-name='rte_vhost_driver_attach_vdpa_device' filepath='../lib/librte_vhost/socket.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_driver_attach_vdpa_device@@EXPERIMENTAL'>
      <parameter type-id='type-id-4' name='path' filepath='../lib/librte_vhost/socket.c' line='580' column='1'/>
      <parameter type-id='type-id-1' name='did' filepath='../lib/librte_vhost/socket.c' line='580' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-11'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-17'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-21'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-13'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-12'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_vhost/vdpa.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_vdpa_relay_vring_used' mangled-name='rte_vdpa_relay_vring_used' filepath='../lib/librte_vhost/vdpa.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vdpa_relay_vring_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vdpa.c' line='130' column='1'/>
      <parameter type-id='type-id-16' name='qid' filepath='../lib/librte_vhost/vdpa.c' line='130' column='1'/>
      <parameter type-id='type-id-22' name='vring_m' filepath='../lib/librte_vhost/vdpa.c' line='130' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vdpa_get_device_num' mangled-name='rte_vdpa_get_device_num' filepath='../lib/librte_vhost/vdpa.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vdpa_get_device_num@@EXPERIMENTAL'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_vdpa_device' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='83' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-33' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ops' type-id='type-id-34' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vdpa_dev_addr' size-in-bits='544' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='29' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-35' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='' type-id='type-id-36' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-37'/>
    <enum-decl name='vdpa_addr_type' filepath='../lib/librte_vhost/rte_vdpa.h' line='21' column='1' id='type-id-35'>
      <underlying-type type-id='type-id-37'/>
      <enumerator name='PCI_ADDR' value='0'/>
      <enumerator name='VDPA_ADDR_MAX' value='1'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='34' column='1' id='type-id-36'>
      <data-member access='private'>
        <var-decl name='__dummy' type-id='type-id-38' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='35' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pci_addr' type-id='type-id-39' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-40'/>
    <typedef-decl name='__uint8_t' type-id='type-id-40' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-41'/>
    <typedef-decl name='uint8_t' type-id='type-id-41' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-42'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='512' id='type-id-38'>
      <subrange length='64' type-id='type-id-18' id='type-id-43'/>

    </array-type-def>
    <class-decl name='rte_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='61' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-30' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='type-id-42' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='devid' type-id='type-id-42' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='function' type-id='type-id-42' visibility='default' filepath='../lib/librte_pci/rte_pci.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vdpa_dev_ops' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='43' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='get_queue_num' type-id='type-id-45' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_features' type-id='type-id-46' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_protocol_features' type-id='type-id-46' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_conf' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_close' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_vring_state' type-id='type-id-47' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='set_features' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='migration_done' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_vfio_group_fd' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_vfio_device_fd' type-id='type-id-6' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_notify_area' type-id='type-id-48' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='reserved' type-id='type-id-49' visibility='default' filepath='../lib/librte_vhost/rte_vdpa.h' line='77' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-48'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='320' id='type-id-49'>
      <subrange length='5' type-id='type-id-18' id='type-id-54'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-55'/>
    <function-decl name='rte_vdpa_get_device' mangled-name='rte_vdpa_get_device' filepath='../lib/librte_vhost/vdpa.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vdpa_get_device@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='did' filepath='../lib/librte_vhost/vdpa.c' line='115' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-56'/>
    <function-decl name='rte_vdpa_find_device_id' mangled-name='rte_vdpa_find_device_id' filepath='../lib/librte_vhost/vdpa.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vdpa_find_device_id@@EXPERIMENTAL'>
      <parameter type-id='type-id-56' name='addr' filepath='../lib/librte_vhost/vdpa.c' line='97' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vdpa_unregister_device' mangled-name='rte_vdpa_unregister_device' filepath='../lib/librte_vhost/vdpa.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vdpa_unregister_device@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='did' filepath='../lib/librte_vhost/vdpa.c' line='84' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vdpa_register_device' mangled-name='rte_vdpa_register_device' filepath='../lib/librte_vhost/vdpa.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vdpa_register_device@@EXPERIMENTAL'>
      <parameter type-id='type-id-56' name='addr' filepath='../lib/librte_vhost/vdpa.c' line='45' column='1'/>
      <parameter type-id='type-id-34' name='ops' filepath='../lib/librte_vhost/vdpa.c' line='46' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-52'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-53'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-51'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_vhost/vhost.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='virtio_net' size-in-bits='50688' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='344' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mem' type-id='type-id-58' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='features' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol_features' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vid' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='flags' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vhost_hlen' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='broadcast_rarp' type-id='type-id-59' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nr_vring' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dequeue_zero_copy' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='extbuf' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='linearbuf' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='virtqueue' type-id='type-id-60' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='inflight_info' type-id='type-id-61' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='ifname' type-id='type-id-62' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49664'>
        <var-decl name='log_size' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49728'>
        <var-decl name='log_base' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49792'>
        <var-decl name='log_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49856'>
        <var-decl name='mac' type-id='type-id-63' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49904'>
        <var-decl name='mtu' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49920'>
        <var-decl name='notify_ops' type-id='type-id-25' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49984'>
        <var-decl name='nr_guest_pages' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50016'>
        <var-decl name='max_guest_pages' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50048'>
        <var-decl name='guest_pages' type-id='type-id-64' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50112'>
        <var-decl name='slave_req_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50144'>
        <var-decl name='slave_req_lock' type-id='type-id-65' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50176'>
        <var-decl name='postcopy_ufd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50208'>
        <var-decl name='postcopy_listening' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50240'>
        <var-decl name='vdpa_dev_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50304'>
        <var-decl name='extern_data' type-id='type-id-22' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50368'>
        <var-decl name='extern_ops' type-id='type-id-66' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='389' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_memory' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='105' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nregions' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='regions' type-id='type-id-68' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_mem_region' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='92' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guest_phys_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guest_user_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='host_user_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mmap_addr' type-id='type-id-22' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mmap_size' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='99' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='infinite' id='type-id-68'>
      <subrange length='infinite' type-id='type-id-18' id='type-id-70'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-58'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-72' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-73'/>
    <typedef-decl name='__int16_t' type-id='type-id-73' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-74'/>
    <typedef-decl name='int16_t' type-id='type-id-74' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-75'/>
    <qualified-type-def type-id='type-id-75' volatile='yes' id='type-id-72'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-71' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-59'/>
    <class-decl name='vhost_virtqueue' size-in-bits='6656' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='127' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='last_avail_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='last_used_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='signalled_used' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='signalled_used_valid' type-id='type-id-78' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='backend' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='enabled' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='access_ok' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='access_lock' type-id='type-id-65' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='callfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='kickfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='log_guest_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='resubmit_inflight' type-id='type-id-79' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='global_counter' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nr_zmbuf' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='zmbuf_size' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='last_zmbuf_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='zmbufs' type-id='type-id-80' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='zmbuf_list' type-id='type-id-81' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='shadow_used_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='shadow_aligned_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='shadow_last_used_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ring_addrs' type-id='type-id-82' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='batch_copy_elems' type-id='type-id-83' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='batch_copy_nb_elems' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='used_wrap_counter' type-id='type-id-78' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='avail_wrap_counter' type-id='type-id-78' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='log_cache' type-id='type-id-84' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='log_cache_nb_elem' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='iotlb_lock' type-id='type-id-85' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='iotlb_pending_lock' type-id='type-id-85' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='iotlb_pool' type-id='type-id-86' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='iotlb_list' type-id='type-id-87' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='iotlb_cache_nr' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='iotlb_pending_list' type-id='type-id-87' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='202' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='128' column='1' id='type-id-77'>
      <data-member access='private'>
        <var-decl name='desc' type-id='type-id-88' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='129' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='desc_packed' type-id='type-id-89' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='130' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='vring_desc' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='88' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-91' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-92' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-93' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='next' type-id='type-id-93' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-94'/>
    <typedef-decl name='__u64' type-id='type-id-94' filepath='/usr/local/include/asm-generic/int-ll64.h' line='31' column='1' id='type-id-95'/>
    <typedef-decl name='__virtio64' type-id='type-id-95' filepath='/usr/local/include/linux/virtio_types.h' line='44' column='1' id='type-id-91'/>
    <typedef-decl name='__u32' type-id='type-id-28' filepath='/usr/local/include/asm-generic/int-ll64.h' line='27' column='1' id='type-id-96'/>
    <typedef-decl name='__virtio32' type-id='type-id-96' filepath='/usr/local/include/linux/virtio_types.h' line='43' column='1' id='type-id-92'/>
    <typedef-decl name='__u16' type-id='type-id-14' filepath='/usr/local/include/asm-generic/int-ll64.h' line='24' column='1' id='type-id-97'/>
    <typedef-decl name='__virtio16' type-id='type-id-97' filepath='/usr/local/include/linux/virtio_types.h' line='42' column='1' id='type-id-93'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-88'/>
    <class-decl name='vring_packed_desc' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='203' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-99' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-100' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='id' type-id='type-id-101' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='flags' type-id='type-id-101' visibility='default' filepath='/usr/local/include/linux/virtio_ring.h' line='211' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__le64' type-id='type-id-95' filepath='/usr/local/include/linux/types.h' line='28' column='1' id='type-id-99'/>
    <typedef-decl name='__le32' type-id='type-id-96' filepath='/usr/local/include/linux/types.h' line='26' column='1' id='type-id-100'/>
    <typedef-decl name='__le16' type-id='type-id-97' filepath='/usr/local/include/linux/types.h' line='24' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-89'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-78'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-65' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='30' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-103' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-1' volatile='yes' id='type-id-103'/>
    <typedef-decl name='rte_spinlock_t' type-id='type-id-102' filepath='../lib/librte_eal/common/include/generic/rte_spinlock.h' line='32' column='1' id='type-id-65'/>
    <class-decl name='rte_vhost_resubmit_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='158' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resubmit_list' type-id='type-id-105' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resubmit_num' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_resubmit_desc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='153' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-79'/>
    <class-decl name='zcopy_mbuf' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='89' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mbuf' type-id='type-id-108' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc_idx' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='desc_count' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='in_use' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-109' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-111' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-22' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-113' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-20' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-111' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-30' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-20' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-111' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-86' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-108' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-16' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-30' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-114' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-115' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='infinite' id='type-id-116'>
      <subrange length='infinite' type-id='type-id-18' id='type-id-70'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-116' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-111'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-112'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-117' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-117' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_iova_t' type-id='type-id-20' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-117'/>

    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='infinite' id='type-id-118'>
      <subrange length='infinite' type-id='type-id-18' id='type-id-70'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-118' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-113'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-120' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-122' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-123' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-124' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-125' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-126' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='256' id='type-id-120'>
      <subrange length='32' type-id='type-id-18' id='type-id-127'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-121'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-20' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-120' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-130' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-123' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-30' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-129'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-131' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-117' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-20' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-131'/>
    <typedef-decl name='size_t' type-id='type-id-18' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-130'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-132'/>
    <typedef-decl name='int32_t' type-id='type-id-132' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-123'/>
    <qualified-type-def type-id='type-id-128' const='yes' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-122'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-135' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='98304' id='type-id-135'>
      <subrange length='1536' type-id='type-id-18' id='type-id-136'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-124'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-137' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-138' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-140' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-86' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-141' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-137' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-86'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-141'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-117' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-131' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-142' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-143' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-145' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-86' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-130' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-147' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-142' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-142'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-146'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-117' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-131' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-148' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-108'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-151' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-22' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-59' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-153' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-151'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-114'/>

    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='128' id='type-id-115'>
      <subrange length='2' type-id='type-id-18' id='type-id-154'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='95' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-80' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-155' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-155'/>
    <class-decl name='zcopy_mbuf_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='97' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-80' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-155' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vhost_vring_addr' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='30' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-28' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-28' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc_user_addr' type-id='type-id-95' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used_user_addr' type-id='type-id-95' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avail_user_addr' type-id='type-id-95' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='log_guest_addr' type-id='type-id-95' visibility='default' filepath='/usr/local/include/linux/vhost_types.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='batch_copy_elem' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='102' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dst' type-id='type-id-22' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src' type-id='type-id-22' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='log_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-83'/>
    <class-decl name='log_cache_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='112' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='val' type-id='type-id-18' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='114' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-157' size-in-bits='4096' id='type-id-84'>
      <subrange length='32' type-id='type-id-18' id='type-id-127'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-85' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='33' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-159' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-123' volatile='yes' id='type-id-159'/>
    <typedef-decl name='rte_rwlock_t' type-id='type-id-158' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='35' column='1' id='type-id-85'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='200' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-160' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-161' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vhost_iotlb_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-163'/>

    <array-type-def dimensions='1' type-id='type-id-163' size-in-bits='16384' id='type-id-60'>
      <subrange length='256' type-id='type-id-18' id='type-id-164'/>

    </array-type-def>
    <class-decl name='inflight_mem_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='334' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addr' type-id='type-id-22' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='337' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-61'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32768' id='type-id-62'>
      <subrange length='4096' type-id='type-id-18' id='type-id-166'/>

    </array-type-def>
    <class-decl name='rte_ether_addr' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='60' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr_bytes' type-id='type-id-167' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='61' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='48' id='type-id-167'>
      <subrange length='6' type-id='type-id-18' id='type-id-168'/>

    </array-type-def>
    <class-decl name='guest_page' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='328' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guest_phys_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='host_phys_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='331' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-64'/>
    <class-decl name='rte_vhost_user_extern_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='227' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pre_msg_handle' type-id='type-id-170' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='post_msg_handle' type-id='type-id-170' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='231' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_vhost_msg_result' filepath='../lib/librte_vhost/rte_vhost.h' line='197' column='1' id='type-id-171'>
      <underlying-type type-id='type-id-37'/>
      <enumerator name='RTE_VHOST_MSG_RESULT_ERR' value='-1'/>
      <enumerator name='RTE_VHOST_MSG_RESULT_OK' value='0'/>
      <enumerator name='RTE_VHOST_MSG_RESULT_REPLY' value='1'/>
      <enumerator name='RTE_VHOST_MSG_RESULT_NOT_HANDLED' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <typedef-decl name='rte_vhost_msg_handle' type-id='type-id-173' filepath='../lib/librte_vhost/rte_vhost.h' line='222' column='1' id='type-id-170'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-174'/>

    <array-type-def dimensions='1' type-id='type-id-174' size-in-bits='65536' id='type-id-175'>
      <subrange length='1024' type-id='type-id-18' id='type-id-176'/>

    </array-type-def>
    <var-decl name='vhost_devices' type-id='type-id-175' visibility='default' filepath='../lib/librte_vhost/vhost.h' line='533' column='1'/>
    <function-decl name='rte_vhost_rx_queue_count' mangled-name='rte_vhost_rx_queue_count' filepath='../lib/librte_vhost/vhost.c' line='1314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_rx_queue_count@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1314' column='1'/>
      <parameter type-id='type-id-16' name='qid' filepath='../lib/librte_vhost/vhost.c' line='1314' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='rte_vhost_log_used_vring' mangled-name='rte_vhost_log_used_vring' filepath='../lib/librte_vhost/vhost.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_log_used_vring@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1294' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='1294' column='1'/>
      <parameter type-id='type-id-20' name='offset' filepath='../lib/librte_vhost/vhost.c' line='1295' column='1'/>
      <parameter type-id='type-id-20' name='len' filepath='../lib/librte_vhost/vhost.c' line='1295' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='rte_vhost_log_write' mangled-name='rte_vhost_log_write' filepath='../lib/librte_vhost/vhost.c' line='1283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_log_write@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1283' column='1'/>
      <parameter type-id='type-id-20' name='addr' filepath='../lib/librte_vhost/vhost.c' line='1283' column='1'/>
      <parameter type-id='type-id-20' name='len' filepath='../lib/librte_vhost/vhost.c' line='1283' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='rte_vhost_enable_guest_notification' mangled-name='rte_vhost_enable_guest_notification' filepath='../lib/librte_vhost/vhost.c' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_enable_guest_notification@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1259' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/vhost.c' line='1259' column='1'/>
      <parameter type-id='type-id-1' name='enable' filepath='../lib/librte_vhost/vhost.c' line='1259' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_avail_entries' mangled-name='rte_vhost_avail_entries' filepath='../lib/librte_vhost/vhost.c' line='1188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_avail_entries@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1188' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/vhost.c' line='1188' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rte_vhost_vring_call' mangled-name='rte_vhost_vring_call' filepath='../lib/librte_vhost/vhost.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_vring_call@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1163' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='1163' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_vhost_vring' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='172' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='log_guest_addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='callfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='kickfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='size' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='191' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <function-decl name='rte_vhost_get_vhost_vring' mangled-name='rte_vhost_get_vhost_vring' filepath='../lib/librte_vhost/vhost.c' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_vhost_vring@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='819' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='819' column='1'/>
      <parameter type-id='type-id-178' name='vring' filepath='../lib/librte_vhost/vhost.c' line='820' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-179'/>
    <function-decl name='rte_vhost_get_mem_table' mangled-name='rte_vhost_get_mem_table' filepath='../lib/librte_vhost/vhost.c' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_mem_table@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='796' column='1'/>
      <parameter type-id='type-id-179' name='mem' filepath='../lib/librte_vhost/vhost.c' line='796' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_get_negotiated_features' mangled-name='rte_vhost_get_negotiated_features' filepath='../lib/librte_vhost/vhost.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_negotiated_features@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='783' column='1'/>
      <parameter type-id='type-id-27' name='features' filepath='../lib/librte_vhost/vhost.c' line='783' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-180'/>
    <function-decl name='rte_vhost_get_ifname' mangled-name='rte_vhost_get_ifname' filepath='../lib/librte_vhost/vhost.c' line='767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_ifname@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='767' column='1'/>
      <parameter type-id='type-id-180' name='buf' filepath='../lib/librte_vhost/vhost.c' line='767' column='1'/>
      <parameter type-id='type-id-130' name='len' filepath='../lib/librte_vhost/vhost.c' line='767' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_get_vring_num' mangled-name='rte_vhost_get_vring_num' filepath='../lib/librte_vhost/vhost.c' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_vring_num@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='756' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rte_vhost_get_queue_num' mangled-name='rte_vhost_get_queue_num' filepath='../lib/librte_vhost/vhost.c' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_queue_num@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='745' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='rte_vhost_get_numa_node' mangled-name='rte_vhost_get_numa_node' filepath='../lib/librte_vhost/vhost.c' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_numa_node@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='718' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-181'/>
    <function-decl name='rte_vhost_get_mtu' mangled-name='rte_vhost_get_mtu' filepath='../lib/librte_vhost/vhost.c' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_mtu@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='699' column='1'/>
      <parameter type-id='type-id-181' name='mtu' filepath='../lib/librte_vhost/vhost.c' line='699' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_get_vdpa_device_id' mangled-name='rte_vhost_get_vdpa_device_id' filepath='../lib/librte_vhost/vhost.c' line='1346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_vdpa_device_id@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1346' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-183' const='yes' id='type-id-184'/>
    <function-decl name='rte_vhost_extern_callback_register' mangled-name='rte_vhost_extern_callback_register' filepath='../lib/librte_vhost/vhost.c' line='1448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_extern_callback_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1448' column='1'/>
      <parameter type-id='type-id-184' name='ops' filepath='../lib/librte_vhost/vhost.c' line='1449' column='1'/>
      <parameter type-id='type-id-22' name='ctx' filepath='../lib/librte_vhost/vhost.c' line='1449' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_set_vring_base' mangled-name='rte_vhost_set_vring_base' filepath='../lib/librte_vhost/vhost.c' line='1396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_set_vring_base@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1396' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/vhost.c' line='1396' column='1'/>
      <parameter type-id='type-id-16' name='last_avail_idx' filepath='../lib/librte_vhost/vhost.c' line='1397' column='1'/>
      <parameter type-id='type-id-16' name='last_used_idx' filepath='../lib/librte_vhost/vhost.c' line='1397' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_get_vring_base_from_inflight' mangled-name='rte_vhost_get_vring_base_from_inflight' filepath='../lib/librte_vhost/vhost.c' line='1423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_vring_base_from_inflight@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1423' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/vhost.c' line='1424' column='1'/>
      <parameter type-id='type-id-181' name='last_avail_idx' filepath='../lib/librte_vhost/vhost.c' line='1425' column='1'/>
      <parameter type-id='type-id-181' name='last_used_idx' filepath='../lib/librte_vhost/vhost.c' line='1426' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_get_vring_base' mangled-name='rte_vhost_get_vring_base' filepath='../lib/librte_vhost/vhost.c' line='1370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_vring_base@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1423' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/vhost.c' line='1424' column='1'/>
      <parameter type-id='type-id-181' name='last_avail_idx' filepath='../lib/librte_vhost/vhost.c' line='1425' column='1'/>
      <parameter type-id='type-id-181' name='last_used_idx' filepath='../lib/librte_vhost/vhost.c' line='1426' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_get_log_base' mangled-name='rte_vhost_get_log_base' filepath='../lib/librte_vhost/vhost.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_log_base@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1356' column='1'/>
      <parameter type-id='type-id-27' name='log_base' filepath='../lib/librte_vhost/vhost.c' line='1356' column='1'/>
      <parameter type-id='type-id-27' name='log_size' filepath='../lib/librte_vhost/vhost.c' line='1357' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_clr_inflight_desc_packed' mangled-name='rte_vhost_clr_inflight_desc_packed' filepath='../lib/librte_vhost/vhost.c' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_clr_inflight_desc_packed@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1035' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='1035' column='1'/>
      <parameter type-id='type-id-16' name='head' filepath='../lib/librte_vhost/vhost.c' line='1036' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_clr_inflight_desc_split' mangled-name='rte_vhost_clr_inflight_desc_split' filepath='../lib/librte_vhost/vhost.c' line='994' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_clr_inflight_desc_split@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='994' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='994' column='1'/>
      <parameter type-id='type-id-16' name='last_used_idx' filepath='../lib/librte_vhost/vhost.c' line='995' column='1'/>
      <parameter type-id='type-id-16' name='idx' filepath='../lib/librte_vhost/vhost.c' line='995' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_set_last_inflight_io_packed' mangled-name='rte_vhost_set_last_inflight_io_packed' filepath='../lib/librte_vhost/vhost.c' line='1113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_set_last_inflight_io_packed@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1113' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='1113' column='1'/>
      <parameter type-id='type-id-16' name='head' filepath='../lib/librte_vhost/vhost.c' line='1114' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_set_last_inflight_io_split' mangled-name='rte_vhost_set_last_inflight_io_split' filepath='../lib/librte_vhost/vhost.c' line='1081' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_set_last_inflight_io_split@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1081' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='1081' column='1'/>
      <parameter type-id='type-id-16' name='idx' filepath='../lib/librte_vhost/vhost.c' line='1082' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_set_inflight_desc_packed' mangled-name='rte_vhost_set_inflight_desc_packed' filepath='../lib/librte_vhost/vhost.c' line='926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_set_inflight_desc_packed@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='926' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='926' column='1'/>
      <parameter type-id='type-id-16' name='head' filepath='../lib/librte_vhost/vhost.c' line='927' column='1'/>
      <parameter type-id='type-id-16' name='last' filepath='../lib/librte_vhost/vhost.c' line='927' column='1'/>
      <parameter type-id='type-id-181' name='inflight_entry' filepath='../lib/librte_vhost/vhost.c' line='928' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_set_inflight_desc_split' mangled-name='rte_vhost_set_inflight_desc_split' filepath='../lib/librte_vhost/vhost.c' line='890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_set_inflight_desc_split@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='1081' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='1081' column='1'/>
      <parameter type-id='type-id-16' name='idx' filepath='../lib/librte_vhost/vhost.c' line='1082' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_vhost_ring_inflight' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='163' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resubmit_inflight' type-id='type-id-79' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='164' column='1' id='type-id-186'>
      <data-member access='private'>
        <var-decl name='inflight_split' type-id='type-id-187' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='165' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='inflight_packed' type-id='type-id-188' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='166' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_vhost_inflight_info_split' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='117' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='features' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='version' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='desc_num' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='last_inflight_io' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='used_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='desc' type-id='type-id-190' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_inflight_desc_split' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='110' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inflight' type-id='type-id-42' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='padding' type-id='type-id-192' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='next' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='114' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='40' id='type-id-192'>
      <subrange length='5' type-id='type-id-18' id='type-id-54'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-191' size-in-bits='infinite' id='type-id-190'>
      <subrange length='infinite' type-id='type-id-18' id='type-id-70'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-187'/>
    <class-decl name='rte_vhost_inflight_info_packed' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='139' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='features' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='version' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='desc_num' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='free_head' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='old_free_head' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='old_used_idx' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='used_wrap_counter' type-id='type-id-42' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='old_used_wrap_counter' type-id='type-id-42' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='padding' type-id='type-id-194' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='desc' type-id='type-id-195' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='150' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='56' id='type-id-194'>
      <subrange length='7' type-id='type-id-18' id='type-id-196'/>

    </array-type-def>
    <class-decl name='rte_vhost_inflight_desc_packed' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='126' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inflight' type-id='type-id-42' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='padding' type-id='type-id-42' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='next' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='last' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='num' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='flags' type-id='type-id-16' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='len' type-id='type-id-30' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='addr' type-id='type-id-20' visibility='default' filepath='../lib/librte_vhost/rte_vhost.h' line='136' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-197' size-in-bits='infinite' id='type-id-195'>
      <subrange length='infinite' type-id='type-id-18' id='type-id-70'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-198'/>
    <function-decl name='rte_vhost_get_vhost_ring_inflight' mangled-name='rte_vhost_get_vhost_ring_inflight' filepath='../lib/librte_vhost/vhost.c' line='855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_get_vhost_ring_inflight@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost.c' line='855' column='1'/>
      <parameter type-id='type-id-16' name='vring_idx' filepath='../lib/librte_vhost/vhost.c' line='855' column='1'/>
      <parameter type-id='type-id-198' name='vring' filepath='../lib/librte_vhost/vhost.c' line='856' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-171'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-12'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-152'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-12'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_vhost/vhost_user.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_vhost_host_notifier_ctrl' mangled-name='rte_vhost_host_notifier_ctrl' filepath='../lib/librte_vhost/vhost_user.c' line='2877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_host_notifier_ctrl@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost_user.c' line='2877' column='1'/>
      <parameter type-id='type-id-78' name='enable' filepath='../lib/librte_vhost/vhost_user.c' line='2877' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_vhost/virtio_net.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-199'/>
    <function-decl name='rte_vhost_dequeue_burst' mangled-name='rte_vhost_dequeue_burst' filepath='../lib/librte_vhost/virtio_net.c' line='2175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_dequeue_burst@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/virtio_net.c' line='2175' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/virtio_net.c' line='2175' column='1'/>
      <parameter type-id='type-id-86' name='mbuf_pool' filepath='../lib/librte_vhost/virtio_net.c' line='2176' column='1'/>
      <parameter type-id='type-id-199' name='pkts' filepath='../lib/librte_vhost/virtio_net.c' line='2176' column='1'/>
      <parameter type-id='type-id-16' name='count' filepath='../lib/librte_vhost/virtio_net.c' line='2176' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rte_vhost_enqueue_burst' mangled-name='rte_vhost_enqueue_burst' filepath='../lib/librte_vhost/virtio_net.c' line='1236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_enqueue_burst@@DPDK_20.0'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/virtio_net.c' line='1236' column='1'/>
      <parameter type-id='type-id-16' name='queue_id' filepath='../lib/librte_vhost/virtio_net.c' line='1236' column='1'/>
      <parameter type-id='type-id-199' name='pkts' filepath='../lib/librte_vhost/virtio_net.c' line='1237' column='1'/>
      <parameter type-id='type-id-16' name='count' filepath='../lib/librte_vhost/virtio_net.c' line='1237' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_vhost/vhost_crypto.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_crypto_op' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='78' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mempool' type-id='type-id-86' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='phys_addr' type-id='type-id-117' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='80' column='1' id='type-id-201'>
      <data-member access='private'>
        <var-decl name='raw' type-id='type-id-20' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='81' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-202' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='83' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-42' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='status' type-id='type-id-42' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sess_type' type-id='type-id-42' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='type-id-203' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='private_data_offset' type-id='type-id-16' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto.h' line='100' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='24' id='type-id-203'>
      <subrange length='3' type-id='type-id-18' id='type-id-204'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-207'/>
    <function-decl name='rte_vhost_crypto_finalize_requests' mangled-name='rte_vhost_crypto_finalize_requests' filepath='../lib/librte_vhost/vhost_crypto.c' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_crypto_finalize_requests@@EXPERIMENTAL'>
      <parameter type-id='type-id-206' name='ops' filepath='../lib/librte_vhost/vhost_crypto.c' line='1638' column='1'/>
      <parameter type-id='type-id-16' name='nb_ops' filepath='../lib/librte_vhost/vhost_crypto.c' line='1639' column='1'/>
      <parameter type-id='type-id-207' name='callfds' filepath='../lib/librte_vhost/vhost_crypto.c' line='1639' column='1'/>
      <parameter type-id='type-id-181' name='nb_callfds' filepath='../lib/librte_vhost/vhost_crypto.c' line='1639' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rte_vhost_crypto_fetch_requests' mangled-name='rte_vhost_crypto_fetch_requests' filepath='../lib/librte_vhost/vhost_crypto.c' line='1528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_crypto_fetch_requests@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost_crypto.c' line='1528' column='1'/>
      <parameter type-id='type-id-30' name='qid' filepath='../lib/librte_vhost/vhost_crypto.c' line='1528' column='1'/>
      <parameter type-id='type-id-206' name='ops' filepath='../lib/librte_vhost/vhost_crypto.c' line='1529' column='1'/>
      <parameter type-id='type-id-16' name='nb_ops' filepath='../lib/librte_vhost/vhost_crypto.c' line='1529' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <enum-decl name='rte_vhost_crypto_zero_copy' filepath='../lib/librte_vhost/rte_vhost_crypto.h' line='14' column='1' id='type-id-208'>
      <underlying-type type-id='type-id-37'/>
      <enumerator name='RTE_VHOST_CRYPTO_ZERO_COPY_DISABLE' value='0'/>
      <enumerator name='RTE_VHOST_CRYPTO_ZERO_COPY_ENABLE' value='1'/>
      <enumerator name='RTE_VHOST_CRYPTO_MAX_ZERO_COPY_OPTIONS' value='2'/>
    </enum-decl>
    <function-decl name='rte_vhost_crypto_set_zero_copy' mangled-name='rte_vhost_crypto_set_zero_copy' filepath='../lib/librte_vhost/vhost_crypto.c' line='1473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_crypto_set_zero_copy@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost_crypto.c' line='1473' column='1'/>
      <parameter type-id='type-id-208' name='option' filepath='../lib/librte_vhost/vhost_crypto.c' line='1473' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_vhost_crypto_free' mangled-name='rte_vhost_crypto_free' filepath='../lib/librte_vhost/vhost_crypto.c' line='1444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vhost_crypto_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-1' name='vid' filepath='../lib/librte_vhost/vhost_crypto.c' line='1444' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
