<abi-corpus path='gcc//lib/librte_hash.so.20.0' architecture='elf-amd-x86_64' soname='librte_hash.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_fbk_hash_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fbk_hash_find_existing' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fbk_hash_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_add_key' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_add_key_data' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_add_key_with_hash' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_add_key_with_hash_data' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_count' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_del_key' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_del_key_with_hash' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_find_existing' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_free_key_with_position' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_get_key_with_position' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_hash' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_iterate' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_lookup' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_lookup_bulk' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_lookup_bulk_data' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_lookup_data' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_lookup_with_hash' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_lookup_with_hash_data' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_reset' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_hash_set_cmp_func' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_hash/rte_cuckoo_hash.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-2'/>
    <typedef-decl name='int32_t' type-id='type-id-2' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-3'/>
    <class-decl name='rte_hash' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='160' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entries' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='num_buckets' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_slots' type-id='type-id-7' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='local_free_slots' type-id='type-id-8' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='key_len' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='hw_trans_mem_support' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='552'>
        <var-decl name='use_local_cache' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='readwrite_concur_support' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='568'>
        <var-decl name='ext_table_support' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='no_free_on_del' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='readwrite_concur_lf_support' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='writer_takes_lock' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='hash_func' type-id='type-id-10' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='hash_func_init_val' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='rte_hash_custom_cmp_eq' type-id='type-id-11' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cmp_jump_table_idx' type-id='type-id-12' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='sig_cmp_fn' type-id='type-id-13' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bucket_bitmask' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='key_entry_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='key_store' type-id='type-id-14' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='buckets' type-id='type-id-15' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='readwrite_lock' type-id='type-id-16' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='buckets_ext' type-id='type-id-15' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='free_ext_bkts' type-id='type-id-7' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ext_bkt_to_free' type-id='type-id-17' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tbl_chng_cnt' type-id='type-id-17' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='221' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-18'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='256' id='type-id-5'>
      <subrange length='32' type-id='type-id-19' id='type-id-20'/>

    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-21'/>
    <typedef-decl name='__uint32_t' type-id='type-id-21' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-22'/>
    <typedef-decl name='uint32_t' type-id='type-id-22' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-6'/>
    <class-decl name='rte_ring' size-in-bits='3072' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='81' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-1' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memzone' type-id='type-id-24' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='size' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mask' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='capacity' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pad0' type-id='type-id-18' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='prod' type-id='type-id-25' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='pad1' type-id='type-id-18' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='cons' type-id='type-id-25' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad2' type-id='type-id-18' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-29' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-27'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-30' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-32'/>
    <typedef-decl name='uint64_t' type-id='type-id-32' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-29'/>
    <typedef-decl name='phys_addr_t' type-id='type-id-29' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-30'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-29' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-31'/>
    <typedef-decl name='size_t' type-id='type-id-19' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-28'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-24'/>
    <class-decl name='rte_ring_headtail' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='65' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-34' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tail' type-id='type-id-34' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='single' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-6' volatile='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-7'/>
    <class-decl name='lcore_cache' size-in-bits='4608' is-struct='yes' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='125' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-21' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='objs' type-id='type-id-36' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-37'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-14'/>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='4096' id='type-id-36'>
      <subrange length='64' type-id='type-id-19' id='type-id-38'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-8'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-39'/>
    <typedef-decl name='__uint8_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-40'/>
    <typedef-decl name='uint8_t' type-id='type-id-40' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <typedef-decl name='rte_hash_function' type-id='type-id-42' filepath='../lib/librte_hash/rte_hash.h' line='66' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <typedef-decl name='rte_hash_cmp_eq_t' type-id='type-id-44' filepath='../lib/librte_hash/rte_hash.h' line='70' column='1' id='type-id-11'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-45'/>
    <enum-decl name='cmp_jump_table_case' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='51' column='1' id='type-id-12'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='KEY_CUSTOM' value='0'/>
      <enumerator name='KEY_16_BYTES' value='1'/>
      <enumerator name='KEY_32_BYTES' value='2'/>
      <enumerator name='KEY_48_BYTES' value='3'/>
      <enumerator name='KEY_64_BYTES' value='4'/>
      <enumerator name='KEY_80_BYTES' value='5'/>
      <enumerator name='KEY_96_BYTES' value='6'/>
      <enumerator name='KEY_112_BYTES' value='7'/>
      <enumerator name='KEY_128_BYTES' value='8'/>
      <enumerator name='KEY_OTHER_BYTES' value='9'/>
      <enumerator name='NUM_KEY_CMP_CASES' value='10'/>
    </enum-decl>
    <enum-decl name='rte_hash_sig_compare_function' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='141' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='RTE_HASH_COMPARE_SCALAR' value='0'/>
      <enumerator name='RTE_HASH_COMPARE_SSE' value='1'/>
      <enumerator name='RTE_HASH_COMPARE_NEON' value='2'/>
      <enumerator name='RTE_HASH_COMPARE_NUM' value='3'/>
    </enum-decl>
    <class-decl name='rte_hash_bucket' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='149' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sig_current' type-id='type-id-47' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_idx' type-id='type-id-48' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='flag' type-id='type-id-49' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next' type-id='type-id-14' visibility='default' filepath='../lib/librte_hash/rte_cuckoo_hash.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-50'/>
    <typedef-decl name='__uint16_t' type-id='type-id-50' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-51'/>
    <typedef-decl name='uint16_t' type-id='type-id-51' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-52'/>

    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='128' id='type-id-47'>
      <subrange length='8' type-id='type-id-19' id='type-id-53'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='256' id='type-id-48'>
      <subrange length='8' type-id='type-id-19' id='type-id-53'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='64' id='type-id-49'>
      <subrange length='8' type-id='type-id-19' id='type-id-53'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-15'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-54' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='33' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-3' volatile='yes' id='type-id-56'/>
    <typedef-decl name='rte_rwlock_t' type-id='type-id-55' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='35' column='1' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-17'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-57'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-59'/>
    <function-decl name='rte_hash_iterate' mangled-name='rte_hash_iterate' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_iterate@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2154' column='1'/>
      <parameter type-id='type-id-59' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2154' column='1'/>
      <parameter type-id='type-id-59' name='data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2154' column='1'/>
      <parameter type-id='type-id-17' name='next' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2154' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-60'/>
    <function-decl name='rte_hash_lookup_bulk_data' mangled-name='rte_hash_lookup_bulk_data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_lookup_bulk_data@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2138' column='1'/>
      <parameter type-id='type-id-59' name='keys' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2138' column='1'/>
      <parameter type-id='type-id-6' name='num_keys' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2139' column='1'/>
      <parameter type-id='type-id-60' name='hit_mask' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2139' column='1'/>
      <parameter type-id='type-id-59' name='data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2139' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-61'/>
    <function-decl name='rte_hash_lookup_bulk' mangled-name='rte_hash_lookup_bulk' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_lookup_bulk@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2126' column='1'/>
      <parameter type-id='type-id-59' name='keys' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2126' column='1'/>
      <parameter type-id='type-id-6' name='num_keys' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2127' column='1'/>
      <parameter type-id='type-id-61' name='positions' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='2127' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-62'/>
    <function-decl name='rte_hash_get_key_with_position' mangled-name='rte_hash_get_key_with_position' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_get_key_with_position@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1576' column='1'/>
      <parameter type-id='type-id-62' name='position' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1576' column='1'/>
      <parameter type-id='type-id-59' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1577' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_hash_del_key' mangled-name='rte_hash_del_key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_del_key@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='hash_sig_t' type-id='type-id-6' filepath='../lib/librte_hash/rte_hash.h' line='63' column='1' id='type-id-63'/>
    <function-decl name='rte_hash_del_key_with_hash' mangled-name='rte_hash_del_key_with_hash' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_del_key_with_hash@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1561' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1562' column='1'/>
      <parameter type-id='type-id-63' name='sig' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1562' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_hash_lookup_data' mangled-name='rte_hash_lookup_data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_lookup_data@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1358' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1358' column='1'/>
      <parameter type-id='type-id-59' name='data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1358' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_hash_lookup_with_hash_data' mangled-name='rte_hash_lookup_with_hash_data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_lookup_with_hash_data@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1350' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1351' column='1'/>
      <parameter type-id='type-id-63' name='sig' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1351' column='1'/>
      <parameter type-id='type-id-59' name='data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1351' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_hash_lookup' mangled-name='rte_hash_lookup' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_lookup@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_hash_lookup_with_hash' mangled-name='rte_hash_lookup_with_hash' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_lookup_with_hash@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1561' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1562' column='1'/>
      <parameter type-id='type-id-63' name='sig' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1562' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_hash_add_key_data' mangled-name='rte_hash_add_key_data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_add_key_data@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1138' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1138' column='1'/>
      <parameter type-id='type-id-14' name='data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1138' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_hash_add_key_with_hash_data' mangled-name='rte_hash_add_key_with_hash_data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_add_key_with_hash_data@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1124' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1125' column='1'/>
      <parameter type-id='type-id-63' name='sig' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1125' column='1'/>
      <parameter type-id='type-id-14' name='data' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1125' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_hash_add_key' mangled-name='rte_hash_add_key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_add_key@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1569' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_hash_add_key_with_hash' mangled-name='rte_hash_add_key_with_hash' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_add_key_with_hash@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1561' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1562' column='1'/>
      <parameter type-id='type-id-63' name='sig' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1562' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-64'/>
    <function-decl name='rte_hash_reset' mangled-name='rte_hash_reset' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_reset@@DPDK_20.0'>
      <parameter type-id='type-id-64' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='571' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='rte_hash_count' mangled-name='rte_hash_count' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_count@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='510' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_hash_hash' mangled-name='rte_hash_hash' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_hash@@DPDK_20.0'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='503' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='503' column='1'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-decl name='rte_hash_free' mangled-name='rte_hash_free' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_free@@DPDK_20.0'>
      <parameter type-id='type-id-64' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='460' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <class-decl name='rte_hash_parameters' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='75' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-66' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_len' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_func' type-id='type-id-10' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hash_func_init_val' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='extra_flag' type-id='type-id-9' visibility='default' filepath='../lib/librte_hash/rte_hash.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-66'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <function-decl name='rte_hash_create' mangled-name='rte_hash_create' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_create@@DPDK_20.0'>
      <parameter type-id='type-id-69' name='params' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='125' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='rte_hash_set_cmp_func' mangled-name='rte_hash_set_cmp_func' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_set_cmp_func@@DPDK_20.0'>
      <parameter type-id='type-id-64' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='79' column='1'/>
      <parameter type-id='type-id-11' name='func' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='79' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='rte_hash_find_existing' mangled-name='rte_hash_find_existing' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_find_existing@@DPDK_20.0'>
      <parameter type-id='type-id-66' name='name' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='48' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='rte_hash_free_key_with_position' mangled-name='rte_hash_free_key_with_position' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hash_free_key_with_position@@EXPERIMENTAL'>
      <parameter type-id='type-id-58' name='h' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1596' column='1'/>
      <parameter type-id='type-id-62' name='position' filepath='../lib/librte_hash/rte_cuckoo_hash.c' line='1597' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-41'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_hash/rte_fbk_hash.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_fbk_hash_table' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='71' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entries' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='entries_per_bucket' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='used_entries' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='bucket_mask' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bucket_shift' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hash_func' type-id='type-id-71' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='init_val' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='t' type-id='type-id-72' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='rte_fbk_hash_fn' type-id='type-id-74' filepath='../lib/librte_hash/rte_fbk_hash.h' line='47' column='1' id='type-id-71'/>
    <union-decl name='rte_fbk_hash_entry' size-in-bits='64' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='60' column='1' id='type-id-75'>
      <data-member access='private'>
        <var-decl name='whole_entry' type-id='type-id-29' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='61' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='entry' type-id='type-id-76' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='66' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='62' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='is_entry' type-id='type-id-52' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='value' type-id='type-id-52' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='key' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='65' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-75' size-in-bits='infinite' id='type-id-72'>
      <subrange length='infinite' type-id='type-id-19' id='type-id-77'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-78'/>
    <function-decl name='rte_fbk_hash_free' mangled-name='rte_fbk_hash_free' filepath='../lib/librte_hash/rte_fbk_hash.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbk_hash_free@@DPDK_20.0'>
      <parameter type-id='type-id-78' name='ht' filepath='../lib/librte_hash/rte_fbk_hash.c' line='181' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <class-decl name='rte_fbk_hash_params' size-in-bits='320' is-struct='yes' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='50' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-66' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='entries_per_bucket' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_func' type-id='type-id-71' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='init_val' type-id='type-id-6' visibility='default' filepath='../lib/librte_hash/rte_fbk_hash.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <function-decl name='rte_fbk_hash_create' mangled-name='rte_fbk_hash_create' filepath='../lib/librte_hash/rte_fbk_hash.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbk_hash_create@@DPDK_20.0'>
      <parameter type-id='type-id-81' name='params' filepath='../lib/librte_hash/rte_fbk_hash.c' line='79' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='rte_fbk_hash_find_existing' mangled-name='rte_fbk_hash_find_existing' filepath='../lib/librte_hash/rte_fbk_hash.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbk_hash_find_existing@@DPDK_20.0'>
      <parameter type-id='type-id-66' name='name' filepath='../lib/librte_hash/rte_fbk_hash.c' line='45' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-73'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
</abi-corpus>
