<abi-corpus path='gcc//lib/librte_eal.so.20.0' architecture='elf-amd-x86_64' soname='librte_eal.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='__rte_panic' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='eal_parse_sysfs_value' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bus_dump' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bus_find' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_bus_find_by_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rte_uuid_unparse' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_clear_group' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_container_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_container_destroy' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_container_dma_map' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_container_dma_unmap' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_container_group_bind' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_container_group_unbind' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_enable' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_get_container_fd' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_get_group_fd' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_get_group_num' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_is_enabled' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_noiommu_is_enabled' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_release_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vfio_setup_device' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_vlog' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_zmalloc' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_zmalloc_socket' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='eal_timer_source' size='4' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='per_lcore__lcore_id' size='4' version='DPDK_20.0' is-default-version='yes' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='per_lcore__rte_errno' size='4' version='DPDK_20.0' is-default-version='yes' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_cycles_vmware_tsc_map' size='4' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_delay_us' size='8' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_logs' size='32' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_rtm_supported' size='1' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_bus.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-1'/>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-2'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <function-decl name='rte_bus_get_iommu_class' mangled-name='rte_bus_get_iommu_class' filepath='../lib/librte_eal/common/eal_common_bus.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_get_iommu_class@@DPDK_20.0'>
      <return type-id='type-id-2'/>
    </function-decl>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-4' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-8' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-9' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-11' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-14' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-15' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-16' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-17' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-20'/>
    <type-decl name='char' size-in-bits='8' id='type-id-21'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-5'/>
    <type-decl name='int' size-in-bits='32' id='type-id-23'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-25' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-6'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-25' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-7'/>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-27' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-29' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-30' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-32' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-32'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-34' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-35' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-36' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-36'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-29'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-30'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <type-decl name='void' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-45' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-46'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-48' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-8'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-50' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-9'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-50' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-52' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-11'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='__uint64_t' type-id='type-id-53' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-54'/>
    <typedef-decl name='uint64_t' type-id='type-id-54' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-55'/>
    <typedef-decl name='size_t' type-id='type-id-53' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-56'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-12'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-58' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-13'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-59' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-59'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-61' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-15'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-31' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' size-in-bits='256' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-64'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-63'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-68' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-16'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-50' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-17'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-70' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-18'/>
    <function-decl name='rte_bus_find_by_name' mangled-name='rte_bus_find_by_name' filepath='../lib/librte_eal/common/eal_common_bus.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_find_by_name@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='busname' filepath='../lib/librte_eal/common/eal_common_bus.c' line='170' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_bus_find_by_device' mangled-name='rte_bus_find_by_device' filepath='../lib/librte_eal/common/eal_common_bus.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_find_by_device@@DPDK_20.0'>
      <parameter type-id='type-id-41' name='dev' filepath='../lib/librte_eal/common/eal_common_bus.c' line='156' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
    <typedef-decl name='rte_bus_cmp_t' type-id='type-id-72' filepath='../lib/librte_eal/common/include/rte_bus.h' line='327' column='1' id='type-id-73'/>
    <function-decl name='rte_bus_find' mangled-name='rte_bus_find' filepath='../lib/librte_eal/common/eal_common_bus.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_find@@DPDK_20.0'>
      <parameter type-id='type-id-29' name='start' filepath='../lib/librte_eal/common/eal_common_bus.c' line='121' column='1'/>
      <parameter type-id='type-id-73' name='cmp' filepath='../lib/librte_eal/common/eal_common_bus.c' line='121' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='../lib/librte_eal/common/eal_common_bus.c' line='122' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-76' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-78' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-83' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-56' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-86' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-75'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-77'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-88'/>
    <typedef-decl name='__off_t' type-id='type-id-88' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-78'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-79'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-80'/>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='8' id='type-id-81'>
      <subrange length='1' type-id='type-id-53' id='type-id-89'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-42' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-90'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-82'/>
    <typedef-decl name='__off64_t' type-id='type-id-88' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-83'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-91'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-84'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-85'/>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='160' id='type-id-86'>
      <subrange length='20' type-id='type-id-53' id='type-id-93'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-74' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <function-decl name='rte_bus_dump' mangled-name='rte_bus_dump' filepath='../lib/librte_eal/common/eal_common_bus.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_dump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_bus.c' line='105' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_bus_probe' mangled-name='rte_bus_probe' filepath='../lib/librte_eal/common/eal_common_bus.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_probe@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_bus_scan' mangled-name='rte_bus_scan' filepath='../lib/librte_eal/common/eal_common_bus.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_scan@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_bus_unregister' mangled-name='rte_bus_unregister' filepath='../lib/librte_eal/common/eal_common_bus.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='bus' filepath='../lib/librte_eal/common/eal_common_bus.c' line='36' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_bus_register' mangled-name='rte_bus_register' filepath='../lib/librte_eal/common/eal_common_bus.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_bus_register@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='bus' filepath='../lib/librte_eal/common/eal_common_bus.c' line='20' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-60'>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-24'>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-51'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-71'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-44'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-49'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-57'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-69'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-47'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-67'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-43'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_cpuflags.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_cpu_is_supported' mangled-name='rte_cpu_is_supported' filepath='../lib/librte_eal/common/eal_common_cpuflags.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_cpu_is_supported@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_class.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_class' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='35' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-96' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_iterate' type-id='type-id-16' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-97' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-97'/>
    <function-decl name='rte_class_unregister' mangled-name='rte_class_unregister' filepath='../lib/librte_eal/common/eal_common_class.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_class_unregister@@EXPERIMENTAL'>
      <parameter type-id='type-id-63' name='class' filepath='../lib/librte_eal/common/eal_common_class.c' line='26' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_class_register' mangled-name='rte_class_register' filepath='../lib/librte_eal/common/eal_common_class.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_class_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-63' name='class' filepath='../lib/librte_eal/common/eal_common_class.c' line='16' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_class_find_by_name' mangled-name='rte_class_find_by_name' filepath='../lib/librte_eal/common/eal_common_class.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_class_find_by_name@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_class.c' line='59' column='1'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <qualified-type-def type-id='type-id-64' const='yes' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <typedef-decl name='rte_class_cmp_t' type-id='type-id-101' filepath='../lib/librte_eal/common/include/rte_class.h' line='56' column='1' id='type-id-102'/>
    <function-decl name='rte_class_find' mangled-name='rte_class_find' filepath='../lib/librte_eal/common/eal_common_class.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_class_find@@EXPERIMENTAL'>
      <parameter type-id='type-id-99' name='start' filepath='../lib/librte_eal/common/eal_common_class.c' line='33' column='1'/>
      <parameter type-id='type-id-102' name='cmp' filepath='../lib/librte_eal/common/eal_common_class.c' line='33' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='../lib/librte_eal/common/eal_common_class.c' line='34' column='1'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_devargs.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-103' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-104' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-105' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-106' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-30' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-108' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-108'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-104'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-105'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='512' id='type-id-106'>
      <subrange length='64' type-id='type-id-53' id='type-id-109'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-107'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-75' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <function-decl name='rte_devargs_next' mangled-name='rte_devargs_next' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_next@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='busname' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='388' column='1'/>
      <parameter type-id='type-id-111' name='start' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='388' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='rte_devargs_dump' mangled-name='rte_devargs_dump' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_dump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='374' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-112'/>
    <function-decl name='rte_devargs_type_count' mangled-name='rte_devargs_type_count' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_type_count@@DPDK_20.0'>
      <parameter type-id='type-id-104' name='devtype' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='359' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_devargs_remove' mangled-name='rte_devargs_remove' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_remove@@DPDK_20.0'>
      <parameter type-id='type-id-30' name='devargs' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='337' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_devargs_add' mangled-name='rte_devargs_add' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_add@@DPDK_20.0'>
      <parameter type-id='type-id-104' name='devtype' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='301' column='1'/>
      <parameter type-id='type-id-5' name='devargs_str' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='301' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_devargs_insert' mangled-name='rte_devargs_insert' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_insert@@DPDK_20.0'>
      <parameter type-id='type-id-108' name='da' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='264' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_devargs_parsef' mangled-name='rte_devargs_parsef' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_parsef@@DPDK_20.0'>
      <parameter type-id='type-id-30' name='da' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='233' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='233' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_devargs_parse' mangled-name='rte_devargs_parse' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_devargs_parse@@DPDK_20.0'>
      <parameter type-id='type-id-30' name='da' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='178' column='1'/>
      <parameter type-id='type-id-5' name='dev' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='178' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_dev.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_dev_remove' mangled-name='rte_dev_remove' filepath='../lib/librte_eal/common/eal_common_dev.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_remove@@DPDK_20.0'>
      <parameter type-id='type-id-31' name='dev' filepath='../lib/librte_eal/common/eal_common_dev.c' line='332' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_hotplug_remove' mangled-name='rte_eal_hotplug_remove' filepath='../lib/librte_eal/common/eal_common_dev.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_hotplug_remove@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='busname' filepath='../lib/librte_eal/common/eal_common_dev.c' line='289' column='1'/>
      <parameter type-id='type-id-5' name='devname' filepath='../lib/librte_eal/common/eal_common_dev.c' line='289' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_dev_probe' mangled-name='rte_dev_probe' filepath='../lib/librte_eal/common/eal_common_dev.c' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_probe@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='devargs' filepath='../lib/librte_eal/common/eal_common_dev.c' line='196' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_hotplug_add' mangled-name='rte_eal_hotplug_add' filepath='../lib/librte_eal/common/eal_common_dev.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_hotplug_add@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='busname' filepath='../lib/librte_eal/common/eal_common_dev.c' line='112' column='1'/>
      <parameter type-id='type-id-5' name='devname' filepath='../lib/librte_eal/common/eal_common_dev.c' line='112' column='1'/>
      <parameter type-id='type-id-5' name='drvargs' filepath='../lib/librte_eal/common/eal_common_dev.c' line='113' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_dev_is_probed' mangled-name='rte_dev_is_probed' filepath='../lib/librte_eal/common/eal_common_dev.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_is_probed@@DPDK_20.0'>
      <parameter type-id='type-id-41' name='dev' filepath='../lib/librte_eal/common/eal_common_dev.c' line='80' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_dev_dma_unmap' mangled-name='rte_dev_dma_unmap' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_dma_unmap@@EXPERIMENTAL'>
      <parameter type-id='type-id-31' name='dev' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1'/>
      <parameter type-id='type-id-43' name='addr' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1'/>
      <parameter type-id='type-id-55' name='iova' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_dev.c' line='780' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_dev_dma_map' mangled-name='rte_dev_dma_map' filepath='../lib/librte_eal/common/eal_common_dev.c' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_dma_map@@EXPERIMENTAL'>
      <parameter type-id='type-id-31' name='dev' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1'/>
      <parameter type-id='type-id-43' name='addr' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1'/>
      <parameter type-id='type-id-55' name='iova' filepath='../lib/librte_eal/common/eal_common_dev.c' line='779' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_dev.c' line='780' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <enum-decl name='rte_dev_event_type' filepath='../lib/librte_eal/common/include/rte_dev.h' line='30' column='1' id='type-id-113'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_DEV_EVENT_ADD' value='0'/>
      <enumerator name='RTE_DEV_EVENT_REMOVE' value='1'/>
      <enumerator name='RTE_DEV_EVENT_MAX' value='2'/>
    </enum-decl>
    <function-decl name='rte_dev_event_callback_process' mangled-name='rte_dev_event_callback_process' filepath='../lib/librte_eal/common/eal_common_dev.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_event_callback_process@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='device_name' filepath='../lib/librte_eal/common/eal_common_dev.c' line='540' column='1'/>
      <parameter type-id='type-id-113' name='event' filepath='../lib/librte_eal/common/eal_common_dev.c' line='541' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <typedef-decl name='rte_dev_event_cb_fn' type-id='type-id-115' filepath='../lib/librte_eal/common/include/rte_dev.h' line='42' column='1' id='type-id-116'/>
    <function-decl name='rte_dev_event_callback_unregister' mangled-name='rte_dev_event_callback_unregister' filepath='../lib/librte_eal/common/eal_common_dev.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_event_callback_unregister@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='device_name' filepath='../lib/librte_eal/common/eal_common_dev.c' line='495' column='1'/>
      <parameter type-id='type-id-116' name='cb_fn' filepath='../lib/librte_eal/common/eal_common_dev.c' line='496' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/common/eal_common_dev.c' line='497' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_dev_event_callback_register' mangled-name='rte_dev_event_callback_register' filepath='../lib/librte_eal/common/eal_common_dev.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_event_callback_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='device_name' filepath='../lib/librte_eal/common/eal_common_dev.c' line='429' column='1'/>
      <parameter type-id='type-id-116' name='cb_fn' filepath='../lib/librte_eal/common/eal_common_dev.c' line='430' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/common/eal_common_dev.c' line='431' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-117'/>
    <function-decl name='rte_dev_iterator_next' mangled-name='rte_dev_iterator_next' filepath='../lib/librte_eal/common/eal_common_dev.c' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_iterator_next@@EXPERIMENTAL'>
      <parameter type-id='type-id-117' name='it' filepath='../lib/librte_eal/common/eal_common_dev.c' line='718' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='rte_dev_iterator_init' mangled-name='rte_dev_iterator_init' filepath='../lib/librte_eal/common/eal_common_dev.c' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dev_iterator_init@@EXPERIMENTAL'>
      <parameter type-id='type-id-117' name='it' filepath='../lib/librte_eal/common/eal_common_dev.c' line='566' column='1'/>
      <parameter type-id='type-id-5' name='dev_str' filepath='../lib/librte_eal/common/eal_common_dev.c' line='567' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_errno.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='per_lcore__rte_errno' type-id='type-id-23' mangled-name='per_lcore__rte_errno' visibility='default' filepath='../lib/librte_eal/common/include/rte_errno.h' line='20' column='1' elf-symbol-id='per_lcore__rte_errno@@DPDK_20.0'/>
    <function-decl name='rte_strerror' mangled-name='rte_strerror' filepath='../lib/librte_eal/common/eal_common_errno.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_strerror@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='errnum' filepath='../lib/librte_eal/common/eal_common_errno.c' line='21' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_fbarray.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_fbarray' size-in-bits='768' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='44' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-106' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='count' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='len' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_sz' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='data' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rwlock' type-id='type-id-119' visibility='default' filepath='../lib/librte_eal/common/include/rte_fbarray.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='33' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-121' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-23' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-122'/>
    <typedef-decl name='int32_t' type-id='type-id-122' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-123'/>
    <qualified-type-def type-id='type-id-123' volatile='yes' id='type-id-121'/>
    <typedef-decl name='rte_rwlock_t' type-id='type-id-120' filepath='../lib/librte_eal/common/include/generic/rte_rwlock.h' line='35' column='1' id='type-id-119'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-124'/>
    <function-decl name='rte_fbarray_dump_metadata' mangled-name='rte_fbarray_dump_metadata' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1482' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_dump_metadata@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1482' column='1'/>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1482' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_rev_biggest_used' mangled-name='rte_fbarray_find_rev_biggest_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_rev_biggest_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_rev_biggest_free' mangled-name='rte_fbarray_find_rev_biggest_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_rev_biggest_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_biggest_used' mangled-name='rte_fbarray_find_biggest_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_biggest_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_biggest_free' mangled-name='rte_fbarray_find_biggest_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_biggest_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_rev_contig_used' mangled-name='rte_fbarray_find_rev_contig_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_rev_contig_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_rev_contig_free' mangled-name='rte_fbarray_find_rev_contig_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_rev_contig_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_prev_n_used' mangled-name='rte_fbarray_find_prev_n_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_prev_n_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='n' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1265' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_prev_n_free' mangled-name='rte_fbarray_find_prev_n_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_prev_n_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='n' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1265' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_prev_used' mangled-name='rte_fbarray_find_prev_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_prev_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_prev_free' mangled-name='rte_fbarray_find_prev_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_prev_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_contig_used' mangled-name='rte_fbarray_find_contig_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_contig_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_contig_free' mangled-name='rte_fbarray_find_contig_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_contig_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_next_n_used' mangled-name='rte_fbarray_find_next_n_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_next_n_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='n' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1265' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_next_n_free' mangled-name='rte_fbarray_find_next_n_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_next_n_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1264' column='1'/>
      <parameter type-id='type-id-112' name='n' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1265' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_next_used' mangled-name='rte_fbarray_find_next_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_next_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_find_next_free' mangled-name='rte_fbarray_find_next_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_next_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_is_used' mangled-name='rte_fbarray_is_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_is_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1098' column='1'/>
      <parameter type-id='type-id-112' name='idx' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1098' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_set_free' mangled-name='rte_fbarray_set_free' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_set_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_set_used' mangled-name='rte_fbarray_set_used' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_set_used@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <parameter type-id='type-id-112' name='start' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1425' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <function-decl name='rte_fbarray_find_idx' mangled-name='rte_fbarray_find_idx' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_find_idx@@EXPERIMENTAL'>
      <parameter type-id='type-id-126' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1456' column='1'/>
      <parameter type-id='type-id-43' name='elt' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1456' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_get' mangled-name='rte_fbarray_get' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_get@@EXPERIMENTAL'>
      <parameter type-id='type-id-126' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1067' column='1'/>
      <parameter type-id='type-id-112' name='idx' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='1067' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_fbarray_detach' mangled-name='rte_fbarray_detach' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_detach@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='928' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_destroy' mangled-name='rte_fbarray_destroy' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_destroy@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='982' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_attach' mangled-name='rte_fbarray_attach' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_attach@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='837' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_fbarray_init' mangled-name='rte_fbarray_init' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fbarray_init@@EXPERIMENTAL'>
      <parameter type-id='type-id-124' name='arr' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='713' column='1'/>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='713' column='1'/>
      <parameter type-id='type-id-112' name='len' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='713' column='1'/>
      <parameter type-id='type-id-112' name='elt_sz' filepath='../lib/librte_eal/common/eal_common_fbarray.c' line='714' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_hexdump.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_memdump' mangled-name='rte_memdump' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memdump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='52' column='1'/>
      <parameter type-id='type-id-5' name='title' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='52' column='1'/>
      <parameter type-id='type-id-43' name='buf' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='52' column='1'/>
      <parameter type-id='type-id-112' name='len' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='52' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_hexdump' mangled-name='rte_hexdump' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hexdump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='14' column='1'/>
      <parameter type-id='type-id-5' name='title' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='14' column='1'/>
      <parameter type-id='type-id-43' name='buf' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='14' column='1'/>
      <parameter type-id='type-id-112' name='len' filepath='../lib/librte_eal/common/eal_common_hexdump.c' line='14' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_hypervisor.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <enum-decl name='rte_hypervisor' filepath='../lib/librte_eal/common/include/rte_hypervisor.h' line='13' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_HYPERVISOR_NONE' value='0'/>
      <enumerator name='RTE_HYPERVISOR_KVM' value='1'/>
      <enumerator name='RTE_HYPERVISOR_HYPERV' value='2'/>
      <enumerator name='RTE_HYPERVISOR_VMWARE' value='3'/>
      <enumerator name='RTE_HYPERVISOR_UNKNOWN' value='4'/>
    </enum-decl>
    <function-decl name='rte_hypervisor_get_name' mangled-name='rte_hypervisor_get_name' filepath='../lib/librte_eal/common/eal_common_hypervisor.c' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hypervisor_get_name@@DPDK_20.0'>
      <parameter type-id='type-id-127' name='id' filepath='../lib/librte_eal/common/eal_common_hypervisor.c' line='8' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_launch.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_eal_mp_wait_lcore' mangled-name='rte_eal_mp_wait_lcore' filepath='../lib/librte_eal/common/eal_common_launch.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_mp_wait_lcore@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <enum-decl name='rte_lcore_state_t' filepath='../lib/librte_eal/common/include/rte_launch.h' line='21' column='1' id='type-id-128'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='WAIT' value='0'/>
      <enumerator name='RUNNING' value='1'/>
      <enumerator name='FINISHED' value='2'/>
    </enum-decl>
    <function-decl name='rte_eal_get_lcore_state' mangled-name='rte_eal_get_lcore_state' filepath='../lib/librte_eal/common/eal_common_launch.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_get_lcore_state@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_launch.c' line='75' column='1'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <enum-decl name='rte_rmt_call_master_t' filepath='../lib/librte_eal/common/include/rte_launch.h' line='71' column='1' id='type-id-129'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='SKIP_MASTER' value='0'/>
      <enumerator name='CALL_MASTER' value='1'/>
    </enum-decl>
    <function-decl name='rte_eal_mp_remote_launch' mangled-name='rte_eal_mp_remote_launch' filepath='../lib/librte_eal/common/eal_common_launch.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_mp_remote_launch@@DPDK_20.0'>
      <parameter type-id='type-id-70' name='f' filepath='../lib/librte_eal/common/eal_common_launch.c' line='46' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_launch.c' line='46' column='1'/>
      <parameter type-id='type-id-129' name='call_master' filepath='../lib/librte_eal/common/eal_common_launch.c' line='47' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_wait_lcore' mangled-name='rte_eal_wait_lcore' filepath='../lib/librte_eal/common/eal_common_launch.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_wait_lcore@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='slave_id' filepath='../lib/librte_eal/common/eal_common_launch.c' line='24' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_lcore.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_socket_id_by_idx' mangled-name='rte_socket_id_by_idx' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_socket_id_by_idx@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='idx' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='197' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_socket_count' mangled-name='rte_socket_count' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_socket_count@@DPDK_20.0'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_lcore_to_socket_id' mangled-name='rte_lcore_to_socket_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_to_socket_id@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='95' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_get_next_lcore' mangled-name='rte_get_next_lcore' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_get_next_lcore@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='i' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='75' column='1'/>
      <parameter type-id='type-id-23' name='skip_master' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='75' column='1'/>
      <parameter type-id='type-id-23' name='wrap' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='75' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_lcore_is_enabled' mangled-name='rte_lcore_is_enabled' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_is_enabled@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='idx' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='197' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <enum-decl name='rte_lcore_role_t' filepath='../lib/librte_eal/common/include/rte_eal.h' line='37' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='ROLE_RTE' value='0'/>
      <enumerator name='ROLE_OFF' value='1'/>
      <enumerator name='ROLE_SERVICE' value='2'/>
    </enum-decl>
    <function-decl name='rte_eal_lcore_role' mangled-name='rte_eal_lcore_role' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_lcore_role@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='57' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rte_lcore_index' mangled-name='rte_lcore_index' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_index@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='29' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_lcore_count' mangled-name='rte_lcore_count' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_count@@DPDK_20.0'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_get_master_lcore' mangled-name='rte_get_master_lcore' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='19' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_get_master_lcore@@DPDK_20.0'>
      <return type-id='type-id-112'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='39' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-133' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__cpu_mask' type-id='type-id-53' filepath='/usr/include/bits/cpu-set.h' line='32' column='1' id='type-id-134'/>

    <array-type-def dimensions='1' type-id='type-id-134' size-in-bits='1024' id='type-id-133'>
      <subrange length='16' type-id='type-id-53' id='type-id-135'/>

    </array-type-def>
    <typedef-decl name='cpu_set_t' type-id='type-id-132' filepath='/usr/include/bits/cpu-set.h' line='42' column='1' id='type-id-131'/>
    <typedef-decl name='rte_cpuset_t' type-id='type-id-131' filepath='../lib/librte_eal/linux/eal/include/rte_os.h' line='16' column='1' id='type-id-136'/>
    <function-decl name='rte_lcore_cpuset' mangled-name='rte_lcore_cpuset' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_cpuset@@EXPERIMENTAL'>
      <parameter type-id='type-id-112' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='51' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='rte_lcore_to_cpu_id' mangled-name='rte_lcore_to_cpu_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_to_cpu_id@@EXPERIMENTAL'>
      <parameter type-id='type-id-23' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_lcore.c' line='29' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_log.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_logs' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='32' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='level' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='file' type-id='type-id-95' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dynamic_types_len' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dynamic_types' type-id='type-id-139' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-112' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-140'/>
    <typedef-decl name='uint32_t' type-id='type-id-140' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-138'/>
    <class-decl name='rte_log_dynamic_type' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/eal_common_log.c' line='56' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/eal_common_log.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='loglevel' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/eal_common_log.c' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-139'/>
    <var-decl name='rte_logs' type-id='type-id-137' mangled-name='rte_logs' visibility='default' filepath='../lib/librte_eal/common/include/rte_log.h' line='41' column='1' elf-symbol-id='rte_logs@@DPDK_20.0'/>
    <function-decl name='rte_log' mangled-name='rte_log' filepath='../lib/librte_eal/common/eal_common_log.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='level' filepath='../lib/librte_eal/common/eal_common_log.c' line='442' column='1'/>
      <parameter type-id='type-id-138' name='logtype' filepath='../lib/librte_eal/common/eal_common_log.c' line='442' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='../lib/librte_eal/common/eal_common_log.c' line='442' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <function-decl name='rte_vlog' mangled-name='rte_vlog' filepath='../lib/librte_eal/common/eal_common_log.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vlog@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='level' filepath='../lib/librte_eal/common/eal_common_log.c' line='415' column='1'/>
      <parameter type-id='type-id-138' name='logtype' filepath='../lib/librte_eal/common/eal_common_log.c' line='415' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='../lib/librte_eal/common/eal_common_log.c' line='415' column='1'/>
      <parameter type-id='type-id-143' name='ap' filepath='../lib/librte_eal/common/eal_common_log.c' line='415' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_dump' mangled-name='rte_log_dump' filepath='../lib/librte_eal/common/eal_common_log.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_dump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_devargs.c' line='374' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_log_register' mangled-name='rte_log_register' filepath='../lib/librte_eal/common/eal_common_log.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_register@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_log.c' line='263' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_cur_msg_logtype' mangled-name='rte_log_cur_msg_logtype' filepath='../lib/librte_eal/common/eal_common_log.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_cur_msg_logtype@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_cur_msg_loglevel' mangled-name='rte_log_cur_msg_loglevel' filepath='../lib/librte_eal/common/eal_common_log.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_cur_msg_loglevel@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_set_level_pattern' mangled-name='rte_log_set_level_pattern' filepath='../lib/librte_eal/common/eal_common_log.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_set_level_pattern@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='pattern' filepath='../lib/librte_eal/common/eal_common_log.c' line='194' column='1'/>
      <parameter type-id='type-id-138' name='level' filepath='../lib/librte_eal/common/eal_common_log.c' line='194' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_set_level_regexp' mangled-name='rte_log_set_level_regexp' filepath='../lib/librte_eal/common/eal_common_log.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_set_level_regexp@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='regex' filepath='../lib/librte_eal/common/eal_common_log.c' line='130' column='1'/>
      <parameter type-id='type-id-138' name='level' filepath='../lib/librte_eal/common/eal_common_log.c' line='130' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_set_level' mangled-name='rte_log_set_level' filepath='../lib/librte_eal/common/eal_common_log.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_set_level@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='type' filepath='../lib/librte_eal/common/eal_common_log.c' line='116' column='1'/>
      <parameter type-id='type-id-138' name='level' filepath='../lib/librte_eal/common/eal_common_log.c' line='116' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_get_level' mangled-name='rte_log_get_level' filepath='../lib/librte_eal/common/eal_common_log.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_get_level@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='type' filepath='../lib/librte_eal/common/eal_common_log.c' line='107' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_get_global_level' mangled-name='rte_log_get_global_level' filepath='../lib/librte_eal/common/eal_common_log.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_get_global_level@@DPDK_20.0'>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='rte_log_set_global_level' mangled-name='rte_log_set_global_level' filepath='../lib/librte_eal/common/eal_common_log.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_set_global_level@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='level' filepath='../lib/librte_eal/common/eal_common_log.c' line='94' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_openlog_stream' mangled-name='rte_openlog_stream' filepath='../lib/librte_eal/common/eal_common_log.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_openlog_stream@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_log.c' line='68' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_register_type_and_pick_level' mangled-name='rte_log_register_type_and_pick_level' filepath='../lib/librte_eal/common/eal_common_log.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_register_type_and_pick_level@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_log.c' line='290' column='1'/>
      <parameter type-id='type-id-138' name='level_def' filepath='../lib/librte_eal/common/eal_common_log.c' line='290' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_log_get_stream' mangled-name='rte_log_get_stream' filepath='../lib/librte_eal/common/eal_common_log.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_log_get_stream@@EXPERIMENTAL'>
      <return type-id='type-id-95'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_mcfg.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_mcfg_mempool_write_unlock' mangled-name='rte_mcfg_mempool_write_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mempool_write_unlock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mempool_write_lock' mangled-name='rte_mcfg_mempool_write_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mempool_write_lock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mempool_read_unlock' mangled-name='rte_mcfg_mempool_read_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mempool_read_unlock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mempool_read_lock' mangled-name='rte_mcfg_mempool_read_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mempool_read_lock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_tailq_write_unlock' mangled-name='rte_mcfg_tailq_write_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_tailq_write_unlock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_tailq_write_lock' mangled-name='rte_mcfg_tailq_write_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_tailq_write_lock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_tailq_read_unlock' mangled-name='rte_mcfg_tailq_read_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_tailq_read_unlock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_tailq_read_lock' mangled-name='rte_mcfg_tailq_read_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_tailq_read_lock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mem_write_unlock' mangled-name='rte_mcfg_mem_write_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mem_write_unlock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mem_write_lock' mangled-name='rte_mcfg_mem_write_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mem_write_lock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mem_read_unlock' mangled-name='rte_mcfg_mem_read_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mem_read_unlock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_mem_read_lock' mangled-name='rte_mcfg_mem_read_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_mem_read_lock@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <type-decl name='bool' size-in-bits='8' id='type-id-144'/>
    <function-decl name='rte_mcfg_get_single_file_segments' mangled-name='rte_mcfg_get_single_file_segments' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_get_single_file_segments@@EXPERIMENTAL'>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='rte_mcfg_timer_unlock' mangled-name='rte_mcfg_timer_unlock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_timer_unlock@@EXPERIMENTAL'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mcfg_timer_lock' mangled-name='rte_mcfg_timer_lock' filepath='../lib/librte_eal/common/eal_common_mcfg.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mcfg_timer_lock@@EXPERIMENTAL'>
      <return type-id='type-id-42'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_memory.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_mem_lock_page' mangled-name='rte_mem_lock_page' filepath='../lib/librte_eal/common/eal_common_memory.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_lock_page@@DPDK_20.0'>
      <parameter type-id='type-id-43' name='virt' filepath='../lib/librte_eal/common/eal_common_memory.c' line='533' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memory_get_nrank' mangled-name='rte_memory_get_nrank' filepath='../lib/librte_eal/common/eal_common_memory.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memory_get_nrank@@DPDK_20.0'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_memory_get_nchannel' mangled-name='rte_memory_get_nchannel' filepath='../lib/librte_eal/common/eal_common_memory.c' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memory_get_nchannel@@DPDK_20.0'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rte_dump_physmem_layout' mangled-name='rte_dump_physmem_layout' filepath='../lib/librte_eal/common/eal_common_memory.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dump_physmem_layout@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_memory.c' line='408' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_eal_get_physmem_size' mangled-name='rte_eal_get_physmem_size' filepath='../lib/librte_eal/common/eal_common_memory.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_get_physmem_size@@DPDK_20.0'>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_mem_alloc_validator_unregister' mangled-name='rte_mem_alloc_validator_unregister' filepath='../lib/librte_eal/common/eal_common_memory.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_alloc_validator_unregister@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memory.c' line='395' column='1'/>
      <parameter type-id='type-id-23' name='socket_id' filepath='../lib/librte_eal/common/eal_common_memory.c' line='395' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <typedef-decl name='rte_mem_alloc_validator_t' type-id='type-id-146' filepath='../lib/librte_eal/common/include/rte_memory.h' line='720' column='1' id='type-id-147'/>
    <function-decl name='rte_mem_alloc_validator_register' mangled-name='rte_mem_alloc_validator_register' filepath='../lib/librte_eal/common/eal_common_memory.c' line='381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_alloc_validator_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memory.c' line='381' column='1'/>
      <parameter type-id='type-id-147' name='clb' filepath='../lib/librte_eal/common/eal_common_memory.c' line='382' column='1'/>
      <parameter type-id='type-id-23' name='socket_id' filepath='../lib/librte_eal/common/eal_common_memory.c' line='382' column='1'/>
      <parameter type-id='type-id-56' name='limit' filepath='../lib/librte_eal/common/eal_common_memory.c' line='382' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_mem_event_callback_unregister' mangled-name='rte_mem_event_callback_unregister' filepath='../lib/librte_eal/common/eal_common_memory.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_event_callback_unregister@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memory.c' line='369' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='369' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <enum-decl name='rte_mem_event' filepath='../lib/librte_eal/common/include/rte_memory.h' line='650' column='1' id='type-id-148'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_MEM_EVENT_ALLOC' value='0'/>
      <enumerator name='RTE_MEM_EVENT_FREE' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <typedef-decl name='rte_mem_event_callback_t' type-id='type-id-150' filepath='../lib/librte_eal/common/include/rte_memory.h' line='660' column='1' id='type-id-151'/>
    <function-decl name='rte_mem_event_callback_register' mangled-name='rte_mem_event_callback_register' filepath='../lib/librte_eal/common/eal_common_memory.c' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_event_callback_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memory.c' line='356' column='1'/>
      <parameter type-id='type-id-151' name='clb' filepath='../lib/librte_eal/common/eal_common_memory.c' line='356' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='357' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-152'/>
    <typedef-decl name='__uint8_t' type-id='type-id-152' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-153'/>
    <typedef-decl name='uint8_t' type-id='type-id-153' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-154'/>
    <function-decl name='rte_mem_set_dma_mask' mangled-name='rte_mem_set_dma_mask' filepath='../lib/librte_eal/common/eal_common_memory.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_set_dma_mask@@EXPERIMENTAL'>
      <parameter type-id='type-id-154' name='maskbits' filepath='../lib/librte_eal/common/eal_common_memory.c' line='496' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_mem_check_dma_mask_thread_unsafe' mangled-name='rte_mem_check_dma_mask_thread_unsafe' filepath='../lib/librte_eal/common/eal_common_memory.c' line='483' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_check_dma_mask_thread_unsafe@@EXPERIMENTAL'>
      <parameter type-id='type-id-154' name='maskbits' filepath='../lib/librte_eal/common/eal_common_memory.c' line='483' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_mem_check_dma_mask' mangled-name='rte_mem_check_dma_mask' filepath='../lib/librte_eal/common/eal_common_memory.c' line='477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_check_dma_mask@@EXPERIMENTAL'>
      <parameter type-id='type-id-154' name='maskbits' filepath='../lib/librte_eal/common/eal_common_memory.c' line='483' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_extmem_detach' mangled-name='rte_extmem_detach' filepath='../lib/librte_eal/common/eal_common_memory.c' line='886' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_extmem_detach@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/eal_common_memory.c' line='886' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memory.c' line='886' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_extmem_attach' mangled-name='rte_extmem_attach' filepath='../lib/librte_eal/common/eal_common_memory.c' line='880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_extmem_attach@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/eal_common_memory.c' line='886' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memory.c' line='886' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_extmem_unregister' mangled-name='rte_extmem_unregister' filepath='../lib/librte_eal/common/eal_common_memory.c' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_extmem_unregister@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/eal_common_memory.c' line='825' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memory.c' line='825' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <typedef-decl name='rte_iova_t' type-id='type-id-55' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <function-decl name='rte_extmem_register' mangled-name='rte_extmem_register' filepath='../lib/librte_eal/common/eal_common_memory.c' line='776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_extmem_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/eal_common_memory.c' line='776' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memory.c' line='776' column='1'/>
      <parameter type-id='type-id-156' name='iova_addrs' filepath='../lib/librte_eal/common/eal_common_memory.c' line='776' column='1'/>
      <parameter type-id='type-id-112' name='n_pages' filepath='../lib/librte_eal/common/eal_common_memory.c' line='777' column='1'/>
      <parameter type-id='type-id-56' name='page_sz' filepath='../lib/librte_eal/common/eal_common_memory.c' line='777' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <class-decl name='rte_memseg' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='48' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hugepage_sz' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='socket_id' type-id='type-id-123' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nchannel' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nrank' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='flags' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='50' column='1' id='type-id-158'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-159' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-155' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='52' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-55' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-159'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-162'/>
    <function-decl name='rte_memseg_get_fd_offset_thread_unsafe' mangled-name='rte_memseg_get_fd_offset_thread_unsafe' filepath='../lib/librte_eal/common/eal_common_memory.c' line='721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_get_fd_offset_thread_unsafe@@EXPERIMENTAL'>
      <parameter type-id='type-id-161' name='ms' filepath='../lib/librte_eal/common/eal_common_memory.c' line='721' column='1'/>
      <parameter type-id='type-id-162' name='offset' filepath='../lib/librte_eal/common/eal_common_memory.c' line='722' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memseg_get_fd_offset' mangled-name='rte_memseg_get_fd_offset' filepath='../lib/librte_eal/common/eal_common_memory.c' line='764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_get_fd_offset@@EXPERIMENTAL'>
      <parameter type-id='type-id-161' name='ms' filepath='../lib/librte_eal/common/eal_common_memory.c' line='764' column='1'/>
      <parameter type-id='type-id-162' name='offset' filepath='../lib/librte_eal/common/eal_common_memory.c' line='764' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memseg_get_fd_thread_unsafe' mangled-name='rte_memseg_get_fd_thread_unsafe' filepath='../lib/librte_eal/common/eal_common_memory.c' line='667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_get_fd_thread_unsafe@@EXPERIMENTAL'>
      <parameter type-id='type-id-161' name='ms' filepath='../lib/librte_eal/common/eal_common_memory.c' line='667' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memseg_get_fd' mangled-name='rte_memseg_get_fd' filepath='../lib/librte_eal/common/eal_common_memory.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_get_fd@@EXPERIMENTAL'>
      <parameter type-id='type-id-161' name='ms' filepath='../lib/librte_eal/common/eal_common_memory.c' line='709' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <class-decl name='rte_memseg_list' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='71' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='page_sz' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='socket_id' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='version' type-id='type-id-165' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='len' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='external' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='heap' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memseg_arr' type-id='type-id-118' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='73' column='1' id='type-id-164'>
      <data-member access='private'>
        <var-decl name='base_va' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='74' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='addr_64' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/include/rte_memory.h' line='76' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-138' volatile='yes' id='type-id-165'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <typedef-decl name='rte_memseg_list_walk_t' type-id='type-id-169' filepath='../lib/librte_eal/common/include/rte_memory.h' line='198' column='1' id='type-id-170'/>
    <function-decl name='rte_memseg_list_walk_thread_unsafe' mangled-name='rte_memseg_list_walk_thread_unsafe' filepath='../lib/librte_eal/common/eal_common_memory.c' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_list_walk_thread_unsafe@@EXPERIMENTAL'>
      <parameter type-id='type-id-170' name='func' filepath='../lib/librte_eal/common/eal_common_memory.c' line='635' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='635' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <typedef-decl name='rte_memseg_contig_walk_t' type-id='type-id-172' filepath='../lib/librte_eal/common/include/rte_memory.h' line='187' column='1' id='type-id-173'/>
    <function-decl name='rte_memseg_contig_walk_thread_unsafe' mangled-name='rte_memseg_contig_walk_thread_unsafe' filepath='../lib/librte_eal/common/eal_common_memory.c' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_contig_walk_thread_unsafe@@EXPERIMENTAL'>
      <parameter type-id='type-id-173' name='func' filepath='../lib/librte_eal/common/eal_common_memory.c' line='542' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='542' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <typedef-decl name='rte_memseg_walk_t' type-id='type-id-175' filepath='../lib/librte_eal/common/include/rte_memory.h' line='175' column='1' id='type-id-176'/>
    <function-decl name='rte_memseg_walk_thread_unsafe' mangled-name='rte_memseg_walk_thread_unsafe' filepath='../lib/librte_eal/common/eal_common_memory.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_walk_thread_unsafe@@EXPERIMENTAL'>
      <parameter type-id='type-id-176' name='func' filepath='../lib/librte_eal/common/eal_common_memory.c' line='594' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='594' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memseg_list_walk' mangled-name='rte_memseg_list_walk' filepath='../lib/librte_eal/common/eal_common_memory.c' line='654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_list_walk@@EXPERIMENTAL'>
      <parameter type-id='type-id-170' name='func' filepath='../lib/librte_eal/common/eal_common_memory.c' line='654' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='654' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memseg_contig_walk' mangled-name='rte_memseg_contig_walk' filepath='../lib/librte_eal/common/eal_common_memory.c' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_contig_walk@@EXPERIMENTAL'>
      <parameter type-id='type-id-173' name='func' filepath='../lib/librte_eal/common/eal_common_memory.c' line='581' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='581' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memseg_walk' mangled-name='rte_memseg_walk' filepath='../lib/librte_eal/common/eal_common_memory.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memseg_walk@@EXPERIMENTAL'>
      <parameter type-id='type-id-176' name='func' filepath='../lib/librte_eal/common/eal_common_memory.c' line='622' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='622' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-177'/>
    <function-decl name='rte_mem_virt2memseg_list' mangled-name='rte_mem_virt2memseg_list' filepath='../lib/librte_eal/common/eal_common_memory.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_virt2memseg_list@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='addr' filepath='../lib/librte_eal/common/eal_common_memory.c' line='231' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-178'/>
    <function-decl name='rte_mem_virt2memseg' mangled-name='rte_mem_virt2memseg' filepath='../lib/librte_eal/common/eal_common_memory.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_virt2memseg@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='addr' filepath='../lib/librte_eal/common/eal_common_memory.c' line='287' column='1'/>
      <parameter type-id='type-id-167' name='msl' filepath='../lib/librte_eal/common/eal_common_memory.c' line='287' column='1'/>
      <return type-id='type-id-178'/>
    </function-decl>
    <function-decl name='rte_mem_iova2virt' mangled-name='rte_mem_iova2virt' filepath='../lib/librte_eal/common/eal_common_memory.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mem_iova2virt@@EXPERIMENTAL'>
      <parameter type-id='type-id-155' name='iova' filepath='../lib/librte_eal/common/eal_common_memory.c' line='268' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-145'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_memzone.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-180' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-123' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-180'>
      <subrange length='32' type-id='type-id-53' id='type-id-181'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <function-decl name='rte_memzone_walk' mangled-name='rte_memzone_walk' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_walk@@DPDK_20.0'>
      <parameter type-id='type-id-185' name='func' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='392' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='393' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_memzone_dump' mangled-name='rte_memzone_dump' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_dump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_memory.c' line='408' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_memzone_lookup' mangled-name='rte_memzone_lookup' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_lookup@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='288' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='rte_memzone_free' mangled-name='rte_memzone_free' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_free@@DPDK_20.0'>
      <parameter type-id='type-id-183' name='mz' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='245' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_memzone_reserve' mangled-name='rte_memzone_reserve' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_reserve@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='237' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='237' column='1'/>
      <parameter type-id='type-id-23' name='socket_id' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='237' column='1'/>
      <parameter type-id='type-id-112' name='flags' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='238' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='rte_memzone_reserve_aligned' mangled-name='rte_memzone_reserve_aligned' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_reserve_aligned@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='225' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='225' column='1'/>
      <parameter type-id='type-id-23' name='socket_id' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='225' column='1'/>
      <parameter type-id='type-id-112' name='flags' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='226' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='226' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='rte_memzone_reserve_bounded' mangled-name='rte_memzone_reserve_bounded' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_memzone_reserve_bounded@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='213' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='213' column='1'/>
      <parameter type-id='type-id-23' name='socket_id' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='213' column='1'/>
      <parameter type-id='type-id-112' name='flags' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='214' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='214' column='1'/>
      <parameter type-id='type-id-112' name='bound' filepath='../lib/librte_eal/common/eal_common_memzone.c' line='214' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_options.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='infinite' id='type-id-186'>
      <subrange length='infinite' id='type-id-187'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-188'/>
    <var-decl name='eal_short_options' type-id='type-id-188' visibility='default' filepath='../lib/librte_eal/common/eal_options.h' line='75' column='1'/>
    <class-decl name='option' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/bits/getopt_ext.h' line='50' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/getopt_ext.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='has_arg' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/getopt_ext.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flag' type-id='type-id-190' visibility='default' filepath='/usr/include/bits/getopt_ext.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='val' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/getopt_ext.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-190'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-191'/>

    <array-type-def dimensions='1' type-id='type-id-191' size-in-bits='infinite' id='type-id-192'>
      <subrange length='infinite' id='type-id-187'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-193'/>
    <var-decl name='eal_long_options' type-id='type-id-193' visibility='default' filepath='../lib/librte_eal/common/eal_options.h' line='76' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_proc.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_eal_primary_proc_alive' mangled-name='rte_eal_primary_proc_alive' filepath='../lib/librte_eal/common/eal_common_proc.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_primary_proc_alive@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='config_file_path' filepath='../lib/librte_eal/common/eal_common_proc.c' line='146' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <class-decl name='rte_mp_msg' size-in-bits='2880' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='166' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-106' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='len_param' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='num_fds' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='param' type-id='type-id-195' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='fds' type-id='type-id-196' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='171' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='2048' id='type-id-195'>
      <subrange length='256' type-id='type-id-53' id='type-id-197'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='256' id='type-id-196'>
      <subrange length='8' type-id='type-id-53' id='type-id-198'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-199'/>
    <function-decl name='rte_mp_reply' mangled-name='rte_mp_reply' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mp_reply@@EXPERIMENTAL'>
      <parameter type-id='type-id-199' name='msg' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1198' column='1'/>
      <parameter type-id='type-id-5' name='peer' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1198' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-201' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-202' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-88' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-201'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-88' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-202'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-203'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <class-decl name='rte_mp_reply' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='174' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_sent' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_received' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='msgs' type-id='type-id-199' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-208'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <typedef-decl name='rte_mp_async_reply_t' type-id='type-id-211' filepath='../lib/librte_eal/common/include/rte_eal.h' line='209' column='1' id='type-id-212'/>
    <function-decl name='rte_mp_request_async' mangled-name='rte_mp_request_async' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mp_request_async@@EXPERIMENTAL'>
      <parameter type-id='type-id-199' name='req' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1048' column='1'/>
      <parameter type-id='type-id-204' name='ts' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1048' column='1'/>
      <parameter type-id='type-id-212' name='clb' filepath='../lib/librte_eal/common/eal_common_proc.c' line='1049' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-213'/>
    <function-decl name='rte_mp_request_sync' mangled-name='rte_mp_request_sync' filepath='../lib/librte_eal/common/eal_common_proc.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mp_request_sync@@EXPERIMENTAL'>
      <parameter type-id='type-id-199' name='req' filepath='../lib/librte_eal/common/eal_common_proc.c' line='952' column='1'/>
      <parameter type-id='type-id-213' name='reply' filepath='../lib/librte_eal/common/eal_common_proc.c' line='952' column='1'/>
      <parameter type-id='type-id-204' name='ts' filepath='../lib/librte_eal/common/eal_common_proc.c' line='953' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_mp_sendmsg' mangled-name='rte_mp_sendmsg' filepath='../lib/librte_eal/common/eal_common_proc.c' line='805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mp_sendmsg@@EXPERIMENTAL'>
      <parameter type-id='type-id-199' name='msg' filepath='../lib/librte_eal/common/eal_common_proc.c' line='805' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_mp_action_unregister' mangled-name='rte_mp_action_unregister' filepath='../lib/librte_eal/common/eal_common_proc.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mp_action_unregister@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_proc.c' line='235' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-215'/>
    <typedef-decl name='rte_mp_t' type-id='type-id-215' filepath='../lib/librte_eal/common/include/rte_eal.h' line='193' column='1' id='type-id-216'/>
    <function-decl name='rte_mp_action_register' mangled-name='rte_mp_action_register' filepath='../lib/librte_eal/common/eal_common_proc.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_mp_action_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_proc.c' line='201' column='1'/>
      <parameter type-id='type-id-216' name='action' filepath='../lib/librte_eal/common/eal_common_proc.c' line='201' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-210'>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-214'>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-23'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_string_fns.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <typedef-decl name='__ssize_t' type-id='type-id-88' filepath='/usr/include/bits/types.h' line='193' column='1' id='type-id-217'/>
    <typedef-decl name='ssize_t' type-id='type-id-217' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-218'/>
    <function-decl name='rte_strscpy' mangled-name='rte_strscpy' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_strscpy@@DPDK_20.0'>
      <parameter type-id='type-id-75' name='dst' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='48' column='1'/>
      <parameter type-id='type-id-5' name='src' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='48' column='1'/>
      <parameter type-id='type-id-56' name='dsize' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='48' column='1'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-219'/>
    <function-decl name='rte_strsplit' mangled-name='rte_strsplit' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_strsplit@@DPDK_20.0'>
      <parameter type-id='type-id-75' name='string' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='14' column='1'/>
      <parameter type-id='type-id-23' name='stringlen' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='14' column='1'/>
      <parameter type-id='type-id-219' name='tokens' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='15' column='1'/>
      <parameter type-id='type-id-23' name='maxtokens' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='15' column='1'/>
      <parameter type-id='type-id-21' name='delim' filepath='../lib/librte_eal/common/eal_common_string_fns.c' line='15' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_tailqs.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_tailq_elem' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='45' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-221' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-222' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-223' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_tailq_head' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='40' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq_head' type-id='type-id-225' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-180' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_tailq_entry_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='28' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-226' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-227' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_tailq_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='23' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-229' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='24' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-226' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-227' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-221'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='51' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-230' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-231' visibility='default' filepath='../lib/librte_eal/common/include/rte_tailq.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='256' id='type-id-232'>
      <subrange length='32' type-id='type-id-53' id='type-id-181'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-223'/>
    <function-decl name='rte_eal_tailq_register' mangled-name='rte_eal_tailq_register' filepath='../lib/librte_eal/common/eal_common_tailqs.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_tailq_register@@DPDK_20.0'>
      <parameter type-id='type-id-230' name='t' filepath='../lib/librte_eal/common/eal_common_tailqs.c' line='120' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_dump_tailq' mangled-name='rte_dump_tailq' filepath='../lib/librte_eal/common/eal_common_tailqs.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dump_tailq@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_tailqs.c' line='55' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_eal_tailq_lookup' mangled-name='rte_eal_tailq_lookup' filepath='../lib/librte_eal/common/eal_common_tailqs.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_tailq_lookup@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_tailqs.c' line='37' column='1'/>
      <return type-id='type-id-221'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_thread.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <typedef-decl name='pthread_t' type-id='type-id-53' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-233'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='56' column='1' id='type-id-235'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-236' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-88' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='448' id='type-id-236'>
      <subrange length='56' type-id='type-id-53' id='type-id-237'/>

    </array-type-def>
    <typedef-decl name='pthread_attr_t' type-id='type-id-235' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='type-id-238'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-239'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-242'/>
    <function-decl name='rte_ctrl_thread_create' mangled-name='rte_ctrl_thread_create' filepath='../lib/librte_eal/common/eal_common_thread.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ctrl_thread_create@@DPDK_20.0'>
      <parameter type-id='type-id-234' name='thread' filepath='../lib/librte_eal/common/eal_common_thread.c' line='169' column='1'/>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/eal_common_thread.c' line='169' column='1'/>
      <parameter type-id='type-id-240' name='attr' filepath='../lib/librte_eal/common/eal_common_thread.c' line='170' column='1'/>
      <parameter type-id='type-id-242' name='start_routine' filepath='../lib/librte_eal/common/eal_common_thread.c' line='171' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/common/eal_common_thread.c' line='171' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-243'/>
    <function-decl name='rte_thread_get_affinity' mangled-name='rte_thread_get_affinity' filepath='../lib/librte_eal/common/eal_common_thread.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_thread_get_affinity@@DPDK_20.0'>
      <parameter type-id='type-id-243' name='cpusetp' filepath='../lib/librte_eal/common/eal_common_thread.c' line='104' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_thread_set_affinity' mangled-name='rte_thread_set_affinity' filepath='../lib/librte_eal/common/eal_common_thread.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_thread_set_affinity@@DPDK_20.0'>
      <parameter type-id='type-id-243' name='cpusetp' filepath='../lib/librte_eal/common/eal_common_thread.c' line='70' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_lcore_has_role' mangled-name='rte_lcore_has_role' filepath='../lib/librte_eal/common/eal_common_thread.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_lcore_has_role@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='lcore_id' filepath='../lib/librte_eal/common/eal_common_thread.c' line='31' column='1'/>
      <parameter type-id='type-id-130' name='role' filepath='../lib/librte_eal/common/eal_common_thread.c' line='31' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_socket_id' mangled-name='rte_socket_id' filepath='../lib/librte_eal/common/eal_common_thread.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_socket_id@@DPDK_20.0'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-43'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_timer.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <var-decl name='rte_delay_us' type-id='type-id-245' mangled-name='rte_delay_us' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_cycles.h' line='139' column='1' elf-symbol-id='rte_delay_us@@DPDK_20.0'/>
    <function-decl name='rte_delay_us_callback_register' mangled-name='rte_delay_us_callback_register' filepath='../lib/librte_eal/common/eal_common_timer.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_delay_us_callback_register@@DPDK_20.0'>
      <parameter type-id='type-id-245' name='userfunc' filepath='../lib/librte_eal/common/eal_common_timer.c' line='107' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_get_tsc_hz' mangled-name='rte_get_tsc_hz' filepath='../lib/librte_eal/common/eal_common_timer.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_get_tsc_hz@@DPDK_20.0'>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_delay_us_block' mangled-name='rte_delay_us_block' filepath='../lib/librte_eal/common/eal_common_timer.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_delay_us_block@@DPDK_20.0'>
      <parameter type-id='type-id-112' name='us' filepath='../lib/librte_eal/common/eal_common_timer.c' line='30' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_delay_us_sleep' mangled-name='rte_delay_us_sleep' filepath='../lib/librte_eal/common/eal_common_timer.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_delay_us_sleep@@EXPERIMENTAL'>
      <parameter type-id='type-id-112' name='us' filepath='../lib/librte_eal/common/eal_common_timer.c' line='30' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-244'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/eal_common_uuid.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-246'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <function-decl name='rte_uuid_unparse' mangled-name='rte_uuid_unparse' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_uuid_unparse@@DPDK_20.0'>
      <parameter type-id='type-id-247' name='uu' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='155' column='1'/>
      <parameter type-id='type-id-75' name='out' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='155' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='155' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-248'/>
    <function-decl name='rte_uuid_parse' mangled-name='rte_uuid_parse' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_uuid_parse@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='in' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='113' column='1'/>
      <parameter type-id='type-id-248' name='uu' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='113' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_uuid_compare' mangled-name='rte_uuid_compare' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_uuid_compare@@DPDK_20.0'>
      <parameter type-id='type-id-247' name='uu1' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='94' column='1'/>
      <parameter type-id='type-id-247' name='uu2' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='94' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_uuid_is_null' mangled-name='rte_uuid_is_null' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_uuid_is_null@@DPDK_20.0'>
      <parameter type-id='type-id-247' name='uu' filepath='../lib/librte_eal/common/eal_common_uuid.c' line='80' column='1'/>
      <return type-id='type-id-144'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/rte_keepalive.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_keepalive' size-in-bits='75264' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='14' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='live_data' type-id='type-id-250' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65536'>
        <var-decl name='last_alive' type-id='type-id-251' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73728'>
        <var-decl name='active_cores' type-id='type-id-252' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74752'>
        <var-decl name='callback' type-id='type-id-253' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74816'>
        <var-decl name='callback_data' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74880'>
        <var-decl name='tsc_initial' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74944'>
        <var-decl name='tsc_mhz' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='75008'>
        <var-decl name='relay_callback' type-id='type-id-254' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='75072'>
        <var-decl name='relay_callback_data' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='16' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='core_state' type-id='type-id-256' visibility='default' filepath='../lib/librte_eal/common/rte_keepalive.c' line='20' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_keepalive_state' filepath='../lib/librte_eal/common/include/rte_keepalive.h' line='24' column='1' id='type-id-256'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_KA_STATE_UNUSED' value='0'/>
      <enumerator name='RTE_KA_STATE_ALIVE' value='1'/>
      <enumerator name='RTE_KA_STATE_MISSING' value='4'/>
      <enumerator name='RTE_KA_STATE_DEAD' value='2'/>
      <enumerator name='RTE_KA_STATE_GONE' value='3'/>
      <enumerator name='RTE_KA_STATE_DOZING' value='5'/>
      <enumerator name='RTE_KA_STATE_SLEEP' value='6'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-255' size-in-bits='65536' id='type-id-250'>
      <subrange length='128' type-id='type-id-53' id='type-id-257'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='8192' id='type-id-251'>
      <subrange length='128' type-id='type-id-53' id='type-id-257'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='1024' id='type-id-252'>
      <subrange length='128' type-id='type-id-53' id='type-id-257'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-258'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <typedef-decl name='rte_keepalive_failure_callback_t' type-id='type-id-260' filepath='../lib/librte_eal/common/include/rte_keepalive.h' line='42' column='1' id='type-id-253'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <typedef-decl name='rte_keepalive_relay_callback_t' type-id='type-id-262' filepath='../lib/librte_eal/common/include/rte_keepalive.h' line='57' column='1' id='type-id-254'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-263'/>
    <function-decl name='rte_keepalive_mark_sleep' mangled-name='rte_keepalive_mark_sleep' filepath='../lib/librte_eal/common/rte_keepalive.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_keepalive_mark_sleep@@DPDK_20.0'>
      <parameter type-id='type-id-263' name='keepcfg' filepath='../lib/librte_eal/common/rte_keepalive.c' line='159' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_keepalive_mark_alive' mangled-name='rte_keepalive_mark_alive' filepath='../lib/librte_eal/common/rte_keepalive.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_keepalive_mark_alive@@DPDK_20.0'>
      <parameter type-id='type-id-263' name='keepcfg' filepath='../lib/librte_eal/common/rte_keepalive.c' line='159' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_keepalive_register_core' mangled-name='rte_keepalive_register_core' filepath='../lib/librte_eal/common/rte_keepalive.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_keepalive_register_core@@DPDK_20.0'>
      <parameter type-id='type-id-263' name='keepcfg' filepath='../lib/librte_eal/common/rte_keepalive.c' line='144' column='1'/>
      <parameter type-id='type-id-258' name='id_core' filepath='../lib/librte_eal/common/rte_keepalive.c' line='144' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_keepalive_register_relay_callback' mangled-name='rte_keepalive_register_relay_callback' filepath='../lib/librte_eal/common/rte_keepalive.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_keepalive_register_relay_callback@@DPDK_20.0'>
      <parameter type-id='type-id-263' name='keepcfg' filepath='../lib/librte_eal/common/rte_keepalive.c' line='135' column='1'/>
      <parameter type-id='type-id-254' name='callback' filepath='../lib/librte_eal/common/rte_keepalive.c' line='136' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='../lib/librte_eal/common/rte_keepalive.c' line='137' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_keepalive_create' mangled-name='rte_keepalive_create' filepath='../lib/librte_eal/common/rte_keepalive.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_keepalive_create@@DPDK_20.0'>
      <parameter type-id='type-id-253' name='callback' filepath='../lib/librte_eal/common/rte_keepalive.c' line='118' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='../lib/librte_eal/common/rte_keepalive.c' line='119' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='rte_keepalive_dispatch_pings' mangled-name='rte_keepalive_dispatch_pings' filepath='../lib/librte_eal/common/rte_keepalive.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_keepalive_dispatch_pings@@DPDK_20.0'>
      <parameter type-id='type-id-43' name='ptr_timer' filepath='../lib/librte_eal/common/rte_keepalive.c' line='64' column='1'/>
      <parameter type-id='type-id-43' name='ptr_data' filepath='../lib/librte_eal/common/rte_keepalive.c' line='65' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-259'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-42'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-261'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-256'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/rte_malloc.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_malloc_virt2iova' mangled-name='rte_malloc_virt2iova' filepath='../lib/librte_eal/common/rte_malloc.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_virt2iova@@DPDK_20.0'>
      <parameter type-id='type-id-43' name='addr' filepath='../lib/librte_eal/common/rte_malloc.c' line='318' column='1'/>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='rte_malloc_set_limit' mangled-name='rte_malloc_set_limit' filepath='../lib/librte_eal/common/rte_malloc.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_set_limit@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='308' column='1'/>
      <parameter type-id='type-id-56' name='max' filepath='../lib/librte_eal/common/rte_malloc.c' line='309' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_dump_stats' mangled-name='rte_malloc_dump_stats' filepath='../lib/librte_eal/common/rte_malloc.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_dump_stats@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/rte_malloc.c' line='279' column='1'/>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='279' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <class-decl name='rte_malloc_socket_stats' size-in-bits='320' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='26' column='1' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='heap_totalsz_bytes' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='heap_freesz_bytes' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='greatest_free_size' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='free_count' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='alloc_count' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='heap_allocsz_bytes' type-id='type-id-56' visibility='default' filepath='../lib/librte_eal/common/include/rte_malloc.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <function-decl name='rte_malloc_get_socket_stats' mangled-name='rte_malloc_get_socket_stats' filepath='../lib/librte_eal/common/rte_malloc.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_get_socket_stats@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='185' column='1'/>
      <parameter type-id='type-id-265' name='socket_stats' filepath='../lib/librte_eal/common/rte_malloc.c' line='186' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_validate' mangled-name='rte_malloc_validate' filepath='../lib/librte_eal/common/rte_malloc.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_validate@@DPDK_20.0'>
      <parameter type-id='type-id-43' name='ptr' filepath='../lib/librte_eal/common/rte_malloc.c' line='171' column='1'/>
      <parameter type-id='type-id-162' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='171' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_realloc' mangled-name='rte_realloc' filepath='../lib/librte_eal/common/rte_malloc.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_realloc@@DPDK_20.0'>
      <parameter type-id='type-id-43' name='ptr' filepath='../lib/librte_eal/common/rte_malloc.c' line='165' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='165' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='165' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_calloc' mangled-name='rte_calloc' filepath='../lib/librte_eal/common/rte_malloc.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_calloc@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='115' column='1'/>
      <parameter type-id='type-id-56' name='num' filepath='../lib/librte_eal/common/rte_malloc.c' line='115' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='115' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='115' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_calloc_socket' mangled-name='rte_calloc_socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_calloc_socket@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='106' column='1'/>
      <parameter type-id='type-id-56' name='num' filepath='../lib/librte_eal/common/rte_malloc.c' line='106' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='106' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='106' column='1'/>
      <parameter type-id='type-id-23' name='socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='106' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_zmalloc' mangled-name='rte_zmalloc' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_zmalloc@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_zmalloc_socket' mangled-name='rte_zmalloc_socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_zmalloc_socket@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='77' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='77' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='77' column='1'/>
      <parameter type-id='type-id-23' name='socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='77' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_malloc' mangled-name='rte_malloc' filepath='../lib/librte_eal/common/rte_malloc.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='97' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_malloc_socket' mangled-name='rte_malloc_socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_socket@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='type' filepath='../lib/librte_eal/common/rte_malloc.c' line='44' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='44' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='44' column='1'/>
      <parameter type-id='type-id-23' name='socket_arg' filepath='../lib/librte_eal/common/rte_malloc.c' line='45' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='rte_free' mangled-name='rte_free' filepath='../lib/librte_eal/common/rte_malloc.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_free@@DPDK_20.0'>
      <parameter type-id='type-id-43' name='addr' filepath='../lib/librte_eal/common/rte_malloc.c' line='33' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_malloc_dump_heaps' mangled-name='rte_malloc_dump_heaps' filepath='../lib/librte_eal/common/rte_malloc.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_dump_heaps@@EXPERIMENTAL'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/eal_common_bus.c' line='105' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_socket_is_external' mangled-name='rte_malloc_heap_socket_is_external' filepath='../lib/librte_eal/common/rte_malloc.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_socket_is_external@@EXPERIMENTAL'>
      <parameter type-id='type-id-23' name='socket_id' filepath='../lib/librte_eal/common/rte_malloc.c' line='251' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_get_socket' mangled-name='rte_malloc_heap_get_socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_get_socket@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/rte_malloc.c' line='215' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_destroy' mangled-name='rte_malloc_heap_destroy' filepath='../lib/librte_eal/common/rte_malloc.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_destroy@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='heap_name' filepath='../lib/librte_eal/common/rte_malloc.c' line='588' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_create' mangled-name='rte_malloc_heap_create' filepath='../lib/librte_eal/common/rte_malloc.c' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_create@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='heap_name' filepath='../lib/librte_eal/common/rte_malloc.c' line='537' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_memory_detach' mangled-name='rte_malloc_heap_memory_detach' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_memory_detach@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='heap_name' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1'/>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_memory_attach' mangled-name='rte_malloc_heap_memory_attach' filepath='../lib/librte_eal/common/rte_malloc.c' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_memory_attach@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='heap_name' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1'/>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/rte_malloc.c' line='531' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_memory_remove' mangled-name='rte_malloc_heap_memory_remove' filepath='../lib/librte_eal/common/rte_malloc.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_memory_remove@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='heap_name' filepath='../lib/librte_eal/common/rte_malloc.c' line='410' column='1'/>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/rte_malloc.c' line='410' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/rte_malloc.c' line='410' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_malloc_heap_memory_add' mangled-name='rte_malloc_heap_memory_add' filepath='../lib/librte_eal/common/rte_malloc.c' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_malloc_heap_memory_add@@EXPERIMENTAL'>
      <parameter type-id='type-id-5' name='heap_name' filepath='../lib/librte_eal/common/rte_malloc.c' line='355' column='1'/>
      <parameter type-id='type-id-43' name='va_addr' filepath='../lib/librte_eal/common/rte_malloc.c' line='355' column='1'/>
      <parameter type-id='type-id-56' name='len' filepath='../lib/librte_eal/common/rte_malloc.c' line='355' column='1'/>
      <parameter type-id='type-id-156' name='iova_addrs' filepath='../lib/librte_eal/common/rte_malloc.c' line='356' column='1'/>
      <parameter type-id='type-id-112' name='n_pages' filepath='../lib/librte_eal/common/rte_malloc.c' line='356' column='1'/>
      <parameter type-id='type-id-56' name='page_sz' filepath='../lib/librte_eal/common/rte_malloc.c' line='356' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_realloc_socket' mangled-name='rte_realloc_socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_realloc_socket@@EXPERIMENTAL'>
      <parameter type-id='type-id-43' name='ptr' filepath='../lib/librte_eal/common/rte_malloc.c' line='124' column='1'/>
      <parameter type-id='type-id-56' name='size' filepath='../lib/librte_eal/common/rte_malloc.c' line='124' column='1'/>
      <parameter type-id='type-id-112' name='align' filepath='../lib/librte_eal/common/rte_malloc.c' line='124' column='1'/>
      <parameter type-id='type-id-23' name='socket' filepath='../lib/librte_eal/common/rte_malloc.c' line='124' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/rte_option.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_option' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='39' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-267' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='usage' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cb' type-id='type-id-268' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='enabled' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='40' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-269' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-270' visibility='default' filepath='../lib/librte_eal/common/include/rte_option.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <typedef-decl name='rte_option_cb' type-id='type-id-25' filepath='../lib/librte_eal/common/include/rte_option.h' line='30' column='1' id='type-id-268'/>
    <function-decl name='rte_option_register' mangled-name='rte_option_register' filepath='../lib/librte_eal/common/rte_option.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_option_register@@EXPERIMENTAL'>
      <parameter type-id='type-id-269' name='opt' filepath='../lib/librte_eal/common/rte_option.c' line='42' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/rte_random.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_rand' mangled-name='rte_rand' filepath='../lib/librte_eal/common/rte_random.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_rand@@DPDK_20.0'>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rte_srand' mangled-name='rte_srand' filepath='../lib/librte_eal/common/rte_random.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_srand@@DPDK_20.0'>
      <parameter type-id='type-id-55' name='seed' filepath='../lib/librte_eal/common/rte_random.c' line='80' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_rand_max' mangled-name='rte_rand_max' filepath='../lib/librte_eal/common/rte_random.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_rand_max@@EXPERIMENTAL'>
      <parameter type-id='type-id-55' name='upper_bound' filepath='../lib/librte_eal/common/rte_random.c' line='141' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/rte_reciprocal.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_reciprocal_u64' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='35' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sh1' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='sh2' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='rte_reciprocal_value_u64' mangled-name='rte_reciprocal_value_u64' filepath='../lib/librte_eal/common/rte_reciprocal.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_reciprocal_value_u64@@DPDK_20.0'>
      <parameter type-id='type-id-55' name='d' filepath='../lib/librte_eal/common/rte_reciprocal.c' line='102' column='1'/>
      <return type-id='type-id-271'/>
    </function-decl>
    <class-decl name='rte_reciprocal' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='30' column='1' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sh1' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='sh2' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='rte_reciprocal_value' mangled-name='rte_reciprocal_value' filepath='../lib/librte_eal/common/rte_reciprocal.c' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_reciprocal_value@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='d' filepath='../lib/librte_eal/common/rte_reciprocal.c' line='14' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/rte_service.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_service_dump' mangled-name='rte_service_dump' filepath='../lib/librte_eal/common/rte_service.c' line='849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_dump@@DPDK_20.0'>
      <parameter type-id='type-id-95' name='f' filepath='../lib/librte_eal/common/rte_service.c' line='849' column='1'/>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='849' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_attr_reset_all' mangled-name='rte_service_lcore_attr_reset_all' filepath='../lib/librte_eal/common/rte_service.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_attr_reset_all@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='815' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_attr_reset_all' mangled-name='rte_service_attr_reset_all' filepath='../lib/librte_eal/common/rte_service.c' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_attr_reset_all@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='804' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-273'/>
    <function-decl name='rte_service_lcore_attr_get' mangled-name='rte_service_lcore_attr_get' filepath='../lib/librte_eal/common/rte_service.c' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_attr_get@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='755' column='1'/>
      <parameter type-id='type-id-138' name='attr_id' filepath='../lib/librte_eal/common/rte_service.c' line='755' column='1'/>
      <parameter type-id='type-id-273' name='attr_value' filepath='../lib/librte_eal/common/rte_service.c' line='756' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_attr_get' mangled-name='rte_service_attr_get' filepath='../lib/librte_eal/common/rte_service.c' line='734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_attr_get@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='755' column='1'/>
      <parameter type-id='type-id-138' name='attr_id' filepath='../lib/librte_eal/common/rte_service.c' line='755' column='1'/>
      <parameter type-id='type-id-273' name='attr_value' filepath='../lib/librte_eal/common/rte_service.c' line='756' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_stop' mangled-name='rte_service_lcore_stop' filepath='../lib/librte_eal/common/rte_service.c' line='704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_stop@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='704' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_start' mangled-name='rte_service_lcore_start' filepath='../lib/librte_eal/common/rte_service.c' line='681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_start@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='804' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_del' mangled-name='rte_service_lcore_del' filepath='../lib/librte_eal/common/rte_service.c' line='662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_del@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='815' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_add' mangled-name='rte_service_lcore_add' filepath='../lib/librte_eal/common/rte_service.c' line='643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_add@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='643' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_reset_all' mangled-name='rte_service_lcore_reset_all' filepath='../lib/librte_eal/common/rte_service.c' line='623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_reset_all@@DPDK_20.0'>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_map_lcore_get' mangled-name='rte_service_map_lcore_get' filepath='../lib/librte_eal/common/rte_service.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_map_lcore_get@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='597' column='1'/>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='597' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_map_lcore_set' mangled-name='rte_service_map_lcore_set' filepath='../lib/librte_eal/common/rte_service.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_map_lcore_set@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='588' column='1'/>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='588' column='1'/>
      <parameter type-id='type-id-138' name='enabled' filepath='../lib/librte_eal/common/rte_service.c' line='588' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_start_with_defaults' mangled-name='rte_service_start_with_defaults' filepath='../lib/librte_eal/common/rte_service.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_start_with_defaults@@DPDK_20.0'>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_count_services' mangled-name='rte_service_lcore_count_services' filepath='../lib/librte_eal/common/rte_service.c' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_count_services@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='815' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-274'/>
    <function-decl name='rte_service_lcore_list' mangled-name='rte_service_lcore_list' filepath='../lib/librte_eal/common/rte_service.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_list@@DPDK_20.0'>
      <parameter type-id='type-id-274' name='array' filepath='../lib/librte_eal/common/rte_service.c' line='466' column='1'/>
      <parameter type-id='type-id-138' name='n' filepath='../lib/librte_eal/common/rte_service.c' line='466' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_lcore_count' mangled-name='rte_service_lcore_count' filepath='../lib/librte_eal/common/rte_service.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_lcore_count@@DPDK_20.0'>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_run_iter_on_app_lcore' mangled-name='rte_service_run_iter_on_app_lcore' filepath='../lib/librte_eal/common/rte_service.c' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_run_iter_on_app_lcore@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='597' column='1'/>
      <parameter type-id='type-id-138' name='lcore' filepath='../lib/librte_eal/common/rte_service.c' line='597' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_may_be_active' mangled-name='rte_service_may_be_active' filepath='../lib/librte_eal/common/rte_service.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_may_be_active@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='380' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_runstate_get' mangled-name='rte_service_runstate_get' filepath='../lib/librte_eal/common/rte_service.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_runstate_get@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='380' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_runstate_set' mangled-name='rte_service_runstate_set' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_runstate_set@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1'/>
      <parameter type-id='type-id-138' name='runstate' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_component_runstate_set' mangled-name='rte_service_component_runstate_set' filepath='../lib/librte_eal/common/rte_service.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_component_runstate_set@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1'/>
      <parameter type-id='type-id-138' name='runstate' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_component_unregister' mangled-name='rte_service_component_unregister' filepath='../lib/librte_eal/common/rte_service.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_component_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='804' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <class-decl name='rte_service_spec' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='26' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-180' visibility='default' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='callback' type-id='type-id-276' visibility='default' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='callback_userdata' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='capabilities' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='socket_id' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <typedef-decl name='rte_service_func' type-id='type-id-278' filepath='../lib/librte_eal/common/include/rte_service_component.h' line='18' column='1' id='type-id-276'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-279'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <function-decl name='rte_service_component_register' mangled-name='rte_service_component_register' filepath='../lib/librte_eal/common/rte_service.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_component_register@@DPDK_20.0'>
      <parameter type-id='type-id-280' name='spec' filepath='../lib/librte_eal/common/rte_service.c' line='231' column='1'/>
      <parameter type-id='type-id-274' name='id_ptr' filepath='../lib/librte_eal/common/rte_service.c' line='232' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_probe_capability' mangled-name='rte_service_probe_capability' filepath='../lib/librte_eal/common/rte_service.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_probe_capability@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1'/>
      <parameter type-id='type-id-138' name='runstate' filepath='../lib/librte_eal/common/rte_service.c' line='300' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_get_name' mangled-name='rte_service_get_name' filepath='../lib/librte_eal/common/rte_service.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_get_name@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='215' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='rte_service_get_by_name' mangled-name='rte_service_get_by_name' filepath='../lib/librte_eal/common/rte_service.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_get_by_name@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/common/rte_service.c' line='197' column='1'/>
      <parameter type-id='type-id-274' name='service_id' filepath='../lib/librte_eal/common/rte_service.c' line='197' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_get_count' mangled-name='rte_service_get_count' filepath='../lib/librte_eal/common/rte_service.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_get_count@@DPDK_20.0'>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='rte_service_set_runstate_mapped_check' mangled-name='rte_service_set_runstate_mapped_check' filepath='../lib/librte_eal/common/rte_service.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_set_runstate_mapped_check@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='177' column='1'/>
      <parameter type-id='type-id-123' name='enabled' filepath='../lib/librte_eal/common/rte_service.c' line='177' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_set_stats_enable' mangled-name='rte_service_set_stats_enable' filepath='../lib/librte_eal/common/rte_service.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_set_stats_enable@@DPDK_20.0'>
      <parameter type-id='type-id-138' name='id' filepath='../lib/librte_eal/common/rte_service.c' line='177' column='1'/>
      <parameter type-id='type-id-123' name='enabled' filepath='../lib/librte_eal/common/rte_service.c' line='177' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='rte_service_finalize' mangled-name='rte_service_finalize' filepath='../lib/librte_eal/common/rte_service.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_service_finalize@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-123'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/arch/x86/rte_spinlock.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='rte_rtm_supported' type-id='type-id-154' mangled-name='rte_rtm_supported' visibility='default' filepath='../lib/librte_eal/common/arch/x86/rte_spinlock.c' line='9' column='1' elf-symbol-id='rte_rtm_supported@@DPDK_20.0'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/arch/x86/rte_cpuflags.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <enum-decl name='rte_cpu_flag_t' filepath='../lib/librte_eal/common/include/arch/x86/rte_cpuflags.h' line='12' column='1' id='type-id-281'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_CPUFLAG_SSE3' value='0'/>
      <enumerator name='RTE_CPUFLAG_PCLMULQDQ' value='1'/>
      <enumerator name='RTE_CPUFLAG_DTES64' value='2'/>
      <enumerator name='RTE_CPUFLAG_MONITOR' value='3'/>
      <enumerator name='RTE_CPUFLAG_DS_CPL' value='4'/>
      <enumerator name='RTE_CPUFLAG_VMX' value='5'/>
      <enumerator name='RTE_CPUFLAG_SMX' value='6'/>
      <enumerator name='RTE_CPUFLAG_EIST' value='7'/>
      <enumerator name='RTE_CPUFLAG_TM2' value='8'/>
      <enumerator name='RTE_CPUFLAG_SSSE3' value='9'/>
      <enumerator name='RTE_CPUFLAG_CNXT_ID' value='10'/>
      <enumerator name='RTE_CPUFLAG_FMA' value='11'/>
      <enumerator name='RTE_CPUFLAG_CMPXCHG16B' value='12'/>
      <enumerator name='RTE_CPUFLAG_XTPR' value='13'/>
      <enumerator name='RTE_CPUFLAG_PDCM' value='14'/>
      <enumerator name='RTE_CPUFLAG_PCID' value='15'/>
      <enumerator name='RTE_CPUFLAG_DCA' value='16'/>
      <enumerator name='RTE_CPUFLAG_SSE4_1' value='17'/>
      <enumerator name='RTE_CPUFLAG_SSE4_2' value='18'/>
      <enumerator name='RTE_CPUFLAG_X2APIC' value='19'/>
      <enumerator name='RTE_CPUFLAG_MOVBE' value='20'/>
      <enumerator name='RTE_CPUFLAG_POPCNT' value='21'/>
      <enumerator name='RTE_CPUFLAG_TSC_DEADLINE' value='22'/>
      <enumerator name='RTE_CPUFLAG_AES' value='23'/>
      <enumerator name='RTE_CPUFLAG_XSAVE' value='24'/>
      <enumerator name='RTE_CPUFLAG_OSXSAVE' value='25'/>
      <enumerator name='RTE_CPUFLAG_AVX' value='26'/>
      <enumerator name='RTE_CPUFLAG_F16C' value='27'/>
      <enumerator name='RTE_CPUFLAG_RDRAND' value='28'/>
      <enumerator name='RTE_CPUFLAG_HYPERVISOR' value='29'/>
      <enumerator name='RTE_CPUFLAG_FPU' value='30'/>
      <enumerator name='RTE_CPUFLAG_VME' value='31'/>
      <enumerator name='RTE_CPUFLAG_DE' value='32'/>
      <enumerator name='RTE_CPUFLAG_PSE' value='33'/>
      <enumerator name='RTE_CPUFLAG_TSC' value='34'/>
      <enumerator name='RTE_CPUFLAG_MSR' value='35'/>
      <enumerator name='RTE_CPUFLAG_PAE' value='36'/>
      <enumerator name='RTE_CPUFLAG_MCE' value='37'/>
      <enumerator name='RTE_CPUFLAG_CX8' value='38'/>
      <enumerator name='RTE_CPUFLAG_APIC' value='39'/>
      <enumerator name='RTE_CPUFLAG_SEP' value='40'/>
      <enumerator name='RTE_CPUFLAG_MTRR' value='41'/>
      <enumerator name='RTE_CPUFLAG_PGE' value='42'/>
      <enumerator name='RTE_CPUFLAG_MCA' value='43'/>
      <enumerator name='RTE_CPUFLAG_CMOV' value='44'/>
      <enumerator name='RTE_CPUFLAG_PAT' value='45'/>
      <enumerator name='RTE_CPUFLAG_PSE36' value='46'/>
      <enumerator name='RTE_CPUFLAG_PSN' value='47'/>
      <enumerator name='RTE_CPUFLAG_CLFSH' value='48'/>
      <enumerator name='RTE_CPUFLAG_DS' value='49'/>
      <enumerator name='RTE_CPUFLAG_ACPI' value='50'/>
      <enumerator name='RTE_CPUFLAG_MMX' value='51'/>
      <enumerator name='RTE_CPUFLAG_FXSR' value='52'/>
      <enumerator name='RTE_CPUFLAG_SSE' value='53'/>
      <enumerator name='RTE_CPUFLAG_SSE2' value='54'/>
      <enumerator name='RTE_CPUFLAG_SS' value='55'/>
      <enumerator name='RTE_CPUFLAG_HTT' value='56'/>
      <enumerator name='RTE_CPUFLAG_TM' value='57'/>
      <enumerator name='RTE_CPUFLAG_PBE' value='58'/>
      <enumerator name='RTE_CPUFLAG_DIGTEMP' value='59'/>
      <enumerator name='RTE_CPUFLAG_TRBOBST' value='60'/>
      <enumerator name='RTE_CPUFLAG_ARAT' value='61'/>
      <enumerator name='RTE_CPUFLAG_PLN' value='62'/>
      <enumerator name='RTE_CPUFLAG_ECMD' value='63'/>
      <enumerator name='RTE_CPUFLAG_PTM' value='64'/>
      <enumerator name='RTE_CPUFLAG_MPERF_APERF_MSR' value='65'/>
      <enumerator name='RTE_CPUFLAG_ACNT2' value='66'/>
      <enumerator name='RTE_CPUFLAG_ENERGY_EFF' value='67'/>
      <enumerator name='RTE_CPUFLAG_FSGSBASE' value='68'/>
      <enumerator name='RTE_CPUFLAG_BMI1' value='69'/>
      <enumerator name='RTE_CPUFLAG_HLE' value='70'/>
      <enumerator name='RTE_CPUFLAG_AVX2' value='71'/>
      <enumerator name='RTE_CPUFLAG_SMEP' value='72'/>
      <enumerator name='RTE_CPUFLAG_BMI2' value='73'/>
      <enumerator name='RTE_CPUFLAG_ERMS' value='74'/>
      <enumerator name='RTE_CPUFLAG_INVPCID' value='75'/>
      <enumerator name='RTE_CPUFLAG_RTM' value='76'/>
      <enumerator name='RTE_CPUFLAG_AVX512F' value='77'/>
      <enumerator name='RTE_CPUFLAG_RDSEED' value='78'/>
      <enumerator name='RTE_CPUFLAG_LAHF_SAHF' value='79'/>
      <enumerator name='RTE_CPUFLAG_LZCNT' value='80'/>
      <enumerator name='RTE_CPUFLAG_SYSCALL' value='81'/>
      <enumerator name='RTE_CPUFLAG_XD' value='82'/>
      <enumerator name='RTE_CPUFLAG_1GB_PG' value='83'/>
      <enumerator name='RTE_CPUFLAG_RDTSCP' value='84'/>
      <enumerator name='RTE_CPUFLAG_EM64T' value='85'/>
      <enumerator name='RTE_CPUFLAG_INVTSC' value='86'/>
      <enumerator name='RTE_CPUFLAG_NUMFLAGS' value='87'/>
    </enum-decl>
    <function-decl name='rte_cpu_get_flag_name' mangled-name='rte_cpu_get_flag_name' filepath='../lib/librte_eal/common/arch/x86/rte_cpuflags.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_cpu_get_flag_name@@DPDK_20.0'>
      <parameter type-id='type-id-281' name='feature' filepath='../lib/librte_eal/common/arch/x86/rte_cpuflags.c' line='156' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='rte_cpu_get_flag_enabled' mangled-name='rte_cpu_get_flag_enabled' filepath='../lib/librte_eal/common/arch/x86/rte_cpuflags.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_cpu_get_flag_enabled@@DPDK_20.0'>
      <parameter type-id='type-id-281' name='feature' filepath='../lib/librte_eal/common/arch/x86/rte_cpuflags.c' line='126' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/common/arch/x86/rte_hypervisor.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_hypervisor_get' mangled-name='rte_hypervisor_get' filepath='../lib/librte_eal/common/arch/x86/rte_hypervisor.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_hypervisor_get@@DPDK_20.0'>
      <return type-id='type-id-127'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal_alarm.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <typedef-decl name='rte_eal_alarm_callback' type-id='type-id-283' filepath='../lib/librte_eal/common/include/rte_alarm.h' line='26' column='1' id='type-id-284'/>
    <function-decl name='rte_eal_alarm_cancel' mangled-name='rte_eal_alarm_cancel' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_alarm_cancel@@DPDK_20.0'>
      <parameter type-id='type-id-284' name='cb_fn' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='179' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='179' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_alarm_set' mangled-name='rte_eal_alarm_set' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_alarm_set@@DPDK_20.0'>
      <parameter type-id='type-id-55' name='us' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='116' column='1'/>
      <parameter type-id='type-id-284' name='cb_fn' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='116' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/linux/eal/eal_alarm.c' line='116' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-282'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal_debug.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_exit' mangled-name='rte_exit' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_exit@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='exit_code' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='70' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='70' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='__rte_panic' mangled-name='__rte_panic' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__rte_panic@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='funcname' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='52' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='52' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_dump_registers' mangled-name='rte_dump_registers' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dump_registers@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_dump_stack' mangled-name='rte_dump_stack' filepath='../lib/librte_eal/linux/eal/eal_debug.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_dump_stack@@DPDK_20.0'>
      <return type-id='type-id-42'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal_interrupts.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-287' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-288' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-289' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-190' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-286'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-287'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='16384' id='type-id-288'>
      <subrange length='512' type-id='type-id-53' id='type-id-290'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-165' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-292' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-138' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-293' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-43' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-295' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-293'/>

    <array-type-def dimensions='1' type-id='type-id-291' size-in-bits='196608' id='type-id-289'>
      <subrange length='512' type-id='type-id-53' id='type-id-290'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-296'/>
    <function-decl name='rte_intr_cap_multiple' mangled-name='rte_intr_cap_multiple' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_cap_multiple@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1480' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_allow_others' mangled-name='rte_intr_allow_others' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_allow_others@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1480' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_dp_is_en' mangled-name='rte_intr_dp_is_en' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_dp_is_en@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1480' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_efd_disable' mangled-name='rte_intr_efd_disable' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_efd_disable@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1451' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_intr_efd_enable' mangled-name='rte_intr_efd_enable' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_efd_enable@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1413' column='1'/>
      <parameter type-id='type-id-138' name='nb_efd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1413' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_free_epoll_fd' mangled-name='rte_intr_free_epoll_fd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_free_epoll_fd@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1395' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='rte_intr_rx_ctl' mangled-name='rte_intr_rx_ctl' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_rx_ctl@@DPDK_20.0'>
      <parameter type-id='type-id-296' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1332' column='1'/>
      <parameter type-id='type-id-23' name='epfd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1332' column='1'/>
      <parameter type-id='type-id-23' name='op' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1333' column='1'/>
      <parameter type-id='type-id-112' name='vec' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1333' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1333' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-297'/>
    <function-decl name='rte_epoll_ctl' mangled-name='rte_epoll_ctl' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_epoll_ctl@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='epfd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1294' column='1'/>
      <parameter type-id='type-id-23' name='op' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1294' column='1'/>
      <parameter type-id='type-id-23' name='fd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1294' column='1'/>
      <parameter type-id='type-id-297' name='event' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1295' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_epoll_wait' mangled-name='rte_epoll_wait' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_epoll_wait@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='epfd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1243' column='1'/>
      <parameter type-id='type-id-297' name='events' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1243' column='1'/>
      <parameter type-id='type-id-23' name='maxevents' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1244' column='1'/>
      <parameter type-id='type-id-23' name='timeout' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1244' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_tls_epfd' mangled-name='rte_intr_tls_epfd' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='1234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_tls_epfd@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-298'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <function-decl name='rte_intr_disable' mangled-name='rte_intr_disable' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_disable@@DPDK_20.0'>
      <parameter type-id='type-id-299' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='779' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_enable' mangled-name='rte_intr_enable' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_enable@@DPDK_20.0'>
      <parameter type-id='type-id-299' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='779' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <typedef-decl name='rte_intr_callback_fn' type-id='type-id-283' filepath='../lib/librte_eal/common/include/rte_interrupts.h' line='26' column='1' id='type-id-300'/>
    <function-decl name='rte_intr_callback_unregister' mangled-name='rte_intr_callback_unregister' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_callback_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-299' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='599' column='1'/>
      <parameter type-id='type-id-300' name='cb_fn' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='600' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='600' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_callback_register' mangled-name='rte_intr_callback_register' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_callback_register@@DPDK_20.0'>
      <parameter type-id='type-id-299' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='599' column='1'/>
      <parameter type-id='type-id-300' name='cb_fn' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='600' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='600' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_intr_ack' mangled-name='rte_intr_ack' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_ack@@EXPERIMENTAL'>
      <parameter type-id='type-id-299' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='779' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <typedef-decl name='rte_intr_unregister_callback_fn' type-id='type-id-302' filepath='../lib/librte_eal/common/include/rte_interrupts.h' line='32' column='1' id='type-id-303'/>
    <function-decl name='rte_intr_callback_unregister_pending' mangled-name='rte_intr_callback_unregister_pending' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_intr_callback_unregister_pending@@EXPERIMENTAL'>
      <parameter type-id='type-id-299' name='intr_handle' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='548' column='1'/>
      <parameter type-id='type-id-300' name='cb_fn' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='549' column='1'/>
      <parameter type-id='type-id-43' name='cb_arg' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='549' column='1'/>
      <parameter type-id='type-id-303' name='ucb_fn' filepath='../lib/librte_eal/linux/eal/eal_interrupts.c' line='550' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-294'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-301'>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal_thread.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='per_lcore__lcore_id' type-id='type-id-112' mangled-name='per_lcore__lcore_id' visibility='default' filepath='../lib/librte_eal/common/include/rte_lcore.h' line='25' column='1' elf-symbol-id='per_lcore__lcore_id@@DPDK_20.0'/>
    <var-decl name='per_lcore__cpuset' type-id='type-id-136' visibility='default' filepath='../lib/librte_eal/common/include/rte_lcore.h' line='26' column='1'/>
    <function-decl name='rte_thread_setname' mangled-name='rte_thread_setname' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_thread_setname@@DPDK_20.0'>
      <parameter type-id='type-id-233' name='id' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='177' column='1'/>
      <parameter type-id='type-id-5' name='name' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='177' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_sys_gettid' mangled-name='rte_sys_gettid' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sys_gettid@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_remote_launch' mangled-name='rte_eal_remote_launch' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_remote_launch@@DPDK_20.0'>
      <parameter type-id='type-id-70' name='f' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='37' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='37' column='1'/>
      <parameter type-id='type-id-112' name='slave_id' filepath='../lib/librte_eal/linux/eal/eal_thread.c' line='37' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal_timer.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <enum-decl name='timer_source' filepath='../lib/librte_eal/common/include/generic/rte_cycles.h' line='24' column='1' id='type-id-304'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='EAL_TIMER_TSC' value='0'/>
      <enumerator name='EAL_TIMER_HPET' value='1'/>
    </enum-decl>
    <var-decl name='eal_timer_source' type-id='type-id-304' mangled-name='eal_timer_source' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_cycles.h' line='28' column='1' elf-symbol-id='eal_timer_source@@DPDK_20.0'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal_vfio.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_vfio_container_dma_unmap' mangled-name='rte_vfio_container_dma_unmap' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_container_dma_unmap@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1'/>
      <parameter type-id='type-id-55' name='vaddr' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1'/>
      <parameter type-id='type-id-55' name='iova' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1'/>
      <parameter type-id='type-id-55' name='len' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2027' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_container_dma_map' mangled-name='rte_vfio_container_dma_map' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_container_dma_map@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1'/>
      <parameter type-id='type-id-55' name='vaddr' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1'/>
      <parameter type-id='type-id-55' name='iova' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2026' column='1'/>
      <parameter type-id='type-id-55' name='len' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='2027' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_container_group_unbind' mangled-name='rte_vfio_container_group_unbind' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_container_group_unbind@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1967' column='1'/>
      <parameter type-id='type-id-23' name='iommu_group_num' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1967' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_container_group_bind' mangled-name='rte_vfio_container_group_bind' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1953' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_container_group_bind@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1953' column='1'/>
      <parameter type-id='type-id-23' name='iommu_group_num' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1953' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_container_destroy' mangled-name='rte_vfio_container_destroy' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_container_destroy@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1928' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_container_create' mangled-name='rte_vfio_container_create' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1903' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_container_create@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_noiommu_is_enabled' mangled-name='rte_vfio_noiommu_is_enabled' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_noiommu_is_enabled@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_get_group_num' mangled-name='rte_vfio_get_group_num' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_get_group_num@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='sysfs_base' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1195' column='1'/>
      <parameter type-id='type-id-5' name='dev_addr' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1196' column='1'/>
      <parameter type-id='type-id-190' name='iommu_group_num' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1196' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_get_container_fd' mangled-name='rte_vfio_get_container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_get_container_fd@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_is_enabled' mangled-name='rte_vfio_is_enabled' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_is_enabled@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='modname' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1017' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_enable' mangled-name='rte_vfio_enable' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_enable@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='modname' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='955' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_release_device' mangled-name='rte_vfio_release_device' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_release_device@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='sysfs_base' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='864' column='1'/>
      <parameter type-id='type-id-5' name='dev_addr' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='864' column='1'/>
      <parameter type-id='type-id-23' name='vfio_dev_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='865' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <class-decl name='vfio_device_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/local/include/linux/vfio.h' line='195' column='1' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argsz' type-id='type-id-306' visibility='default' filepath='/usr/local/include/linux/vfio.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-306' visibility='default' filepath='/usr/local/include/linux/vfio.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_regions' type-id='type-id-306' visibility='default' filepath='/usr/local/include/linux/vfio.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='num_irqs' type-id='type-id-306' visibility='default' filepath='/usr/local/include/linux/vfio.h' line='205' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__u32' type-id='type-id-112' filepath='/usr/local/include/asm-generic/int-ll64.h' line='27' column='1' id='type-id-306'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-307'/>
    <function-decl name='rte_vfio_setup_device' mangled-name='rte_vfio_setup_device' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_setup_device@@DPDK_20.0'>
      <parameter type-id='type-id-5' name='sysfs_base' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='639' column='1'/>
      <parameter type-id='type-id-5' name='dev_addr' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='639' column='1'/>
      <parameter type-id='type-id-190' name='vfio_dev_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='640' column='1'/>
      <parameter type-id='type-id-307' name='device_info' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='640' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_clear_group' mangled-name='rte_vfio_clear_group' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_clear_group@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='container_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='1928' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_vfio_get_group_fd' mangled-name='rte_vfio_get_group_fd' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_vfio_get_group_fd@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='iommu_group_num' filepath='../lib/librte_eal/linux/eal/eal_vfio.c' line='427' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_eal/linux/eal/eal.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='lcore_config' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='18' column='1' id='type-id-308'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thread_id' type-id='type-id-233' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pipe_master2slave' type-id='type-id-309' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pipe_slave2master' type-id='type-id-309' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f' type-id='type-id-310' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='arg' type-id='type-id-311' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ret' type-id='type-id-312' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='state' type-id='type-id-313' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='socket_id' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='core_id' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='core_index' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='core_role' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='detected' type-id='type-id-154' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cpuset' type-id='type-id-136' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='34' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='64' id='type-id-309'>
      <subrange length='2' type-id='type-id-53' id='type-id-314'/>

    </array-type-def>
    <typedef-decl name='lcore_function_t' type-id='type-id-69' filepath='../lib/librte_eal/common/include/rte_launch.h' line='30' column='1' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <qualified-type-def type-id='type-id-316' volatile='yes' id='type-id-310'/>
    <qualified-type-def type-id='type-id-43' volatile='yes' id='type-id-311'/>
    <qualified-type-def type-id='type-id-23' volatile='yes' id='type-id-312'/>
    <qualified-type-def type-id='type-id-128' volatile='yes' id='type-id-313'/>

    <array-type-def dimensions='1' type-id='type-id-308' size-in-bits='196608' id='type-id-317'>
      <subrange length='128' type-id='type-id-53' id='type-id-257'/>

    </array-type-def>
    <var-decl name='lcore_config' type-id='type-id-317' visibility='default' filepath='../lib/librte_eal/common/eal_private.h' line='37' column='1'/>
    <class-decl name='internal_config' size-in-bits='101760' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='39' column='1' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='memory' type-id='type-id-319' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='force_nchannel' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='force_nrank' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='no_hugetlbfs' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hugepage_unlink' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='no_pci' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='no_hpet' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vmware_tsc_map' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='no_shconf' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='in_memory' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='create_uio_dev' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='process_type' type-id='type-id-321' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='force_sockets' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='socket_mem' type-id='type-id-322' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='force_socket_limits' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='socket_limit' type-id='type-id-322' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='base_virtaddr' type-id='type-id-323' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='legacy_mem' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='match_allocations' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='single_file_segments' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='syslog_facility' type-id='type-id-312' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='vfio_intr_mode' type-id='type-id-324' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='hugefile_prefix' type-id='type-id-75' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='hugepage_dir' type-id='type-id-75' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='user_mbuf_pool_ops_name' type-id='type-id-75' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='num_hugepage_sizes' type-id='type-id-112' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='hugepage_info' type-id='type-id-325' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100608'>
        <var-decl name='iova_mode' type-id='type-id-2' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100672'>
        <var-decl name='ctrl_cpuset' type-id='type-id-136' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101696'>
        <var-decl name='init_complete' type-id='type-id-320' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-56' volatile='yes' id='type-id-319'/>
    <qualified-type-def type-id='type-id-112' volatile='yes' id='type-id-320'/>
    <enum-decl name='rte_proc_type_t' filepath='../lib/librte_eal/common/include/rte_eal.h' line='46' column='1' id='type-id-326'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_PROC_AUTO' value='-1'/>
      <enumerator name='RTE_PROC_PRIMARY' value='0'/>
      <enumerator name='RTE_PROC_SECONDARY' value='1'/>
      <enumerator name='RTE_PROC_INVALID' value='2'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-326' volatile='yes' id='type-id-321'/>
    <qualified-type-def type-id='type-id-55' volatile='yes' id='type-id-327'/>

    <array-type-def dimensions='1' type-id='type-id-327' size-in-bits='256' id='type-id-328'>
      <subrange length='4' type-id='type-id-53' id='type-id-329'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-328' volatile='yes' id='type-id-322'/>
    <typedef-decl name='uintptr_t' type-id='type-id-53' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-323'/>
    <enum-decl name='rte_intr_mode' filepath='../lib/librte_eal/common/include/rte_pci_dev_feature_defs.h' line='9' column='1' id='type-id-330'>
      <underlying-type type-id='type-id-1'/>
      <enumerator name='RTE_INTR_MODE_NONE' value='0'/>
      <enumerator name='RTE_INTR_MODE_LEGACY' value='1'/>
      <enumerator name='RTE_INTR_MODE_MSI' value='2'/>
      <enumerator name='RTE_INTR_MODE_MSIX' value='3'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-330' volatile='yes' id='type-id-324'/>
    <class-decl name='hugepage_info' size-in-bits='33024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='28' column='1' id='type-id-331'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hugepage_sz' type-id='type-id-55' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hugedir' type-id='type-id-332' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='num_pages' type-id='type-id-333' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='lock_descriptor' type-id='type-id-23' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='33' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='32768' id='type-id-332'>
      <subrange length='4096' type-id='type-id-53' id='type-id-334'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='128' id='type-id-333'>
      <subrange length='4' type-id='type-id-53' id='type-id-329'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-331' size-in-bits='99072' id='type-id-325'>
      <subrange length='3' type-id='type-id-53' id='type-id-335'/>

    </array-type-def>
    <var-decl name='internal_config' type-id='type-id-318' visibility='default' filepath='../lib/librte_eal/common/eal_internal_cfg.h' line='86' column='1'/>
    <var-decl name='rte_cycles_vmware_tsc_map' type-id='type-id-23' mangled-name='rte_cycles_vmware_tsc_map' visibility='default' filepath='../lib/librte_eal/linux/eal/eal.c' line='99' column='1' elf-symbol-id='rte_cycles_vmware_tsc_map@@DPDK_20.0'/>
    <function-decl name='rte_eal_vfio_intr_mode' mangled-name='rte_eal_vfio_intr_mode' filepath='../lib/librte_eal/linux/eal/eal.c' line='1355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_vfio_intr_mode@@DPDK_20.0'>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='rte_eal_create_uio_dev' mangled-name='rte_eal_create_uio_dev' filepath='../lib/librte_eal/linux/eal/eal.c' line='1349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_create_uio_dev@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_has_pci' mangled-name='rte_eal_has_pci' filepath='../lib/librte_eal/linux/eal/eal.c' line='1344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_has_pci@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_has_hugepages' mangled-name='rte_eal_has_hugepages' filepath='../lib/librte_eal/linux/eal/eal.c' line='1339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_has_hugepages@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_process_type' mangled-name='rte_eal_process_type' filepath='../lib/librte_eal/linux/eal/eal.c' line='1334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_process_type@@DPDK_20.0'>
      <return type-id='type-id-326'/>
    </function-decl>
    <function-decl name='rte_eal_cleanup' mangled-name='rte_eal_cleanup' filepath='../lib/librte_eal/linux/eal/eal.c' line='1320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_cleanup@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_init' mangled-name='rte_eal_init' filepath='../lib/librte_eal/linux/eal/eal.c' line='960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_init@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='argc' filepath='../lib/librte_eal/linux/eal/eal.c' line='960' column='1'/>
      <parameter type-id='type-id-219' name='argv' filepath='../lib/librte_eal/linux/eal/eal.c' line='960' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_eal_iopl_init' mangled-name='rte_eal_iopl_init' filepath='../lib/librte_eal/linux/eal/eal.c' line='906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eal_iopl_init@@DPDK_20.0'>
      <return type-id='type-id-23'/>
    </function-decl>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
