<abi-corpus path='gcc//lib/librte_bitratestats.so.20.0' architecture='elf-amd-x86_64' soname='librte_bitratestats.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_metrics.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_stats_bitrate_calc' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_stats_bitrate_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_stats_bitrate_reg' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_bitratestats/rte_bitrate.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='rte_stats_bitrates' size-in-bits='16448' is-struct='yes' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='26' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port_stats' type-id='type-id-3' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='id_stats_set' type-id='type-id-4' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_stats_bitrate' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='15' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='last_ibytes' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last_obytes' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='peak_ibits' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='peak_obits' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mean_ibits' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mean_obits' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ewma_ibits' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ewma_obits' type-id='type-id-6' visibility='default' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='23' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-7'/>
    <typedef-decl name='__uint64_t' type-id='type-id-7' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-8'/>
    <typedef-decl name='uint64_t' type-id='type-id-8' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-6'/>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='16384' id='type-id-3'>
      <subrange length='32' type-id='type-id-7' id='type-id-9'/>

    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-10'/>
    <typedef-decl name='__uint16_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-11'/>
    <typedef-decl name='uint16_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-4'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-12'/>
    <function-decl name='rte_stats_bitrate_calc' mangled-name='rte_stats_bitrate_calc' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_stats_bitrate_calc@@DPDK_20.0'>
      <parameter type-id='type-id-12' name='bitrate_data' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='58' column='1'/>
      <parameter type-id='type-id-4' name='port_id' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='59' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_stats_bitrate_reg' mangled-name='rte_stats_bitrate_reg' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_stats_bitrate_reg@@DPDK_20.0'>
      <parameter type-id='type-id-12' name='bitrate_data' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='39' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_stats_bitrate_create' mangled-name='rte_stats_bitrate_create' filepath='../lib/librte_bitratestats/rte_bitrate.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_stats_bitrate_create@@DPDK_20.0'>
      <return type-id='type-id-12'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
