<abi-corpus path='gcc//lib/librte_sched.so.20.0' architecture='elf-amd-x86_64' soname='librte_sched.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_approx' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_red_config_init' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_red_rt_data_init' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_pipe_config' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_config' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_dequeue' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_enqueue' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_get_memory_footprint' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_pkt_read_color' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_pkt_read_tree_path' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_port_pkt_write' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_queue_read_stats' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_subport_config' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_subport_pipe_profile_add' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_sched_subport_read_stats' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='rte_red_log2_1_minus_Wq' size='24' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_red_pow2_frac_inv' size='32' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_red_rand_seed' size='4' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_red_rand_val' size='4' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_sched/rte_sched.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='rte_sched_port' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='207' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_subports_per_port' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='n_pipes_per_subport' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_pipes_per_subport_log2' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pipe_queue' type-id='type-id-4' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='pipe_tc' type-id='type-id-5' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='tc_queue' type-id='type-id-5' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rate' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mtu' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='frame_overhead' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='socket' type-id='type-id-1' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='time_cpu_cycles' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='time_cpu_bytes' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='time' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='inv_cycles_per_byte' type-id='type-id-7' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='pkts_out' type-id='type-id-8' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='n_pkts_out' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='subport_id' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='subports' type-id='type-id-9' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='232' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
    <typedef-decl name='__uint32_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-11'/>
    <typedef-decl name='uint32_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-12'/>
    <typedef-decl name='__uint16_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-13'/>
    <typedef-decl name='uint16_t' type-id='type-id-13' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-14'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-15'/>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='208' id='type-id-4'>
      <subrange length='13' type-id='type-id-15' id='type-id-16'/>

    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-17'/>
    <typedef-decl name='__uint8_t' type-id='type-id-17' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-18'/>
    <typedef-decl name='uint8_t' type-id='type-id-18' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-19'/>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-15' id='type-id-20'/>

    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-21'/>
    <typedef-decl name='uint64_t' type-id='type-id-21' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-6'/>
    <class-decl name='rte_reciprocal' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='30' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sh1' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='sh2' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_reciprocal.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-23' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-24' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-23' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-3' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-23' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-27' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-28' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-3' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-29' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-30' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-24'/>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='infinite' id='type-id-32'>
      <subrange length='infinite' type-id='type-id-15' id='type-id-33'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-32' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-23'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-25'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-34' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-34' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_iova_t' type-id='type-id-6' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-34'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-35'>
      <subrange length='infinite' type-id='type-id-15' id='type-id-33'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-35' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-26'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-37' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-10' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-40' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-41' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-42' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-43' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-44'/>

    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='256' id='type-id-37'>
      <subrange length='32' type-id='type-id-15' id='type-id-45'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-38'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-37' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-48' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-40' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-47'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-49' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-34' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-6' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-49'/>
    <typedef-decl name='size_t' type-id='type-id-15' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-48'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-50'/>
    <typedef-decl name='int32_t' type-id='type-id-50' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-40'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-39'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-53' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='98304' id='type-id-53'>
      <subrange length='1536' type-id='type-id-15' id='type-id-54'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-41'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-55' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-56' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-58' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-27' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-59' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-55' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-27'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-59'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-34' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-60' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-61' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-63' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-27' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-48' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-65' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-60' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-60'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-64'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-34' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-66' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-28'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-69' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-24' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-70' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-72' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-69'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-70' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-74' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-75'/>
    <typedef-decl name='__int16_t' type-id='type-id-75' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-76'/>
    <typedef-decl name='int16_t' type-id='type-id-76' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-77'/>
    <qualified-type-def type-id='type-id-77' volatile='yes' id='type-id-74'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-73' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-70'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-29'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-30'>
      <subrange length='2' type-id='type-id-15' id='type-id-78'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-8'/>
    <class-decl name='rte_sched_subport' size-in-bits='26112' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='141' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tb_time' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tb_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tb_credits_per_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tb_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tb_credits' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tc_time' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tc_credits_per_period' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tc_credits' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tc_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tc_ov_wm' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tc_ov_wm_min' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tc_ov_wm_max' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tc_ov_period_id' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2312'>
        <var-decl name='tc_ov' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tc_ov_n' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tc_ov_rate' type-id='type-id-81' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='stats' type-id='type-id-82' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='n_pipes_per_subport_enabled' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='n_pipe_profiles' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='n_max_pipe_profiles' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='pipe_tc_be_rate_max' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='qsize' type-id='type-id-4' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='pipe_loop' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='pipe_exhaustion' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='bmp' type-id='type-id-83' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='grinder_base_bmp_pos' type-id='type-id-84' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='grinder' type-id='type-id-85' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24704'>
        <var-decl name='busy_grinders' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24736'>
        <var-decl name='qsize_add' type-id='type-id-86' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25248'>
        <var-decl name='qsize_sum' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25280'>
        <var-decl name='pipe' type-id='type-id-87' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25344'>
        <var-decl name='queue' type-id='type-id-88' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25408'>
        <var-decl name='queue_extra' type-id='type-id-89' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25472'>
        <var-decl name='pipe_profiles' type-id='type-id-90' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='bmp_array' type-id='type-id-91' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='queue_array' type-id='type-id-8' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26112'>
        <var-decl name='memory' type-id='type-id-92' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='204' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='832' id='type-id-80'>
      <subrange length='13' type-id='type-id-15' id='type-id-16'/>

    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-81'/>
    <class-decl name='rte_sched_subport_stats' size-in-bits='3328' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='196' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_pkts_tc' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='n_pkts_tc_dropped' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='n_bytes_tc' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='n_bytes_tc_dropped' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='207' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_bitmap' size-in-bits='320' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='61' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='array1' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='array2' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='array1_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='array2_size' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='index1' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='offset1' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='index2' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='go2' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memory' type-id='type-id-92' visibility='default' filepath='../lib/librte_eal/common/include/rte_bitmap.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-94'/>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='infinite' id='type-id-92'>
      <subrange length='infinite' type-id='type-id-15' id='type-id-33'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-83'/>

    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='256' id='type-id-84'>
      <subrange length='8' type-id='type-id-15' id='type-id-95'/>

    </array-type-def>
    <class-decl name='rte_sched_grinder' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='104' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pcache_qmask' type-id='type-id-97' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pcache_qindex' type-id='type-id-98' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pcache_w' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pcache_r' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='state' type-id='type-id-99' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='productive' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pindex' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='subport' type-id='type-id-100' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pipe' type-id='type-id-87' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pipe_params' type-id='type-id-90' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tccache_qmask' type-id='type-id-101' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tccache_qindex' type-id='type-id-102' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='tccache_w' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tccache_r' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='tc_index' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='queue' type-id='type-id-103' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='qbase' type-id='type-id-104' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='qindex' type-id='type-id-98' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='qsize' type-id='type-id-14' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='qmask' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='qpos' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pkt' type-id='type-id-28' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='wrr_tokens' type-id='type-id-97' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='wrr_mask' type-id='type-id-97' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='wrr_cost' type-id='type-id-105' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='138' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='64' id='type-id-97'>
      <subrange length='4' type-id='type-id-15' id='type-id-106'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' id='type-id-98'>
      <subrange length='4' type-id='type-id-15' id='type-id-106'/>

    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-107'/>
    <enum-decl name='grinder_state' filepath='../lib/librte_sched/rte_sched.c' line='97' column='1' id='type-id-99'>
      <underlying-type type-id='type-id-107'/>
      <enumerator name='e_GRINDER_PREFETCH_PIPE' value='0'/>
      <enumerator name='e_GRINDER_PREFETCH_TC_QUEUE_ARRAYS' value='1'/>
      <enumerator name='e_GRINDER_PREFETCH_MBUF' value='2'/>
      <enumerator name='e_GRINDER_READ_MBUF' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-100'/>
    <class-decl name='rte_sched_pipe' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='65' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tb_time' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tb_credits' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='profile' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tc_time' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tc_credits' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='wrr_tokens' type-id='type-id-105' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tc_ov_credits' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tc_ov_period_id' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='82' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='32' id='type-id-105'>
      <subrange length='4' type-id='type-id-15' id='type-id-106'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-87'/>
    <class-decl name='rte_sched_pipe_profile' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='50' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tb_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tb_credits_per_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tb_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tc_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tc_credits_per_period' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tc_ov_weight' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='wrr_cost' type-id='type-id-105' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-90'/>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='104' id='type-id-101'>
      <subrange length='13' type-id='type-id-15' id='type-id-16'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='416' id='type-id-102'>
      <subrange length='13' type-id='type-id-15' id='type-id-16'/>

    </array-type-def>
    <class-decl name='rte_sched_queue' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='85' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qw' type-id='type-id-14' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qr' type-id='type-id-14' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-88'/>

    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='256' id='type-id-103'>
      <subrange length='4' type-id='type-id-15' id='type-id-106'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='256' id='type-id-104'>
      <subrange length='4' type-id='type-id-15' id='type-id-106'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='17920' id='type-id-85'>
      <subrange length='8' type-id='type-id-15' id='type-id-95'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='512' id='type-id-86'>
      <subrange length='16' type-id='type-id-15' id='type-id-20'/>

    </array-type-def>
    <class-decl name='rte_sched_queue_extra' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='90' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stats' type-id='type-id-112' visibility='default' filepath='../lib/librte_sched/rte_sched.c' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_sched_queue_stats' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='216' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_pkts' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_pkts_dropped' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='n_bytes' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n_bytes_dropped' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-91'/>

    <array-type-def dimensions='1' type-id='type-id-100' size-in-bits='infinite' id='type-id-9'>
      <subrange length='infinite' type-id='type-id-15' id='type-id-33'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-113'/>
    <function-decl name='rte_sched_port_dequeue' mangled-name='rte_sched_port_dequeue' filepath='../lib/librte_sched/rte_sched.c' line='2711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_dequeue@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='2711' column='1'/>
      <parameter type-id='type-id-8' name='pkts' filepath='../lib/librte_sched/rte_sched.c' line='2711' column='1'/>
      <parameter type-id='type-id-3' name='n_pkts' filepath='../lib/librte_sched/rte_sched.c' line='2711' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_sched_port_enqueue' mangled-name='rte_sched_port_enqueue' filepath='../lib/librte_sched/rte_sched.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_enqueue@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1767' column='1'/>
      <parameter type-id='type-id-8' name='pkts' filepath='../lib/librte_sched/rte_sched.c' line='1767' column='1'/>
      <parameter type-id='type-id-3' name='n_pkts' filepath='../lib/librte_sched/rte_sched.c' line='1768' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-115'/>
    <function-decl name='rte_sched_queue_read_stats' mangled-name='rte_sched_queue_read_stats' filepath='../lib/librte_sched/rte_sched.c' line='1433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_queue_read_stats@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1433' column='1'/>
      <parameter type-id='type-id-3' name='queue_id' filepath='../lib/librte_sched/rte_sched.c' line='1434' column='1'/>
      <parameter type-id='type-id-114' name='stats' filepath='../lib/librte_sched/rte_sched.c' line='1435' column='1'/>
      <parameter type-id='type-id-115' name='qlen' filepath='../lib/librte_sched/rte_sched.c' line='1436' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-117'/>
    <function-decl name='rte_sched_subport_read_stats' mangled-name='rte_sched_subport_read_stats' filepath='../lib/librte_sched/rte_sched.c' line='1388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_subport_read_stats@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1388' column='1'/>
      <parameter type-id='type-id-3' name='subport_id' filepath='../lib/librte_sched/rte_sched.c' line='1389' column='1'/>
      <parameter type-id='type-id-116' name='stats' filepath='../lib/librte_sched/rte_sched.c' line='1390' column='1'/>
      <parameter type-id='type-id-117' name='tc_ov' filepath='../lib/librte_sched/rte_sched.c' line='1391' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='rte_color' filepath='../lib/librte_meter/rte_meter.h' line='36' column='1' id='type-id-118'>
      <underlying-type type-id='type-id-107'/>
      <enumerator name='RTE_COLOR_GREEN' value='0'/>
      <enumerator name='RTE_COLOR_YELLOW' value='1'/>
      <enumerator name='RTE_COLOR_RED' value='2'/>
      <enumerator name='RTE_COLORS' value='3'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <function-decl name='rte_sched_port_pkt_read_color' mangled-name='rte_sched_port_pkt_read_color' filepath='../lib/librte_sched/rte_sched.c' line='1382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_pkt_read_color@@DPDK_20.0'>
      <parameter type-id='type-id-120' name='pkt' filepath='../lib/librte_sched/rte_sched.c' line='1382' column='1'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='rte_sched_port_pkt_read_tree_path' mangled-name='rte_sched_port_pkt_read_tree_path' filepath='../lib/librte_sched/rte_sched.c' line='1367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_pkt_read_tree_path@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1367' column='1'/>
      <parameter type-id='type-id-120' name='pkt' filepath='../lib/librte_sched/rte_sched.c' line='1368' column='1'/>
      <parameter type-id='type-id-117' name='subport' filepath='../lib/librte_sched/rte_sched.c' line='1369' column='1'/>
      <parameter type-id='type-id-117' name='pipe' filepath='../lib/librte_sched/rte_sched.c' line='1369' column='1'/>
      <parameter type-id='type-id-117' name='traffic_class' filepath='../lib/librte_sched/rte_sched.c' line='1370' column='1'/>
      <parameter type-id='type-id-117' name='queue' filepath='../lib/librte_sched/rte_sched.c' line='1370' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='rte_sched_port_pkt_write' mangled-name='rte_sched_port_pkt_write' filepath='../lib/librte_sched/rte_sched.c' line='1354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_pkt_write@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1354' column='1'/>
      <parameter type-id='type-id-28' name='pkt' filepath='../lib/librte_sched/rte_sched.c' line='1355' column='1'/>
      <parameter type-id='type-id-3' name='subport' filepath='../lib/librte_sched/rte_sched.c' line='1356' column='1'/>
      <parameter type-id='type-id-3' name='pipe' filepath='../lib/librte_sched/rte_sched.c' line='1356' column='1'/>
      <parameter type-id='type-id-3' name='traffic_class' filepath='../lib/librte_sched/rte_sched.c' line='1357' column='1'/>
      <parameter type-id='type-id-3' name='queue' filepath='../lib/librte_sched/rte_sched.c' line='1358' column='1'/>
      <parameter type-id='type-id-118' name='color' filepath='../lib/librte_sched/rte_sched.c' line='1358' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='rte_sched_pipe_config' mangled-name='rte_sched_pipe_config' filepath='../lib/librte_sched/rte_sched.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_pipe_config@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1155' column='1'/>
      <parameter type-id='type-id-3' name='subport_id' filepath='../lib/librte_sched/rte_sched.c' line='1156' column='1'/>
      <parameter type-id='type-id-3' name='pipe_id' filepath='../lib/librte_sched/rte_sched.c' line='1157' column='1'/>
      <parameter type-id='type-id-40' name='pipe_profile' filepath='../lib/librte_sched/rte_sched.c' line='1158' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_sched_subport_params' size-in-bits='1408' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='151' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tb_rate' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tb_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tc_rate' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tc_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='n_pipes_per_subport_enabled' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='qsize' type-id='type-id-4' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='pipe_profiles' type-id='type-id-122' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='n_pipe_profiles' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='n_max_pipe_profiles' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_sched_pipe_params' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='122' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tb_rate' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tb_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tc_rate' type-id='type-id-80' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tc_period' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tc_ov_weight' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1032'>
        <var-decl name='wrr_weights' type-id='type-id-105' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-124'/>
    <function-decl name='rte_sched_subport_config' mangled-name='rte_sched_subport_config' filepath='../lib/librte_sched/rte_sched.c' line='966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_subport_config@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='966' column='1'/>
      <parameter type-id='type-id-3' name='subport_id' filepath='../lib/librte_sched/rte_sched.c' line='967' column='1'/>
      <parameter type-id='type-id-124' name='params' filepath='../lib/librte_sched/rte_sched.c' line='968' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_sched_port_free' mangled-name='rte_sched_port_free' filepath='../lib/librte_sched/rte_sched.c' line='895' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_free@@DPDK_20.0'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='895' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <class-decl name='rte_sched_port_params' size-in-bits='320' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='236' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-126' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='socket' type-id='type-id-1' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rate' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtu' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='frame_overhead' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_subports_per_port' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='n_pipes_per_subport' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_sched.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-128'/>
    <function-decl name='rte_sched_port_config' mangled-name='rte_sched_port_config' filepath='../lib/librte_sched/rte_sched.c' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_config@@DPDK_20.0'>
      <parameter type-id='type-id-128' name='params' filepath='../lib/librte_sched/rte_sched.c' line='792' column='1'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-129'/>
    <function-decl name='rte_sched_port_get_memory_footprint' mangled-name='rte_sched_port_get_memory_footprint' filepath='../lib/librte_sched/rte_sched.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_port_get_memory_footprint@@DPDK_20.0'>
      <parameter type-id='type-id-128' name='port_params' filepath='../lib/librte_sched/rte_sched.c' line='749' column='1'/>
      <parameter type-id='type-id-129' name='subport_params' filepath='../lib/librte_sched/rte_sched.c' line='750' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_sched_subport_pipe_profile_add' mangled-name='rte_sched_subport_pipe_profile_add' filepath='../lib/librte_sched/rte_sched.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_sched_subport_pipe_profile_add@@EXPERIMENTAL'>
      <parameter type-id='type-id-113' name='port' filepath='../lib/librte_sched/rte_sched.c' line='1274' column='1'/>
      <parameter type-id='type-id-3' name='subport_id' filepath='../lib/librte_sched/rte_sched.c' line='1275' column='1'/>
      <parameter type-id='type-id-122' name='params' filepath='../lib/librte_sched/rte_sched.c' line='1276' column='1'/>
      <parameter type-id='type-id-117' name='pipe_profile_id' filepath='../lib/librte_sched/rte_sched.c' line='1277' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-66'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-71'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_sched/rte_red.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <var-decl name='rte_red_rand_val' type-id='type-id-3' mangled-name='rte_red_rand_val' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='41' column='1' elf-symbol-id='rte_red_rand_val@@DPDK_20.0'/>
    <var-decl name='rte_red_rand_seed' type-id='type-id-3' mangled-name='rte_red_rand_seed' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='42' column='1' elf-symbol-id='rte_red_rand_seed@@DPDK_20.0'/>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='192' id='type-id-130'>
      <subrange length='12' type-id='type-id-15' id='type-id-131'/>

    </array-type-def>
    <var-decl name='rte_red_log2_1_minus_Wq' type-id='type-id-130' mangled-name='rte_red_log2_1_minus_Wq' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='43' column='1' elf-symbol-id='rte_red_log2_1_minus_Wq@@DPDK_20.0'/>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='256' id='type-id-132'>
      <subrange length='16' type-id='type-id-15' id='type-id-20'/>

    </array-type-def>
    <var-decl name='rte_red_pow2_frac_inv' type-id='type-id-132' mangled-name='rte_red_pow2_frac_inv' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='44' column='1' elf-symbol-id='rte_red_pow2_frac_inv@@DPDK_20.0'/>
    <class-decl name='rte_red_config' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='60' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min_th' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_th' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pa_const' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='maxp_inv' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='wq_log2' type-id='type-id-19' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-135'/>
    <function-decl name='rte_red_config_init' mangled-name='rte_red_config_init' filepath='../lib/librte_sched/rte_red.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_red_config_init@@DPDK_20.0'>
      <parameter type-id='type-id-134' name='red_cfg' filepath='../lib/librte_sched/rte_red.c' line='84' column='1'/>
      <parameter type-id='type-id-135' name='wq_log2' filepath='../lib/librte_sched/rte_red.c' line='85' column='1'/>
      <parameter type-id='type-id-135' name='min_th' filepath='../lib/librte_sched/rte_red.c' line='86' column='1'/>
      <parameter type-id='type-id-135' name='max_th' filepath='../lib/librte_sched/rte_red.c' line='87' column='1'/>
      <parameter type-id='type-id-135' name='maxp_inv' filepath='../lib/librte_sched/rte_red.c' line='88' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_red' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='71' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avg' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='count' type-id='type-id-3' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='q_time' type-id='type-id-6' visibility='default' filepath='../lib/librte_sched/rte_red.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <function-decl name='rte_red_rt_data_init' mangled-name='rte_red_rt_data_init' filepath='../lib/librte_sched/rte_red.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_red_rt_data_init@@DPDK_20.0'>
      <parameter type-id='type-id-137' name='red' filepath='../lib/librte_sched/rte_red.c' line='72' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_sched/rte_approx.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_approx' mangled-name='rte_approx' filepath='../lib/librte_sched/rte_approx.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_approx@@DPDK_20.0'>
      <parameter type-id='type-id-81' name='alpha' filepath='../lib/librte_sched/rte_approx.c' line='142' column='1'/>
      <parameter type-id='type-id-81' name='d' filepath='../lib/librte_sched/rte_approx.c' line='142' column='1'/>
      <parameter type-id='type-id-117' name='p' filepath='../lib/librte_sched/rte_approx.c' line='142' column='1'/>
      <parameter type-id='type-id-117' name='q' filepath='../lib/librte_sched/rte_approx.c' line='142' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
