<abi-corpus path='gcc//lib/librte_ip_frag.so.20.0' architecture='elf-amd-x86_64' soname='librte_ip_frag.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_frag_table_del_expired_entries' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ip_frag_free_death_row' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ip_frag_table_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ip_frag_table_destroy' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ip_frag_table_statistics_dump' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ipv4_frag_reassemble_packet' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ipv4_fragment_packet' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ipv6_frag_reassemble_packet' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ipv6_fragment_packet' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-2'/>
    <typedef-decl name='int32_t' type-id='type-id-2' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-3'/>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-8' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-10' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-11' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-10' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-5' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-12' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-13' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-9' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-11' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-14' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-15' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-17'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-18'>
      <subrange length='infinite' type-id='type-id-17' id='type-id-19'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-18' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-5'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-7'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-20' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-20' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-17' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-21'/>
    <typedef-decl name='uint64_t' type-id='type-id-21' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-10'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-10' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-20'/>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='infinite' id='type-id-22'>
      <subrange length='infinite' type-id='type-id-17' id='type-id-19'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-22' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-8'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-23'/>
    <typedef-decl name='__uint16_t' type-id='type-id-23' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-24'/>
    <typedef-decl name='uint16_t' type-id='type-id-24' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-9'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-25'/>
    <typedef-decl name='__uint32_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-26'/>
    <typedef-decl name='uint32_t' type-id='type-id-26' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-11'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-28' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-3' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-31' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-32' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-33' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-34'/>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='256' id='type-id-28'>
      <subrange length='32' type-id='type-id-17' id='type-id-35'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-29'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-10' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-28' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-38' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-10' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-3' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-11' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-37'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-39' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-10' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-39'/>
    <typedef-decl name='size_t' type-id='type-id-17' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-38'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-30'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-42' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='98304' id='type-id-42'>
      <subrange length='1536' type-id='type-id-17' id='type-id-43'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-31'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-45' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-47' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-12' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-48' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-12'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-48'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-20' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-50' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-52' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-12' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-38' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-54' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-49'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-53'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-20' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-55' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-13'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-58' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-59' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-61' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-58'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-63' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-64'/>
    <typedef-decl name='__int16_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-65'/>
    <typedef-decl name='int16_t' type-id='type-id-65' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-66'/>
    <qualified-type-def type-id='type-id-66' volatile='yes' id='type-id-63'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-62' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-59'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-14'/>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='128' id='type-id-15'>
      <subrange length='2' type-id='type-id-17' id='type-id-67'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-68'/>
    <function-decl name='rte_ipv4_fragment_packet' mangled-name='rte_ipv4_fragment_packet' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ipv4_fragment_packet@@DPDK_20.0'>
      <parameter type-id='type-id-13' name='pkt_in' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='65' column='1'/>
      <parameter type-id='type-id-68' name='pkts_out' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='66' column='1'/>
      <parameter type-id='type-id-9' name='nb_pkts_out' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='67' column='1'/>
      <parameter type-id='type-id-9' name='mtu_size' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='68' column='1'/>
      <parameter type-id='type-id-12' name='pool_direct' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='69' column='1'/>
      <parameter type-id='type-id-12' name='pool_indirect' filepath='../lib/librte_ip_frag/rte_ipv4_fragmentation.c' line='70' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-55'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-60'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <function-decl name='rte_ipv6_fragment_packet' mangled-name='rte_ipv6_fragment_packet' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ipv6_fragment_packet@@DPDK_20.0'>
      <parameter type-id='type-id-13' name='pkt_in' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='68' column='1'/>
      <parameter type-id='type-id-68' name='pkts_out' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='69' column='1'/>
      <parameter type-id='type-id-9' name='nb_pkts_out' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='70' column='1'/>
      <parameter type-id='type-id-9' name='mtu_size' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='71' column='1'/>
      <parameter type-id='type-id-12' name='pool_direct' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='72' column='1'/>
      <parameter type-id='type-id-12' name='pool_indirect' filepath='../lib/librte_ip_frag/rte_ipv6_fragmentation.c' line='73' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ip_frag/rte_ipv4_reassembly.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_ip_frag_tbl' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='99' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_cycles' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entry_mask' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_entries' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='use_entries' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bucket_entries' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_entries' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='nb_buckets' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='last' type-id='type-id-70' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lru' type-id='type-id-71' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stat' type-id='type-id-72' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='pkt' type-id='type-id-73' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ip_frag_pkt' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='64' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lru' type-id='type-id-75' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key' type-id='type-id-76' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='total_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='frag_size' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='last_idx' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='frags' type-id='type-id-77' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='65' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-70' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-78' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-78'/>
    <class-decl name='ip_frag_key' size-in-bits='320' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='46' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_dst' type-id='type-id-79' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-80' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='256' id='type-id-79'>
      <subrange length='4' type-id='type-id-17' id='type-id-81'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='50' column='1' id='type-id-80'>
      <data-member access='private'>
        <var-decl name='id_key_len' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-82' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='53' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='key_len' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ip_frag' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='39' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ofs' type-id='type-id-9' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='len' type-id='type-id-9' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mb' type-id='type-id-13' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='42' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-83' size-in-bits='512' id='type-id-77'>
      <subrange length='4' type-id='type-id-17' id='type-id-81'/>

    </array-type-def>
    <class-decl name='ip_pkt_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='86' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-70' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-78' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ip_frag_tbl_stat' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='89' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='find_num' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='add_num' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='del_num' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reuse_num' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fail_total' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fail_nospace' type-id='type-id-10' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='95' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='infinite' id='type-id-73'>
      <subrange length='infinite' type-id='type-id-17' id='type-id-19'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-84'/>
    <class-decl name='rte_ip_frag_death_row' size-in-bits='10304' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='80' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='row' type-id='type-id-86' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='82' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='10240' id='type-id-86'>
      <subrange length='160' type-id='type-id-17' id='type-id-87'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-88'/>
    <class-decl name='rte_ipv4_hdr' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='33' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version_ihl' type-id='type-id-90' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='type_of_service' type-id='type-id-90' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_length' type-id='type-id-91' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='packet_id' type-id='type-id-91' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='fragment_offset' type-id='type-id-91' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='time_to_live' type-id='type-id-90' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='next_proto_id' type-id='type-id-90' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='hdr_checksum' type-id='type-id-91' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src_addr' type-id='type-id-92' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_addr' type-id='type-id-92' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-93'/>
    <typedef-decl name='__uint8_t' type-id='type-id-93' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-94'/>
    <typedef-decl name='uint8_t' type-id='type-id-94' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-90'/>
    <typedef-decl name='rte_be16_t' type-id='type-id-9' filepath='../lib/librte_eal/common/include/generic/rte_byteorder.h' line='110' column='1' id='type-id-91'/>
    <typedef-decl name='rte_be32_t' type-id='type-id-11' filepath='../lib/librte_eal/common/include/generic/rte_byteorder.h' line='111' column='1' id='type-id-92'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-95'/>
    <function-decl name='rte_ipv4_frag_reassemble_packet' mangled-name='rte_ipv4_frag_reassemble_packet' filepath='../lib/librte_ip_frag/rte_ipv4_reassembly.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ipv4_frag_reassemble_packet@@DPDK_20.0'>
      <parameter type-id='type-id-84' name='tbl' filepath='../lib/librte_ip_frag/rte_ipv4_reassembly.c' line='98' column='1'/>
      <parameter type-id='type-id-88' name='dr' filepath='../lib/librte_ip_frag/rte_ipv4_reassembly.c' line='99' column='1'/>
      <parameter type-id='type-id-13' name='mb' filepath='../lib/librte_ip_frag/rte_ipv4_reassembly.c' line='99' column='1'/>
      <parameter type-id='type-id-10' name='tms' filepath='../lib/librte_ip_frag/rte_ipv4_reassembly.c' line='99' column='1'/>
      <parameter type-id='type-id-95' name='ip_hdr' filepath='../lib/librte_ip_frag/rte_ipv4_reassembly.c' line='100' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ip_frag/rte_ipv6_reassembly.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_ipv6_hdr' size-in-bits='320' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='356' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtc_flow' type-id='type-id-92' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='payload_len' type-id='type-id-91' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='proto' type-id='type-id-90' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='hop_limits' type-id='type-id-90' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_addr' type-id='type-id-97' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dst_addr' type-id='type-id-97' visibility='default' filepath='../lib/librte_net/rte_ip.h' line='362' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-90' size-in-bits='128' id='type-id-97'>
      <subrange length='16' type-id='type-id-17' id='type-id-98'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-99'/>
    <class-decl name='ipv6_extension_fragment' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='129' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_header' type-id='type-id-90' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='type-id-90' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='frag_data' type-id='type-id-9' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='id' type-id='type-id-11' visibility='default' filepath='../lib/librte_ip_frag/rte_ip_frag.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <function-decl name='rte_ipv6_frag_reassemble_packet' mangled-name='rte_ipv6_frag_reassemble_packet' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ipv6_frag_reassemble_packet@@DPDK_20.0'>
      <parameter type-id='type-id-84' name='tbl' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='137' column='1'/>
      <parameter type-id='type-id-88' name='dr' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='138' column='1'/>
      <parameter type-id='type-id-13' name='mb' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='138' column='1'/>
      <parameter type-id='type-id-10' name='tms' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='138' column='1'/>
      <parameter type-id='type-id-99' name='ip_hdr' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='139' column='1'/>
      <parameter type-id='type-id-101' name='frag_hdr' filepath='../lib/librte_ip_frag/rte_ipv6_reassembly.c' line='139' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ip_frag/rte_ip_frag_common.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-104' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-105' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-106' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-107' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-108' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-109' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-110' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-111' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-112' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-105' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-103'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-105'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-115'/>
    <typedef-decl name='__off_t' type-id='type-id-115' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-106'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-107'/>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='8' id='type-id-108'>
      <subrange length='1' type-id='type-id-17' id='type-id-116'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-16' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-109'/>
    <typedef-decl name='__off64_t' type-id='type-id-115' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-110'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-111'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-112'/>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='160' id='type-id-113'>
      <subrange length='20' type-id='type-id-17' id='type-id-120'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-102' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <function-decl name='rte_ip_frag_table_statistics_dump' mangled-name='rte_ip_frag_table_statistics_dump' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ip_frag_table_statistics_dump@@DPDK_20.0'>
      <parameter type-id='type-id-122' name='f' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='98' column='1'/>
      <parameter type-id='type-id-124' name='tbl' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='98' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rte_ip_frag_table_destroy' mangled-name='rte_ip_frag_table_destroy' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ip_frag_table_destroy@@DPDK_20.0'>
      <parameter type-id='type-id-84' name='tbl' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='85' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rte_ip_frag_table_create' mangled-name='rte_ip_frag_table_create' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ip_frag_table_create@@DPDK_20.0'>
      <parameter type-id='type-id-11' name='bucket_num' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='41' column='1'/>
      <parameter type-id='type-id-11' name='bucket_entries' filepath='../lib/librte_ip_frag/rte_ip_frag_common.c' line='41' column='1'/>
