<abi-corpus path='gcc//lib/librte_ring.so.20.0' architecture='elf-amd-x86_64' soname='librte_ring.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_ring_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_dump' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_get_memsize' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_init' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_list_dump' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_lookup' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_ring_reset' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ring/rte_ring.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_ring' size-in-bits='3072' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='81' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memzone' type-id='type-id-4' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='capacity' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pad0' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='prod' type-id='type-id-7' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='pad1' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='cons' type-id='type-id-7' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad2' type-id='type-id-6' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-8'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='256' id='type-id-2'>
      <subrange length='32' type-id='type-id-8' id='type-id-9'/>

    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-13' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-14' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-11'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-15' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-16' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-17'/>
    <typedef-decl name='uint64_t' type-id='type-id-17' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-13'/>
    <typedef-decl name='phys_addr_t' type-id='type-id-13' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-15'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-13' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-16'/>
    <typedef-decl name='size_t' type-id='type-id-8' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-12'/>
    <typedef-decl name='__int32_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-18'/>
    <typedef-decl name='int32_t' type-id='type-id-18' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-14'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-19'/>
    <typedef-decl name='__uint32_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-20'/>
    <typedef-decl name='uint32_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-4'/>
    <class-decl name='rte_ring_headtail' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='65' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-22' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tail' type-id='type-id-22' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='single' type-id='type-id-5' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-5' volatile='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-23'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <function-decl name='rte_ring_lookup' mangled-name='rte_ring_lookup' filepath='../lib/librte_ring/rte_ring.c' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_lookup@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_ring/rte_ring.c' line='267' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <type-decl name='void' id='type-id-26'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-34' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-37' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-28'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-30'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-42'/>
    <typedef-decl name='__off_t' type-id='type-id-42' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-31'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-32'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-33'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' id='type-id-34'>
      <subrange length='1' type-id='type-id-8' id='type-id-43'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-26' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-35'/>
    <typedef-decl name='__off64_t' type-id='type-id-42' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-36'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-45'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-37'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-39'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-40'>
      <subrange length='20' type-id='type-id-8' id='type-id-47'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-27' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <function-decl name='rte_ring_list_dump' mangled-name='rte_ring_list_dump' filepath='../lib/librte_ring/rte_ring.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_list_dump@@DPDK_20.0'>
      <parameter type-id='type-id-49' name='f' filepath='../lib/librte_ring/rte_ring.c' line='249' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <function-decl name='rte_ring_dump' mangled-name='rte_ring_dump' filepath='../lib/librte_ring/rte_ring.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_dump@@DPDK_20.0'>
      <parameter type-id='type-id-49' name='f' filepath='../lib/librte_ring/rte_ring.c' line='233' column='1'/>
      <parameter type-id='type-id-51' name='r' filepath='../lib/librte_ring/rte_ring.c' line='233' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='rte_ring_free' mangled-name='rte_ring_free' filepath='../lib/librte_ring/rte_ring.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_free@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='r' filepath='../lib/librte_ring/rte_ring.c' line='187' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='rte_ring_create' mangled-name='rte_ring_create' filepath='../lib/librte_ring/rte_ring.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_create@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_ring/rte_ring.c' line='119' column='1'/>
      <parameter type-id='type-id-19' name='count' filepath='../lib/librte_ring/rte_ring.c' line='119' column='1'/>
      <parameter type-id='type-id-3' name='socket_id' filepath='../lib/librte_ring/rte_ring.c' line='119' column='1'/>
      <parameter type-id='type-id-19' name='flags' filepath='../lib/librte_ring/rte_ring.c' line='120' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rte_ring_init' mangled-name='rte_ring_init' filepath='../lib/librte_ring/rte_ring.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_init@@DPDK_20.0'>
      <parameter type-id='type-id-23' name='r' filepath='../lib/librte_ring/rte_ring.c' line='74' column='1'/>
      <parameter type-id='type-id-25' name='name' filepath='../lib/librte_ring/rte_ring.c' line='74' column='1'/>
      <parameter type-id='type-id-19' name='count' filepath='../lib/librte_ring/rte_ring.c' line='74' column='1'/>
      <parameter type-id='type-id-19' name='flags' filepath='../lib/librte_ring/rte_ring.c' line='75' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-42' filepath='/usr/include/bits/types.h' line='193' column='1' id='type-id-52'/>
    <typedef-decl name='ssize_t' type-id='type-id-52' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-53'/>
    <function-decl name='rte_ring_get_memsize' mangled-name='rte_ring_get_memsize' filepath='../lib/librte_ring/rte_ring.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_get_memsize@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='count' filepath='../lib/librte_ring/rte_ring.c' line='49' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rte_ring_reset' mangled-name='rte_ring_reset' filepath='../lib/librte_ring/rte_ring.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_ring_reset@@EXPERIMENTAL'>
      <parameter type-id='type-id-23' name='r' filepath='../lib/librte_ring/rte_ring.c' line='67' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
