<abi-corpus path='gcc//lib/librte_telemetry.so.0.200' architecture='elf-amd-x86_64' soname='librte_telemetry.so.0.200'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_metrics.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='libjansson.so.4'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_telemetry_cleanup' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_telemetry_init' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_telemetry_parse' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_telemetry_selftest' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_telemetry/rte_telemetry.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='telemetry_log_level' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='12' column='1'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-2'/>
    <typedef-decl name='int32_t' type-id='type-id-2' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-3'/>
    <function-decl name='rte_telemetry_selftest' mangled-name='rte_telemetry_selftest' filepath='../lib/librte_telemetry/rte_telemetry.c' line='1287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_telemetry_selftest@@EXPERIMENTAL'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_telemetry_cleanup' mangled-name='rte_telemetry_cleanup' filepath='../lib/librte_telemetry/rte_telemetry.c' line='1041' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_telemetry_cleanup@@EXPERIMENTAL'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rte_telemetry_init' mangled-name='rte_telemetry_init' filepath='../lib/librte_telemetry/rte_telemetry.c' line='973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_telemetry_init@@EXPERIMENTAL'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_telemetry/rte_telemetry_parser.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='telemetry_impl' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='35' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='accept_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='server_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread_status' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='socket_id' type-id='type-id-6' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reg_index' type-id='type-id-7' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='metrics_register_done' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='client_list_head' type-id='type-id-8' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='request_client' type-id='type-id-9' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='register_fail_count' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='pthread_t' type-id='type-id-10' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-5'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-11'/>
    <typedef-decl name='__uint32_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-12'/>
    <typedef-decl name='uint32_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-6'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1024' id='type-id-7'>
      <subrange length='32' type-id='type-id-10' id='type-id-13'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='43' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-9' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-14' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='telemetry_client' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='29' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_path' type-id='type-id-16' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='client_list' type-id='type-id-17' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-16'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='32' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-9' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-14' visibility='default' filepath='../lib/librte_telemetry/rte_telemetry_internal.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-19'/>
    <function-decl name='rte_telemetry_parse' mangled-name='rte_telemetry_parse' filepath='../lib/librte_telemetry/rte_telemetry_parser.c' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_telemetry_parse@@EXPERIMENTAL'>
      <parameter type-id='type-id-19' name='telemetry' filepath='../lib/librte_telemetry/rte_telemetry_parser.c' line='610' column='1'/>
      <parameter type-id='type-id-16' name='socket_rx_data' filepath='../lib/librte_telemetry/rte_telemetry_parser.c' line='610' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
