<abi-corpus path='gcc//lib/librte_security.so.20.0' architecture='elf-amd-x86_64' soname='librte_security.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_cryptodev.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_security_capabilities_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_capability_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_get_userdata' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_session_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_session_destroy' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_session_get_size' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_session_stats_get' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_session_update' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_security_set_pkt_metadata' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_security/rte_security.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_security_capability' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='554' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action' type-id='type-id-2' visibility='default' filepath='../lib/librte_security/rte_security.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-3' visibility='default' filepath='../lib/librte_security/rte_security.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='crypto_capabilities' type-id='type-id-5' visibility='default' filepath='../lib/librte_security/rte_security.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ol_flags' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='593' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-7'/>
    <enum-decl name='rte_security_session_action_type' filepath='../lib/librte_security/rte_security.h' line='299' column='1' id='type-id-2'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_ACTION_TYPE_NONE' value='0'/>
      <enumerator name='RTE_SECURITY_ACTION_TYPE_INLINE_CRYPTO' value='1'/>
      <enumerator name='RTE_SECURITY_ACTION_TYPE_INLINE_PROTOCOL' value='2'/>
      <enumerator name='RTE_SECURITY_ACTION_TYPE_LOOKASIDE_PROTOCOL' value='3'/>
    </enum-decl>
    <enum-decl name='rte_security_session_protocol' filepath='../lib/librte_security/rte_security.h' line='317' column='1' id='type-id-3'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_PROTOCOL_IPSEC' value='1'/>
      <enumerator name='RTE_SECURITY_PROTOCOL_MACSEC' value='2'/>
      <enumerator name='RTE_SECURITY_PROTOCOL_PDCP' value='3'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='160' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='560' column='1' id='type-id-4'>
      <data-member access='private'>
        <var-decl name='ipsec' type-id='type-id-8' visibility='default' filepath='../lib/librte_security/rte_security.h' line='574' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='macsec' type-id='type-id-9' visibility='default' filepath='../lib/librte_security/rte_security.h' line='579' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pdcp' type-id='type-id-10' visibility='default' filepath='../lib/librte_security/rte_security.h' line='586' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='561' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='proto' type-id='type-id-11' visibility='default' filepath='../lib/librte_security/rte_security.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mode' type-id='type-id-12' visibility='default' filepath='../lib/librte_security/rte_security.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='direction' type-id='type-id-13' visibility='default' filepath='../lib/librte_security/rte_security.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='options' type-id='type-id-14' visibility='default' filepath='../lib/librte_security/rte_security.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='replay_win_sz_max' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_security_ipsec_sa_protocol' filepath='../lib/librte_security/rte_security.h' line='42' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_IPSEC_SA_PROTO_AH' value='1'/>
      <enumerator name='RTE_SECURITY_IPSEC_SA_PROTO_ESP' value='2'/>
    </enum-decl>
    <enum-decl name='rte_security_ipsec_sa_mode' filepath='../lib/librte_security/rte_security.h' line='34' column='1' id='type-id-12'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_IPSEC_SA_MODE_TRANSPORT' value='1'/>
      <enumerator name='RTE_SECURITY_IPSEC_SA_MODE_TUNNEL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_security_ipsec_sa_direction' filepath='../lib/librte_security/rte_security.h' line='186' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_IPSEC_SA_DIR_EGRESS' value='0'/>
      <enumerator name='RTE_SECURITY_IPSEC_SA_DIR_INGRESS' value='1'/>
    </enum-decl>
    <class-decl name='rte_security_ipsec_sa_options' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='117' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='esn' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='udp_encap' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='copy_dscp' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='copy_flabel' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='copy_df' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='dec_ttl' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='ecn' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stats' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='182' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <typedef-decl name='__uint32_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-16'/>
    <typedef-decl name='uint32_t' type-id='type-id-16' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-6'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='576' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-17' visibility='default' filepath='../lib/librte_security/rte_security.h' line='578' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-17'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='581' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-18' visibility='default' filepath='../lib/librte_security/rte_security.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='capa_flags' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='584' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_security_pdcp_domain' filepath='../lib/librte_security/rte_security.h' line='232' column='1' id='type-id-18'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_PDCP_MODE_CONTROL' value='0'/>
      <enumerator name='RTE_SECURITY_PDCP_MODE_DATA' value='1'/>
    </enum-decl>
    <class-decl name='rte_cryptodev_capabilities' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-19'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-5'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
    <class-decl name='rte_security_ctx' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='66' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='type-id-24' visibility='default' filepath='../lib/librte_security/rte_security.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='type-id-25' visibility='default' filepath='../lib/librte_security/rte_security.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sess_cnt' type-id='type-id-26' visibility='default' filepath='../lib/librte_security/rte_security.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-24'/>
    <class-decl name='rte_security_ops' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='136' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='session_create' type-id='type-id-29' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='session_update' type-id='type-id-30' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='session_get_size' type-id='type-id-31' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='session_stats_get' type-id='type-id-32' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='session_destroy' type-id='type-id-33' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_pkt_metadata' type-id='type-id-34' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_userdata' type-id='type-id-35' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='capabilities_get' type-id='type-id-36' visibility='default' filepath='../lib/librte_security/rte_security_driver.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_security_session_conf' size-in-bits='896' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='329' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action_type' type-id='type-id-2' visibility='default' filepath='../lib/librte_security/rte_security.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-3' visibility='default' filepath='../lib/librte_security/rte_security.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='crypto_xform' type-id='type-id-39' visibility='default' filepath='../lib/librte_security/rte_security.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='userdata' type-id='type-id-24' visibility='default' filepath='../lib/librte_security/rte_security.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='704' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='335' column='1' id='type-id-38'>
      <data-member access='private'>
        <var-decl name='ipsec' type-id='type-id-40' visibility='default' filepath='../lib/librte_security/rte_security.h' line='336' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='macsec' type-id='type-id-41' visibility='default' filepath='../lib/librte_security/rte_security.h' line='337' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pdcp' type-id='type-id-42' visibility='default' filepath='../lib/librte_security/rte_security.h' line='338' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_security_ipsec_xform' size-in-bits='704' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='198' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spi' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='salt' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='options' type-id='type-id-14' visibility='default' filepath='../lib/librte_security/rte_security.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='direction' type-id='type-id-13' visibility='default' filepath='../lib/librte_security/rte_security.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='proto' type-id='type-id-11' visibility='default' filepath='../lib/librte_security/rte_security.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mode' type-id='type-id-12' visibility='default' filepath='../lib/librte_security/rte_security.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tunnel' type-id='type-id-43' visibility='default' filepath='../lib/librte_security/rte_security.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='esn_soft_limit' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='replay_win_sz' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_security_ipsec_tunnel_param' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='80' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-45' visibility='default' filepath='../lib/librte_security/rte_security.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='' type-id='type-id-46' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_security_ipsec_tunnel_type' filepath='../lib/librte_security/rte_security.h' line='50' column='1' id='type-id-45'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_IPSEC_TUNNEL_IPV4' value='1'/>
      <enumerator name='RTE_SECURITY_IPSEC_TUNNEL_IPV6' value='2'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='352' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='84' column='1' id='type-id-46'>
      <data-member access='private'>
        <var-decl name='ipv4' type-id='type-id-47' visibility='default' filepath='../lib/librte_security/rte_security.h' line='96' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv6' type-id='type-id-48' visibility='default' filepath='../lib/librte_security/rte_security.h' line='109' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='85' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-49' visibility='default' filepath='../lib/librte_security/rte_security.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dst_ip' type-id='type-id-49' visibility='default' filepath='../lib/librte_security/rte_security.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dscp' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='df' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ttl' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in_addr' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='31' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='type-id-51' visibility='default' filepath='/usr/include/netinet/in.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='in_addr_t' type-id='type-id-6' filepath='/usr/include/netinet/in.h' line='30' column='1' id='type-id-51'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-52'/>
    <typedef-decl name='__uint8_t' type-id='type-id-52' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-53'/>
    <typedef-decl name='uint8_t' type-id='type-id-53' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-50'/>
    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='98' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_addr' type-id='type-id-54' visibility='default' filepath='../lib/librte_security/rte_security.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_addr' type-id='type-id-54' visibility='default' filepath='../lib/librte_security/rte_security.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dscp' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='flabel' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hlimit' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='212' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='type-id-55' visibility='default' filepath='/usr/include/netinet/in.h' line='219' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='214' column='1' id='type-id-55'>
      <data-member access='private'>
        <var-decl name='__u6_addr8' type-id='type-id-56' visibility='default' filepath='/usr/include/netinet/in.h' line='216' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__u6_addr16' type-id='type-id-57' visibility='default' filepath='/usr/include/netinet/in.h' line='217' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__u6_addr32' type-id='type-id-58' visibility='default' filepath='/usr/include/netinet/in.h' line='218' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-59'/>

    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='128' id='type-id-56'>
      <subrange length='16' type-id='type-id-59' id='type-id-60'/>

    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-61'/>
    <typedef-decl name='__uint16_t' type-id='type-id-61' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-62'/>
    <typedef-decl name='uint16_t' type-id='type-id-62' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-26'/>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='128' id='type-id-57'>
      <subrange length='8' type-id='type-id-59' id='type-id-63'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-58'>
      <subrange length='4' type-id='type-id-59' id='type-id-64'/>

    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-59' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-65'/>
    <typedef-decl name='uint64_t' type-id='type-id-65' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-44'/>
    <class-decl name='rte_security_macsec_xform' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='224' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-17' visibility='default' filepath='../lib/librte_security/rte_security.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_security_pdcp_xform' size-in-bits='224' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='262' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bearer' type-id='type-id-66' visibility='default' filepath='../lib/librte_security/rte_security.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='en_ordering' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='remove_duplicates' type-id='type-id-50' visibility='default' filepath='../lib/librte_security/rte_security.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='domain' type-id='type-id-18' visibility='default' filepath='../lib/librte_security/rte_security.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pkt_dir' type-id='type-id-67' visibility='default' filepath='../lib/librte_security/rte_security.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sn_size' type-id='type-id-68' visibility='default' filepath='../lib/librte_security/rte_security.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hfn' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hfn_threshold' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hfn_ovrd' type-id='type-id-6' visibility='default' filepath='../lib/librte_security/rte_security.h' line='293' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-69'/>
    <typedef-decl name='__int8_t' type-id='type-id-69' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-70'/>
    <typedef-decl name='int8_t' type-id='type-id-70' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' id='type-id-66'/>
    <enum-decl name='rte_security_pdcp_direction' filepath='../lib/librte_security/rte_security.h' line='238' column='1' id='type-id-67'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_PDCP_UPLINK' value='0'/>
      <enumerator name='RTE_SECURITY_PDCP_DOWNLINK' value='1'/>
    </enum-decl>
    <enum-decl name='rte_security_pdcp_sn_size' filepath='../lib/librte_security/rte_security.h' line='244' column='1' id='type-id-68'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_SECURITY_PDCP_SN_SIZE_5' value='5'/>
      <enumerator name='RTE_SECURITY_PDCP_SN_SIZE_7' value='7'/>
      <enumerator name='RTE_SECURITY_PDCP_SN_SIZE_12' value='12'/>
      <enumerator name='RTE_SECURITY_PDCP_SN_SIZE_15' value='15'/>
      <enumerator name='RTE_SECURITY_PDCP_SN_SIZE_18' value='18'/>
    </enum-decl>
    <class-decl name='rte_crypto_sym_xform' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='440' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-39' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-72' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-39'/>
    <enum-decl name='rte_crypto_sym_xform_type' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='424' column='1' id='type-id-72'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_SYM_XFORM_NOT_SPECIFIED' value='0'/>
      <enumerator name='RTE_CRYPTO_SYM_XFORM_AUTH' value='1'/>
      <enumerator name='RTE_CRYPTO_SYM_XFORM_CIPHER' value='2'/>
      <enumerator name='RTE_CRYPTO_SYM_XFORM_AEAD' value='3'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='446' column='1' id='type-id-73'>
      <data-member access='private'>
        <var-decl name='auth' type-id='type-id-74' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='447' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cipher' type-id='type-id-75' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='449' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aead' type-id='type-id-76' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='451' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_crypto_auth_xform' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='278' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-77' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='algo' type-id='type-id-78' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-79' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iv' type-id='type-id-80' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='digest_length' type-id='type-id-26' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='332' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_crypto_auth_operation' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='262' column='1' id='type-id-77'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_AUTH_OP_VERIFY' value='0'/>
      <enumerator name='RTE_CRYPTO_AUTH_OP_GENERATE' value='1'/>
    </enum-decl>
    <enum-decl name='rte_crypto_auth_algorithm' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='189' column='1' id='type-id-78'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_AUTH_NULL' value='1'/>
      <enumerator name='RTE_CRYPTO_AUTH_AES_CBC_MAC' value='2'/>
      <enumerator name='RTE_CRYPTO_AUTH_AES_CMAC' value='3'/>
      <enumerator name='RTE_CRYPTO_AUTH_AES_GMAC' value='4'/>
      <enumerator name='RTE_CRYPTO_AUTH_AES_XCBC_MAC' value='5'/>
      <enumerator name='RTE_CRYPTO_AUTH_KASUMI_F9' value='6'/>
      <enumerator name='RTE_CRYPTO_AUTH_MD5' value='7'/>
      <enumerator name='RTE_CRYPTO_AUTH_MD5_HMAC' value='8'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA1' value='9'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA1_HMAC' value='10'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA224' value='11'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA224_HMAC' value='12'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA256' value='13'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA256_HMAC' value='14'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA384' value='15'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA384_HMAC' value='16'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA512' value='17'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA512_HMAC' value='18'/>
      <enumerator name='RTE_CRYPTO_AUTH_SNOW3G_UIA2' value='19'/>
      <enumerator name='RTE_CRYPTO_AUTH_ZUC_EIA3' value='20'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_224' value='21'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_224_HMAC' value='22'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_256' value='23'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_256_HMAC' value='24'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_384' value='25'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_384_HMAC' value='26'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_512' value='27'/>
      <enumerator name='RTE_CRYPTO_AUTH_SHA3_512_HMAC' value='28'/>
      <enumerator name='RTE_CRYPTO_AUTH_LIST_END' value='29'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='284' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-81' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-26' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-81'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='295' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='type-id-26' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-26' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_crypto_cipher_xform' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='107' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-83' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='algo' type-id='type-id-84' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-79' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iv' type-id='type-id-80' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_crypto_cipher_operation' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='90' column='1' id='type-id-83'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_CIPHER_OP_ENCRYPT' value='0'/>
      <enumerator name='RTE_CRYPTO_CIPHER_OP_DECRYPT' value='1'/>
    </enum-decl>
    <enum-decl name='rte_crypto_cipher_algorithm' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='30' column='1' id='type-id-84'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_CIPHER_NULL' value='1'/>
      <enumerator name='RTE_CRYPTO_CIPHER_3DES_CBC' value='2'/>
      <enumerator name='RTE_CRYPTO_CIPHER_3DES_CTR' value='3'/>
      <enumerator name='RTE_CRYPTO_CIPHER_3DES_ECB' value='4'/>
      <enumerator name='RTE_CRYPTO_CIPHER_AES_CBC' value='5'/>
      <enumerator name='RTE_CRYPTO_CIPHER_AES_CTR' value='6'/>
      <enumerator name='RTE_CRYPTO_CIPHER_AES_ECB' value='7'/>
      <enumerator name='RTE_CRYPTO_CIPHER_AES_F8' value='8'/>
      <enumerator name='RTE_CRYPTO_CIPHER_AES_XTS' value='9'/>
      <enumerator name='RTE_CRYPTO_CIPHER_ARC4' value='10'/>
      <enumerator name='RTE_CRYPTO_CIPHER_KASUMI_F8' value='11'/>
      <enumerator name='RTE_CRYPTO_CIPHER_SNOW3G_UEA2' value='12'/>
      <enumerator name='RTE_CRYPTO_CIPHER_ZUC_EEA3' value='13'/>
      <enumerator name='RTE_CRYPTO_CIPHER_DES_CBC' value='14'/>
      <enumerator name='RTE_CRYPTO_CIPHER_AES_DOCSISBPI' value='15'/>
      <enumerator name='RTE_CRYPTO_CIPHER_DES_DOCSISBPI' value='16'/>
      <enumerator name='RTE_CRYPTO_CIPHER_LIST_END' value='17'/>
    </enum-decl>
    <class-decl name='rte_crypto_aead_xform' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='370' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-85' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='algo' type-id='type-id-86' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-79' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iv' type-id='type-id-80' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='digest_length' type-id='type-id-26' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='aad_length' type-id='type-id-26' visibility='default' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='415' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_crypto_aead_operation' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='359' column='1' id='type-id-85'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_AEAD_OP_ENCRYPT' value='0'/>
      <enumerator name='RTE_CRYPTO_AEAD_OP_DECRYPT' value='1'/>
    </enum-decl>
    <enum-decl name='rte_crypto_aead_algorithm' filepath='../lib/librte_cryptodev/rte_crypto_sym.h' line='346' column='1' id='type-id-86'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='RTE_CRYPTO_AEAD_AES_CCM' value='1'/>
      <enumerator name='RTE_CRYPTO_AEAD_AES_GCM' value='2'/>
      <enumerator name='RTE_CRYPTO_AEAD_LIST_END' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-87'/>
    <class-decl name='rte_security_session' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='347' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sess_private_data' type-id='type-id-24' visibility='default' filepath='../lib/librte_security/rte_security.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opaque_data' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='350' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-91' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-92' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-93' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-15' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-17' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-15' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-94' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-95' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-96' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-97' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-98'/>

    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='256' id='type-id-91'>
      <subrange length='32' type-id='type-id-59' id='type-id-99'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-92'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-91' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-102' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-44' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-94' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-6' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-101'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-103' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-104' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-44' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-103'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-44' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-104'/>
    <typedef-decl name='size_t' type-id='type-id-59' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-102'/>
    <typedef-decl name='__int32_t' type-id='type-id-17' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-105'/>
    <typedef-decl name='int32_t' type-id='type-id-105' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-94'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-106'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-93'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-108' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='98304' id='type-id-108'>
      <subrange length='1536' type-id='type-id-59' id='type-id-109'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-95'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-110' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-111' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-113' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-114' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-115' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-110' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-114'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-115'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-104' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-103' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-116' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-117' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-119' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-114' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-120' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-102' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-121' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-116' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-116'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-120'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-104' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-103' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-122' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
    <typedef-decl name='security_session_create_t' type-id='type-id-125' filepath='../lib/librte_security/rte_security_driver.h' line='36' column='1' id='type-id-29'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
    <typedef-decl name='security_session_update_t' type-id='type-id-127' filepath='../lib/librte_security/rte_security_driver.h' line='62' column='1' id='type-id-30'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='security_session_get_size' type-id='type-id-129' filepath='../lib/librte_security/rte_security_driver.h' line='75' column='1' id='type-id-31'/>
    <class-decl name='rte_security_stats' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='520' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol' type-id='type-id-3' visibility='default' filepath='../lib/librte_security/rte_security.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-131' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='525' column='1' id='type-id-131'>
      <data-member access='private'>
        <var-decl name='macsec' type-id='type-id-132' visibility='default' filepath='../lib/librte_security/rte_security.h' line='526' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipsec' type-id='type-id-133' visibility='default' filepath='../lib/librte_security/rte_security.h' line='527' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pdcp' type-id='type-id-134' visibility='default' filepath='../lib/librte_security/rte_security.h' line='528' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_security_macsec_stats' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='501' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_security_ipsec_stats' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='505' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipackets' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opackets' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ibytes' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='obytes' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ierrors' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='oerrors' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved1' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='reserved2' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='513' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_security_pdcp_stats' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='516' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='type-id-44' visibility='default' filepath='../lib/librte_security/rte_security.h' line='517' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <typedef-decl name='security_session_stats_get_t' type-id='type-id-137' filepath='../lib/librte_security/rte_security_driver.h' line='88' column='1' id='type-id-32'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <typedef-decl name='security_session_destroy_t' type-id='type-id-139' filepath='../lib/librte_security/rte_security_driver.h' line='47' column='1' id='type-id-33'/>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-141' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-24' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-143' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-44' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-141' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-44' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-141' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-114' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-144' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-6' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-145' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-146' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='infinite' id='type-id-147'>
      <subrange length='infinite' type-id='type-id-59' id='type-id-148'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-147' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-141'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-142'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-104' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-104' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='infinite' id='type-id-149'>
      <subrange length='infinite' type-id='type-id-59' id='type-id-148'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-149' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-143'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-144'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-151' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-24' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-152' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-154' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-151'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-152' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-156' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-157'/>
    <typedef-decl name='__int16_t' type-id='type-id-157' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-158'/>
    <typedef-decl name='int16_t' type-id='type-id-158' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-159'/>
    <qualified-type-def type-id='type-id-159' volatile='yes' id='type-id-156'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-155' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-152'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-145'/>

    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='128' id='type-id-146'>
      <subrange length='2' type-id='type-id-59' id='type-id-160'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <typedef-decl name='security_set_pkt_metadata_t' type-id='type-id-162' filepath='../lib/librte_security/rte_security_driver.h' line='103' column='1' id='type-id-34'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <typedef-decl name='security_get_userdata_t' type-id='type-id-165' filepath='../lib/librte_security/rte_security_driver.h' line='120' column='1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <typedef-decl name='security_capabilities_get_t' type-id='type-id-167' filepath='../lib/librte_security/rte_security_driver.h' line='132' column='1' id='type-id-36'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-169'/>
    <class-decl name='rte_security_capability_idx' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='631' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action' type-id='type-id-2' visibility='default' filepath='../lib/librte_security/rte_security.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-3' visibility='default' filepath='../lib/librte_security/rte_security.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-171' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='636' column='1' id='type-id-171'>
      <data-member access='private'>
        <var-decl name='ipsec' type-id='type-id-172' visibility='default' filepath='../lib/librte_security/rte_security.h' line='641' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pdcp' type-id='type-id-10' visibility='default' filepath='../lib/librte_security/rte_security.h' line='645' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_security/rte_security.h' line='637' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='proto' type-id='type-id-11' visibility='default' filepath='../lib/librte_security/rte_security.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mode' type-id='type-id-12' visibility='default' filepath='../lib/librte_security/rte_security.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='direction' type-id='type-id-13' visibility='default' filepath='../lib/librte_security/rte_security.h' line='640' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-173'/>
    <function-decl name='rte_security_capability_get' mangled-name='rte_security_capability_get' filepath='../lib/librte_security/rte_security.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_security_capability_get@@DPDK_20.0'>
      <parameter type-id='type-id-169' name='instance' filepath='../lib/librte_security/rte_security.c' line='109' column='1'/>
      <parameter type-id='type-id-173' name='idx' filepath='../lib/librte_security/rte_security.c' line='110' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='rte_security_capabilities_get' mangled-name='rte_security_capabilities_get' filepath='../lib/librte_security/rte_security.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_security_capabilities_get@@DPDK_20.0'>
      <parameter type-id='type-id-169' name='instance' filepath='../lib/librte_security/rte_security.c' line='102' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='rte_security_set_pkt_metadata' mangled-name='rte_security_set_pkt_metadata' filepath='../lib/librte_security/rte_security.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_security_set_pkt_metadata@@DPDK_20.0'>
      <parameter type-id='type-id-169' name='instance' filepath='../lib/librte_security/rte_security.c' line='80' column='1'/>
      <parameter type-id='type-id-89' name='sess' filepath='../lib/librte_security/rte_security.c' line='81' column='1'/>
      <parameter type-id='type-id-144' name='m' filepath='../lib/librte_security/rte_security.c' line='82' column='1'/>
      <parameter type-id='type-id-24' name='params' filepath='../lib/librte_security/rte_security.c' line='82' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='rte_security_session_destroy' mangled-name='rte_security_session_destroy' filepath='../lib/librte_security/rte_security.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_security_session_destroy@@DPDK_20.0'>
      <parameter type-id='type-id-169' name='instance' filepath='../lib/librte_security/rte_security.c' line='62' column='1'/>
      <parameter type-id='type-id-89' name='sess' filepath='../lib/librte_security/rte_security.c' line='63' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='rte_security_session_get_size' mangled-name='rte_security_session_get_size' filepath='../lib/librte_security/rte_security.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_security_session_get_size@@DPDK_20.0'>
      <parameter type-id='type-id-169' name='instance' filepath='../lib/librte_security/rte_security.c' line='46' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='rte_security_session_create' mangled-name='rte_security_session_create' filepath='../lib/librte_security/rte_security.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_security_session_create@@DPDK_20.0'>
      <parameter type-id='type-id-169' name='instance' filepath='../lib/librte_security/rte_security.c' line='13' column='1'/>
      <parameter type-id='type-id-87' name='conf' filepath='../lib/librte_security/rte_security.c' line='14' column='1'/>
      <parameter type-id='type-id-114' name='mp' filepath='../lib/librte_security/rte_security.c' line='15' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
