<abi-corpus path='gcc//lib/librte_fib.so.0.200' architecture='elf-amd-x86_64' soname='librte_fib.so.0.200'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_rib.so.0.200'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_fib6_add' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_create' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_delete' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_find_existing' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_free' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_get_dp' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_get_rib' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib6_lookup_bulk' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_add' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_create' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_delete' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_find_existing' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_free' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_get_dp' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_get_rib' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_fib_lookup_bulk' version='EXPERIMENTAL' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_fib/rte_fib.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_rib' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <class-decl name='rte_fib' size-in-bits='896' is-struct='yes' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='40' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-5' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rib' type-id='type-id-2' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dp' type-id='type-id-6' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lookup' type-id='type-id-7' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='modify' type-id='type-id-8' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='def_nh' type-id='type-id-9' visibility='default' filepath='../lib/librte_fib/rte_fib.c' line='47' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-11'/>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='512' id='type-id-4'>
      <subrange length='64' type-id='type-id-11' id='type-id-12'/>

    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-13'/>
    <enum-decl name='rte_fib_type' filepath='../lib/librte_fib/rte_fib.h' line='24' column='1' id='type-id-5'>
      <underlying-type type-id='type-id-13'/>
      <enumerator name='RTE_FIB_DUMMY' value='0'/>
      <enumerator name='RTE_FIB_DIR24_8' value='1'/>
      <enumerator name='RTE_FIB_TYPE_MAX' value='2'/>
    </enum-decl>
    <type-decl name='void' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <typedef-decl name='__uint32_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-16'/>
    <typedef-decl name='uint32_t' type-id='type-id-16' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-17'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <typedef-decl name='__uint64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-20'/>
    <typedef-decl name='uint64_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='rte_fib_lookup_fn_t' type-id='type-id-24' filepath='../lib/librte_fib/rte_fib.h' line='34' column='1' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' id='type-id-25'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <typedef-decl name='__uint8_t' type-id='type-id-27' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-28'/>
    <typedef-decl name='uint8_t' type-id='type-id-28' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-29'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <typedef-decl name='rte_fib_modify_fn_t' type-id='type-id-31' filepath='../lib/librte_fib/rte_fib.h' line='31' column='1' id='type-id-8'/>
    <function-decl name='rte_fib_get_rib' mangled-name='rte_fib_get_rib' filepath='../lib/librte_fib/rte_fib.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_get_rib@@EXPERIMENTAL'>
      <parameter type-id='type-id-26' name='fib' filepath='../lib/librte_fib/rte_fib.c' line='316' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rte_fib_get_dp' mangled-name='rte_fib_get_dp' filepath='../lib/librte_fib/rte_fib.c' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_get_dp@@EXPERIMENTAL'>
      <parameter type-id='type-id-26' name='fib' filepath='../lib/librte_fib/rte_fib.c' line='310' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-32'/>
    <function-decl name='rte_fib_lookup_bulk' mangled-name='rte_fib_lookup_bulk' filepath='../lib/librte_fib/rte_fib.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_lookup_bulk@@EXPERIMENTAL'>
      <parameter type-id='type-id-26' name='fib' filepath='../lib/librte_fib/rte_fib.c' line='138' column='1'/>
      <parameter type-id='type-id-32' name='ips' filepath='../lib/librte_fib/rte_fib.c' line='138' column='1'/>
      <parameter type-id='type-id-21' name='next_hops' filepath='../lib/librte_fib/rte_fib.c' line='139' column='1'/>
      <parameter type-id='type-id-25' name='n' filepath='../lib/librte_fib/rte_fib.c' line='139' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_fib_delete' mangled-name='rte_fib_delete' filepath='../lib/librte_fib/rte_fib.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_delete@@EXPERIMENTAL'>
      <parameter type-id='type-id-26' name='fib' filepath='../lib/librte_fib/rte_fib.c' line='129' column='1'/>
      <parameter type-id='type-id-17' name='ip' filepath='../lib/librte_fib/rte_fib.c' line='129' column='1'/>
      <parameter type-id='type-id-29' name='depth' filepath='../lib/librte_fib/rte_fib.c' line='129' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_fib_add' mangled-name='rte_fib_add' filepath='../lib/librte_fib/rte_fib.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_add@@EXPERIMENTAL'>
      <parameter type-id='type-id-26' name='fib' filepath='../lib/librte_fib/rte_fib.c' line='120' column='1'/>
      <parameter type-id='type-id-17' name='ip' filepath='../lib/librte_fib/rte_fib.c' line='120' column='1'/>
      <parameter type-id='type-id-29' name='depth' filepath='../lib/librte_fib/rte_fib.c' line='120' column='1'/>
      <parameter type-id='type-id-9' name='next_hop' filepath='../lib/librte_fib/rte_fib.c' line='120' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_fib_free' mangled-name='rte_fib_free' filepath='../lib/librte_fib/rte_fib.c' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-26' name='fib' filepath='../lib/librte_fib/rte_fib.c' line='281' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <function-decl name='rte_fib_find_existing' mangled-name='rte_fib_find_existing' filepath='../lib/librte_fib/rte_fib.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_find_existing@@EXPERIMENTAL'>
      <parameter type-id='type-id-34' name='name' filepath='../lib/librte_fib/rte_fib.c' line='243' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <class-decl name='rte_fib_conf' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='51' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-5' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='default_nh' type-id='type-id-9' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_routes' type-id='type-id-25' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='' type-id='type-id-36' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='56' column='1' id='type-id-36'>
      <data-member access='private'>
        <var-decl name='dir24_8' type-id='type-id-37' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='57' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nh_sz' type-id='type-id-38' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_tbl8' type-id='type-id-17' visibility='default' filepath='../lib/librte_fib/rte_fib.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fib_dir24_8_nh_sz' filepath='../lib/librte_fib/rte_fib.h' line='43' column='1' id='type-id-38'>
      <underlying-type type-id='type-id-13'/>
      <enumerator name='RTE_FIB_DIR24_8_1B' value='0'/>
      <enumerator name='RTE_FIB_DIR24_8_2B' value='1'/>
      <enumerator name='RTE_FIB_DIR24_8_4B' value='2'/>
      <enumerator name='RTE_FIB_DIR24_8_8B' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-39'/>
    <function-decl name='rte_fib_create' mangled-name='rte_fib_create' filepath='../lib/librte_fib/rte_fib.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib_create@@EXPERIMENTAL'>
      <parameter type-id='type-id-34' name='name' filepath='../lib/librte_fib/rte_fib.c' line='149' column='1'/>
      <parameter type-id='type-id-25' name='socket_id' filepath='../lib/librte_fib/rte_fib.c' line='149' column='1'/>
      <parameter type-id='type-id-39' name='conf' filepath='../lib/librte_fib/rte_fib.c' line='149' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-30'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-23'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-14'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_fib/rte_fib6.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <class-decl name='rte_rib6' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <class-decl name='rte_fib6' size-in-bits='896' is-struct='yes' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='40' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-43' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rib' type-id='type-id-41' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dp' type-id='type-id-6' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lookup' type-id='type-id-44' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='modify' type-id='type-id-45' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='def_nh' type-id='type-id-9' visibility='default' filepath='../lib/librte_fib/rte_fib6.c' line='47' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fib6_type' filepath='../lib/librte_fib/rte_fib6.h' line='25' column='1' id='type-id-43'>
      <underlying-type type-id='type-id-13'/>
      <enumerator name='RTE_FIB6_DUMMY' value='0'/>
      <enumerator name='RTE_FIB6_TRIE' value='1'/>
      <enumerator name='RTE_FIB6_TYPE_MAX' value='2'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-29' size-in-bits='128' id='type-id-46'>
      <subrange length='16' type-id='type-id-11' id='type-id-47'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <typedef-decl name='rte_fib6_lookup_fn_t' type-id='type-id-50' filepath='../lib/librte_fib/rte_fib6.h' line='36' column='1' id='type-id-44'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <typedef-decl name='rte_fib6_modify_fn_t' type-id='type-id-55' filepath='../lib/librte_fib/rte_fib6.h' line='32' column='1' id='type-id-45'/>
    <function-decl name='rte_fib6_get_rib' mangled-name='rte_fib6_get_rib' filepath='../lib/librte_fib/rte_fib6.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_get_rib@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='fib' filepath='../lib/librte_fib/rte_fib6.c' line='318' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='rte_fib6_get_dp' mangled-name='rte_fib6_get_dp' filepath='../lib/librte_fib/rte_fib6.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_get_dp@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='fib' filepath='../lib/librte_fib/rte_fib6.c' line='312' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='rte_fib6_lookup_bulk' mangled-name='rte_fib6_lookup_bulk' filepath='../lib/librte_fib/rte_fib6.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_lookup_bulk@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='fib' filepath='../lib/librte_fib/rte_fib6.c' line='140' column='1'/>
      <parameter type-id='type-id-48' name='ips' filepath='../lib/librte_fib/rte_fib6.c' line='141' column='1'/>
      <parameter type-id='type-id-21' name='next_hops' filepath='../lib/librte_fib/rte_fib6.c' line='142' column='1'/>
      <parameter type-id='type-id-25' name='n' filepath='../lib/librte_fib/rte_fib6.c' line='142' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_fib6_delete' mangled-name='rte_fib6_delete' filepath='../lib/librte_fib/rte_fib6.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_delete@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='fib' filepath='../lib/librte_fib/rte_fib6.c' line='130' column='1'/>
      <parameter type-id='type-id-53' name='ip' filepath='../lib/librte_fib/rte_fib6.c' line='130' column='1'/>
      <parameter type-id='type-id-29' name='depth' filepath='../lib/librte_fib/rte_fib6.c' line='131' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_fib6_add' mangled-name='rte_fib6_add' filepath='../lib/librte_fib/rte_fib6.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_add@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='fib' filepath='../lib/librte_fib/rte_fib6.c' line='120' column='1'/>
      <parameter type-id='type-id-53' name='ip' filepath='../lib/librte_fib/rte_fib6.c' line='120' column='1'/>
      <parameter type-id='type-id-29' name='depth' filepath='../lib/librte_fib/rte_fib6.c' line='121' column='1'/>
      <parameter type-id='type-id-9' name='next_hop' filepath='../lib/librte_fib/rte_fib6.c' line='121' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_fib6_free' mangled-name='rte_fib6_free' filepath='../lib/librte_fib/rte_fib6.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-51' name='fib' filepath='../lib/librte_fib/rte_fib6.c' line='283' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='rte_fib6_find_existing' mangled-name='rte_fib6_find_existing' filepath='../lib/librte_fib/rte_fib6.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_find_existing@@EXPERIMENTAL'>
      <parameter type-id='type-id-34' name='name' filepath='../lib/librte_fib/rte_fib6.c' line='245' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <class-decl name='rte_fib6_conf' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='52' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-43' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='default_nh' type-id='type-id-9' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_routes' type-id='type-id-25' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='57' column='1' id='type-id-57'>
      <data-member access='private'>
        <var-decl name='trie' type-id='type-id-58' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='61' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='58' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nh_sz' type-id='type-id-59' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_tbl8' type-id='type-id-17' visibility='default' filepath='../lib/librte_fib/rte_fib6.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fib_trie_nh_sz' filepath='../lib/librte_fib/rte_fib6.h' line='45' column='1' id='type-id-59'>
      <underlying-type type-id='type-id-13'/>
      <enumerator name='RTE_FIB6_TRIE_2B' value='1'/>
      <enumerator name='RTE_FIB6_TRIE_4B' value='2'/>
      <enumerator name='RTE_FIB6_TRIE_8B' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-60'/>
    <function-decl name='rte_fib6_create' mangled-name='rte_fib6_create' filepath='../lib/librte_fib/rte_fib6.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_fib6_create@@EXPERIMENTAL'>
      <parameter type-id='type-id-34' name='name' filepath='../lib/librte_fib/rte_fib6.c' line='151' column='1'/>
      <parameter type-id='type-id-25' name='socket_id' filepath='../lib/librte_fib/rte_fib6.c' line='151' column='1'/>
      <parameter type-id='type-id-60' name='conf' filepath='../lib/librte_fib/rte_fib6.c' line='151' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-54'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-49'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-14'/>
    </function-type>
  </abi-instr>
</abi-corpus>
