<abi-corpus path='gcc//lib/librte_pdump.so.20.0' architecture='elf-amd-x86_64' soname='librte_pdump.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_ethdev.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_pdump_disable' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pdump_disable_by_deviceid' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pdump_enable' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pdump_enable_by_deviceid' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pdump_init' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_pdump_uninit' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_pdump/rte_pdump.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-4'/>
    <typedef-decl name='__uint16_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-5'/>
    <typedef-decl name='uint16_t' type-id='type-id-5' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-7'/>
    <typedef-decl name='__uint32_t' type-id='type-id-7' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-8'/>
    <typedef-decl name='uint32_t' type-id='type-id-8' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-9'/>
    <function-decl name='rte_pdump_disable_by_deviceid' mangled-name='rte_pdump_disable_by_deviceid' filepath='../lib/librte_pdump/rte_pdump.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pdump_disable_by_deviceid@@DPDK_20.0'>
      <parameter type-id='type-id-3' name='device_id' filepath='../lib/librte_pdump/rte_pdump.c' line='615' column='1'/>
      <parameter type-id='type-id-6' name='queue' filepath='../lib/librte_pdump/rte_pdump.c' line='615' column='1'/>
      <parameter type-id='type-id-9' name='flags' filepath='../lib/librte_pdump/rte_pdump.c' line='616' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_pdump_disable' mangled-name='rte_pdump_disable' filepath='../lib/librte_pdump/rte_pdump.c' line='596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pdump_disable@@DPDK_20.0'>
      <parameter type-id='type-id-6' name='port' filepath='../lib/librte_pdump/rte_pdump.c' line='596' column='1'/>
      <parameter type-id='type-id-6' name='queue' filepath='../lib/librte_pdump/rte_pdump.c' line='596' column='1'/>
      <parameter type-id='type-id-9' name='flags' filepath='../lib/librte_pdump/rte_pdump.c' line='596' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_ring' size-in-bits='3072' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='81' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-1' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memzone' type-id='type-id-12' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='size' type-id='type-id-9' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mask' type-id='type-id-9' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='capacity' type-id='type-id-9' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pad0' type-id='type-id-2' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='prod' type-id='type-id-13' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='pad1' type-id='type-id-2' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='cons' type-id='type-id-13' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad2' type-id='type-id-2' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-14'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='256' id='type-id-11'>
      <subrange length='32' type-id='type-id-14' id='type-id-15'/>

    </array-type-def>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-19' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-20' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-9' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-17'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-21' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-22' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-23'/>
    <typedef-decl name='uint64_t' type-id='type-id-23' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-19'/>
    <typedef-decl name='phys_addr_t' type-id='type-id-19' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-21'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-19' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-22'/>
    <typedef-decl name='size_t' type-id='type-id-14' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-18'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-24'/>
    <typedef-decl name='int32_t' type-id='type-id-24' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-20'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-12'/>
    <class-decl name='rte_ring_headtail' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='65' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-26' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tail' type-id='type-id-26' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='single' type-id='type-id-9' visibility='default' filepath='../lib/librte_ring/rte_ring.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-9' volatile='yes' id='type-id-26'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-27'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-12' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-20' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-31' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-32' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-33' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-29'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-19' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='void' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-30'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-9' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-36' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='98304' id='type-id-36'>
      <subrange length='1536' type-id='type-id-14' id='type-id-37'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-31'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-38' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-41' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-42' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-38' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-42'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-43'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-21' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-45' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-47' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-42' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-49' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-30' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-44'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-48'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-22' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-21' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-50' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <function-decl name='rte_pdump_enable_by_deviceid' mangled-name='rte_pdump_enable_by_deviceid' filepath='../lib/librte_pdump/rte_pdump.c' line='574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pdump_enable_by_deviceid@@DPDK_20.0'>
      <parameter type-id='type-id-3' name='device_id' filepath='../lib/librte_pdump/rte_pdump.c' line='574' column='1'/>
      <parameter type-id='type-id-6' name='queue' filepath='../lib/librte_pdump/rte_pdump.c' line='574' column='1'/>
      <parameter type-id='type-id-9' name='flags' filepath='../lib/librte_pdump/rte_pdump.c' line='575' column='1'/>
      <parameter type-id='type-id-27' name='ring' filepath='../lib/librte_pdump/rte_pdump.c' line='576' column='1'/>
      <parameter type-id='type-id-42' name='mp' filepath='../lib/librte_pdump/rte_pdump.c' line='577' column='1'/>
      <parameter type-id='type-id-30' name='filter' filepath='../lib/librte_pdump/rte_pdump.c' line='578' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_pdump_enable' mangled-name='rte_pdump_enable' filepath='../lib/librte_pdump/rte_pdump.c' line='548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pdump_enable@@DPDK_20.0'>
      <parameter type-id='type-id-6' name='port' filepath='../lib/librte_pdump/rte_pdump.c' line='548' column='1'/>
      <parameter type-id='type-id-6' name='queue' filepath='../lib/librte_pdump/rte_pdump.c' line='548' column='1'/>
      <parameter type-id='type-id-9' name='flags' filepath='../lib/librte_pdump/rte_pdump.c' line='548' column='1'/>
      <parameter type-id='type-id-27' name='ring' filepath='../lib/librte_pdump/rte_pdump.c' line='549' column='1'/>
      <parameter type-id='type-id-42' name='mp' filepath='../lib/librte_pdump/rte_pdump.c' line='550' column='1'/>
      <parameter type-id='type-id-30' name='filter' filepath='../lib/librte_pdump/rte_pdump.c' line='551' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_pdump_uninit' mangled-name='rte_pdump_uninit' filepath='../lib/librte_pdump/rte_pdump.c' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pdump_uninit@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_pdump_init' mangled-name='rte_pdump_init' filepath='../lib/librte_pdump/rte_pdump.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_pdump_init@@DPDK_20.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-34'/>
    </function-type>
  </abi-instr>
</abi-corpus>
