<abi-corpus path='gcc//lib/librte_member.so.20.0' architecture='elf-amd-x86_64' soname='librte_member.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_hash.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rte_member_add' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_create' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_find_existing' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_free' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_lookup' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_lookup_bulk' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_lookup_multi' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_lookup_multi_bulk' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_member_reset' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_member/rte_member.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='librte_member_logtype' type-id='type-id-1' visibility='default' filepath='../lib/librte_member/rte_member.h' line='79' column='1'/>
    <type-decl name='void' id='type-id-2'/>
    <class-decl name='rte_member_setsum' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_member/rte_member.h' line='119' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-4' visibility='default' filepath='../lib/librte_member/rte_member.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='key_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prim_hash_seed' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sec_hash_seed' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bucket_cnt' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bucket_mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sig_cmp_fn' type-id='type-id-6' visibility='default' filepath='../lib/librte_member/rte_member.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cache' type-id='type-id-7' visibility='default' filepath='../lib/librte_member/rte_member.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='num_set' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='bits' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bit_mask' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='num_hashes' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mul_shift' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='div_shift' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='table' type-id='type-id-8' visibility='default' filepath='../lib/librte_member/rte_member.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='name' type-id='type-id-9' visibility='default' filepath='../lib/librte_member/rte_member.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-10'/>
    <enum-decl name='rte_member_setsum_type' filepath='../lib/librte_member/rte_member.h' line='105' column='1' id='type-id-4'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='RTE_MEMBER_TYPE_HT' value='0'/>
      <enumerator name='RTE_MEMBER_TYPE_VBF' value='1'/>
      <enumerator name='RTE_MEMBER_NUM_TYPE' value='2'/>
    </enum-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-11'/>
    <typedef-decl name='__uint32_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-12'/>
    <typedef-decl name='uint32_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <enum-decl name='rte_member_sig_compare_function' filepath='../lib/librte_member/rte_member.h' line='112' column='1' id='type-id-6'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='RTE_MEMBER_COMPARE_SCALAR' value='0'/>
      <enumerator name='RTE_MEMBER_COMPARE_AVX2' value='1'/>
      <enumerator name='RTE_MEMBER_COMPARE_NUM' value='2'/>
    </enum-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-13'/>
    <typedef-decl name='__uint8_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-14'/>
    <typedef-decl name='uint8_t' type-id='type-id-14' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-7'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-8'/>
    <type-decl name='char' size-in-bits='8' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-16'/>

    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='256' id='type-id-9'>
      <subrange length='32' type-id='type-id-16' id='type-id-17'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <function-decl name='rte_member_reset' mangled-name='rte_member_reset' filepath='../lib/librte_member/rte_member.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_reset@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='286' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-20'/>
    <typedef-decl name='__uint16_t' type-id='type-id-20' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-21'/>
    <typedef-decl name='uint16_t' type-id='type-id-21' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-22'/>
    <typedef-decl name='member_set_t' type-id='type-id-22' filepath='../lib/librte_member/rte_member.h' line='58' column='1' id='type-id-23'/>
    <function-decl name='rte_member_delete' mangled-name='rte_member_delete' filepath='../lib/librte_member/rte_member.c' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_delete@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='269' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../lib/librte_member/rte_member.c' line='269' column='1'/>
      <parameter type-id='type-id-23' name='set_id' filepath='../lib/librte_member/rte_member.c' line='270' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-26'/>
    <function-decl name='rte_member_lookup_multi_bulk' mangled-name='rte_member_lookup_multi_bulk' filepath='../lib/librte_member/rte_member.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_lookup_multi_bulk@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='247' column='1'/>
      <parameter type-id='type-id-24' name='keys' filepath='../lib/librte_member/rte_member.c' line='248' column='1'/>
      <parameter type-id='type-id-5' name='num_keys' filepath='../lib/librte_member/rte_member.c' line='248' column='1'/>
      <parameter type-id='type-id-5' name='max_match_per_key' filepath='../lib/librte_member/rte_member.c' line='249' column='1'/>
      <parameter type-id='type-id-25' name='match_count' filepath='../lib/librte_member/rte_member.c' line='249' column='1'/>
      <parameter type-id='type-id-26' name='set_ids' filepath='../lib/librte_member/rte_member.c' line='250' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_member_lookup_multi' mangled-name='rte_member_lookup_multi' filepath='../lib/librte_member/rte_member.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_lookup_multi@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='228' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../lib/librte_member/rte_member.c' line='228' column='1'/>
      <parameter type-id='type-id-5' name='match_per_key' filepath='../lib/librte_member/rte_member.c' line='229' column='1'/>
      <parameter type-id='type-id-26' name='set_id' filepath='../lib/librte_member/rte_member.c' line='229' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_member_lookup_bulk' mangled-name='rte_member_lookup_bulk' filepath='../lib/librte_member/rte_member.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_lookup_bulk@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='208' column='1'/>
      <parameter type-id='type-id-24' name='keys' filepath='../lib/librte_member/rte_member.c' line='209' column='1'/>
      <parameter type-id='type-id-5' name='num_keys' filepath='../lib/librte_member/rte_member.c' line='209' column='1'/>
      <parameter type-id='type-id-26' name='set_ids' filepath='../lib/librte_member/rte_member.c' line='210' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_member_lookup' mangled-name='rte_member_lookup' filepath='../lib/librte_member/rte_member.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_lookup@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='191' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../lib/librte_member/rte_member.c' line='191' column='1'/>
      <parameter type-id='type-id-26' name='set_id' filepath='../lib/librte_member/rte_member.c' line='192' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_member_add' mangled-name='rte_member_add' filepath='../lib/librte_member/rte_member.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_add@@DPDK_20.0'>
      <parameter type-id='type-id-19' name='setsum' filepath='../lib/librte_member/rte_member.c' line='269' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../lib/librte_member/rte_member.c' line='269' column='1'/>
      <parameter type-id='type-id-23' name='set_id' filepath='../lib/librte_member/rte_member.c' line='270' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-27'/>
    <class-decl name='rte_member_parameters' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_member/rte_member.h' line='158' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-29' visibility='default' filepath='../lib/librte_member/rte_member.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-4' visibility='default' filepath='../lib/librte_member/rte_member.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='is_cache' type-id='type-id-7' visibility='default' filepath='../lib/librte_member/rte_member.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_keys' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='key_len' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_set' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='false_positive_rate' type-id='type-id-30' visibility='default' filepath='../lib/librte_member/rte_member.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='prim_hash_seed' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='sec_hash_seed' type-id='type-id-5' visibility='default' filepath='../lib/librte_member/rte_member.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_member/rte_member.h' line='265' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-29'/>
    <type-decl name='float' size-in-bits='32' id='type-id-30'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <function-decl name='rte_member_create' mangled-name='rte_member_create' filepath='../lib/librte_member/rte_member.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_create@@DPDK_20.0'>
      <parameter type-id='type-id-33' name='params' filepath='../lib/librte_member/rte_member.c' line='87' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rte_member_free' mangled-name='rte_member_free' filepath='../lib/librte_member/rte_member.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_free@@DPDK_20.0'>
      <parameter type-id='type-id-27' name='setsum' filepath='../lib/librte_member/rte_member.c' line='52' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rte_member_find_existing' mangled-name='rte_member_find_existing' filepath='../lib/librte_member/rte_member.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_member_find_existing@@DPDK_20.0'>
      <parameter type-id='type-id-29' name='name' filepath='../lib/librte_member/rte_member.c' line='28' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
