<abi-corpus path='gcc//lib/librte_ethdev.so.20.0' architecture='elf-amd-x86_64' soname='librte_ethdev.so.20.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='librte_eal.so.20.0'/>
    <dependency name='librte_kvargs.so.20.0'/>
    <dependency name='librte_net.so.20.0'/>
    <dependency name='librte_mbuf.so.20.0'/>
    <dependency name='librte_mempool.so.20.0'/>
    <dependency name='librte_ring.so.20.0'/>
    <dependency name='librte_meter.so.20.0'/>
    <dependency name='libbsd.so.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_rte_eth_dev_callback_process' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_rte_eth_dev_reset' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_eth_add_first_rx_callback' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rte_tm_mark_vlan_dei' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_add' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_capabilities_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_cman_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_parent_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_resume' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_shaper_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_shared_shaper_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_shared_wred_context_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_stats_read' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_stats_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_suspend' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_type_get' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_wfq_weight_mode_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_node_wred_context_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_shaper_profile_add' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_shaper_profile_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_shared_shaper_add_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_shared_shaper_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_shared_wred_context_add_update' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_shared_wred_context_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_wred_profile_add' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_tm_wred_profile_delete' version='DPDK_20.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='rte_eth_dev_logtype' size='4' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_eth_devices' size='530432' version='DPDK_20.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_flow_dynf_metadata_mask' size='8' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rte_flow_dynf_metadata_offs' size='4' version='EXPERIMENTAL' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../lib/librte_ethdev/rte_ethdev.c' comp-dir-path='/root/klaatz/dpdk/gcc' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <var-decl name='rte_eth_dev_logtype' type-id='type-id-1' mangled-name='rte_eth_dev_logtype' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='163' column='1' elf-symbol-id='rte_eth_dev_logtype@@DPDK_20.0'/>
    <class-decl name='rte_eth_dev' size-in-bits='132608' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='777' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_pkt_burst' type-id='type-id-3' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_pkt_burst' type-id='type-id-4' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tx_pkt_prepare' type-id='type-id-5' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-6' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='process_private' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_ops' type-id='type-id-8' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='device' type-id='type-id-9' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='intr_handle' type-id='type-id-10' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='link_intr_cbs' type-id='type-id-11' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='post_rx_burst_cbs' type-id='type-id-12' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='pre_tx_burst_cbs' type-id='type-id-12' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131712'>
        <var-decl name='state' type-id='type-id-13' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131776'>
        <var-decl name='security_ctx' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131840'>
        <var-decl name='reserved_64s' type-id='type-id-14' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132096'>
        <var-decl name='reserved_ptrs' type-id='type-id-15' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='807' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-16'/>
    <typedef-decl name='__uint16_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-17'/>
    <typedef-decl name='uint16_t' type-id='type-id-17' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-18'/>
    <type-decl name='void' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-7'/>
    <class-decl name='rte_mbuf' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='480' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cacheline0' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf_addr' type-id='type-id-7' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rearm_data' type-id='type-id-23' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_off' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nb_segs' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='port' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ol_flags' type-id='type-id-24' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rx_descriptor_fields1' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pkt_len' type-id='type-id-25' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data_len' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vlan_tci' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='vlan_tci_outer' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='buf_len' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timestamp' type-id='type-id-24' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cacheline1' type-id='type-id-21' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pool' type-id='type-id-26' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next' type-id='type-id-27' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv_size' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='timesync' type-id='type-id-18' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='seqn' type-id='type-id-25' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='shinfo' type-id='type-id-28' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dynfield1' type-id='type-id-29' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-30'/>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='infinite' id='type-id-31'>
      <subrange length='infinite' type-id='type-id-30' id='type-id-32'/>

    </array-type-def>
    <typedef-decl name='MARKER' type-id='type-id-31' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='414' column='1' id='type-id-21'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='491' column='1' id='type-id-22'>
      <data-member access='private'>
        <var-decl name='buf_iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='492' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf_physaddr' type-id='type-id-33' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-30' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-34'/>
    <typedef-decl name='uint64_t' type-id='type-id-34' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-24'/>
    <typedef-decl name='rte_iova_t' type-id='type-id-24' filepath='../lib/librte_eal/common/include/rte_common.h' line='335' column='1' id='type-id-33'/>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='infinite' id='type-id-35'>
      <subrange length='infinite' type-id='type-id-30' id='type-id-32'/>

    </array-type-def>
    <typedef-decl name='MARKER64' type-id='type-id-35' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='420' column='1' id='type-id-23'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-36'/>
    <typedef-decl name='__uint32_t' type-id='type-id-36' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-37'/>
    <typedef-decl name='uint32_t' type-id='type-id-37' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-25'/>
    <class-decl name='rte_mempool' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='216' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-39' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pool_config' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mz' type-id='type-id-41' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-36' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='socket_id' type-id='type-id-1' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cache_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='elt_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='header_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='trailer_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='private_data_size' type-id='type-id-36' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ops_index' type-id='type-id-42' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_cache' type-id='type-id-43' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='populated_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='elt_list' type-id='type-id-44' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_mem_chunks' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mem_list' type-id='type-id-45' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-46'/>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='256' id='type-id-39'>
      <subrange length='32' type-id='type-id-30' id='type-id-47'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='224' column='1' id='type-id-40'>
      <data-member access='private'>
        <var-decl name='pool_data' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='225' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pool_id' type-id='type-id-24' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_memzone' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='49' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-39' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='type-id-50' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugepage_sz' type-id='type-id-24' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='socket_id' type-id='type-id-42' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-25' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='55' column='1' id='type-id-49'>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-51' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='56' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_eal/common/include/rte_memzone.h' line='57' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='phys_addr_t' type-id='type-id-24' filepath='../lib/librte_eal/common/include/rte_common.h' line='325' column='1' id='type-id-51'/>
    <typedef-decl name='size_t' type-id='type-id-30' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-50'/>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-52'/>
    <typedef-decl name='int32_t' type-id='type-id-52' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-42'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-41'/>
    <class-decl name='rte_mempool_cache' size-in-bits='98816' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='83' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flushthresh' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-25' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objs' type-id='type-id-55' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='91' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='98304' id='type-id-55'>
      <subrange length='1536' type-id='type-id-30' id='type-id-56'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-43'/>
    <class-decl name='rte_mempool_objhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-57' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-58' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='152' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_objhdr' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='136' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-60' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-26' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-61' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-57' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-26'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='140' column='1' id='type-id-61'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='141' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='physaddr' type-id='type-id-51' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='142' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <class-decl name='rte_mempool_memhdr_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='type-id-62' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='type-id-63' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_mempool_memhdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='185' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-65' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp' type-id='type-id-26' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='len' type-id='type-id-50' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_cb' type-id='type-id-67' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opaque' type-id='type-id-7' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='type-id-62' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-62'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='190' column='1' id='type-id-66'>
      <data-member access='private'>
        <var-decl name='iova' type-id='type-id-33' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='phys_addr' type-id='type-id-51' visibility='default' filepath='../lib/librte_mempool/rte_mempool.h' line='192' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='rte_mempool_memchunk_free_cb_t' type-id='type-id-68' filepath='../lib/librte_mempool/rte_mempool.h' line='176' column='1' id='type-id-69'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-27'/>
    <class-decl name='rte_mbuf_ext_shared_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='689' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_cb' type-id='type-id-71' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcb_opaque' type-id='type-id-7' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='refcnt_atomic' type-id='type-id-72' visibility='default' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='rte_mbuf_extbuf_free_callback_t' type-id='type-id-74' filepath='../lib/librte_mbuf/rte_mbuf_core.h' line='684' column='1' id='type-id-71'/>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='223' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cnt' type-id='type-id-76' visibility='default' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-77'/>
    <typedef-decl name='__int16_t' type-id='type-id-77' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-78'/>
    <typedef-decl name='int16_t' type-id='type-id-78' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-79'/>
    <qualified-type-def type-id='type-id-79' volatile='yes' id='type-id-76'/>
    <typedef-decl name='rte_atomic16_t' type-id='type-id-75' filepath='../lib/librte_eal/common/include/generic/rte_atomic.h' line='225' column='1' id='type-id-72'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-28'/>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='128' id='type-id-29'>
      <subrange length='2' type-id='type-id-30' id='type-id-80'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <typedef-decl name='eth_rx_burst_t' type-id='type-id-83' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='340' column='1' id='type-id-3'/>
    <typedef-decl name='eth_tx_burst_t' type-id='type-id-83' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='345' column='1' id='type-id-4'/>
    <typedef-decl name='eth_tx_prep_t' type-id='type-id-83' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='350' column='1' id='type-id-5'/>
    <class-decl name='rte_eth_dev_data' size-in-bits='55808' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='820' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-85' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_queues' type-id='type-id-86' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_queues' type-id='type-id-86' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_rx_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='nb_tx_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='sriov' type-id='type-id-87' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dev_private' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_link' type-id='type-id-88' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dev_conf' type-id='type-id-89' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='mtu' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25568'>
        <var-decl name='min_rx_buf_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='rx_mbuf_alloc_failed' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25664'>
        <var-decl name='mac_addrs' type-id='type-id-90' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='mac_pool_sel' type-id='type-id-91' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='hash_mac_addrs' type-id='type-id-90' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33984'>
        <var-decl name='port_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='promiscuous' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='scattered_rx' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='all_multicast' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dev_started' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='lro' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34008'>
        <var-decl name='rx_queue_state' type-id='type-id-93' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42200'>
        <var-decl name='tx_queue_state' type-id='type-id-93' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50400'>
        <var-decl name='dev_flags' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50432'>
        <var-decl name='kdrv' type-id='type-id-94' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50464'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50496'>
        <var-decl name='vlan_filter_conf' type-id='type-id-95' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54592'>
        <var-decl name='owner' type-id='type-id-96' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55168'>
        <var-decl name='representor_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55232'>
        <var-decl name='reserved_64s' type-id='type-id-14' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55488'>
        <var-decl name='reserved_ptrs' type-id='type-id-15' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='876' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='512' id='type-id-85'>
      <subrange length='64' type-id='type-id-30' id='type-id-97'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-86'/>
    <class-decl name='rte_eth_dev_sriov' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1476' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='active' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_q_per_pool' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='def_vmdq_idx' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='def_pool_q_idx' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1480' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-98'/>
    <typedef-decl name='__uint8_t' type-id='type-id-98' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-99'/>
    <typedef-decl name='uint8_t' type-id='type-id-99' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-92'/>
    <class-decl name='rte_eth_link' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='308' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speed' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='link_duplex' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='link_autoneg' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='link_status' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_conf' size-in-bits='24640' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1045' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link_speeds' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rxmode' type-id='type-id-100' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='txmode' type-id='type-id-101' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='lpbk_mode' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rx_adv_conf' type-id='type-id-102' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1068' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='tx_adv_conf' type-id='type-id-103' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18080'>
        <var-decl name='dcb_capability_en' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='fdir_conf' type-id='type-id-104' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='intr_conf' type-id='type-id-105' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1081' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rxmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='394' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-106' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_rx_pkt_len' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='split_hdr_size' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-107' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='409' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-108'/>
    <enum-decl name='rte_eth_rx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='344' column='1' id='type-id-106'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='ETH_MQ_RX_NONE' value='0'/>
      <enumerator name='ETH_MQ_RX_RSS' value='1'/>
      <enumerator name='ETH_MQ_RX_DCB' value='2'/>
      <enumerator name='ETH_MQ_RX_DCB_RSS' value='3'/>
      <enumerator name='ETH_MQ_RX_VMDQ_ONLY' value='4'/>
      <enumerator name='ETH_MQ_RX_VMDQ_RSS' value='5'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB' value='6'/>
      <enumerator name='ETH_MQ_RX_VMDQ_DCB_RSS' value='7'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='128' id='type-id-107'>
      <subrange length='2' type-id='type-id-30' id='type-id-80'/>

    </array-type-def>
    <class-decl name='rte_eth_txmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='792' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mq_mode' type-id='type-id-109' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pvid' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='hw_vlan_reject_tagged' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='hw_vlan_reject_untagged' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='hw_vlan_insert_pvid' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-107' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='812' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tx_mq_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='377' column='1' id='type-id-109'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='ETH_MQ_TX_NONE' value='0'/>
      <enumerator name='ETH_MQ_TX_DCB' value='1'/>
      <enumerator name='ETH_MQ_TX_VMDQ_DCB' value='2'/>
      <enumerator name='ETH_MQ_TX_VMDQ_ONLY' value='3'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1060' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_conf' type-id='type-id-110' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vmdq_dcb_conf' type-id='type-id-111' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='dcb_rx_conf' type-id='type-id-112' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='vmdq_rx_conf' type-id='type-id-113' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1066' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_rss_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='448' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rss_key' type-id='type-id-114' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rss_key_len' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rss_hf' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='451' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-114'/>
    <class-decl name='rte_eth_vmdq_dcb_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='745' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-115' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_pool_maps' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_map' type-id='type-id-116' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='dcb_tc' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='754' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_pools' filepath='../lib/librte_ethdev/rte_ethdev.h' line='704' column='1' id='type-id-115'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='ETH_8_POOLS' value='8'/>
      <enumerator name='ETH_16_POOLS' value='16'/>
      <enumerator name='ETH_32_POOLS' value='32'/>
      <enumerator name='ETH_64_POOLS' value='64'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='750' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pools' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='752' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-118' size-in-bits='8192' id='type-id-116'>
      <subrange length='64' type-id='type-id-30' id='type-id-97'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='64' id='type-id-117'>
      <subrange length='8' type-id='type-id-30' id='type-id-119'/>

    </array-type-def>
    <class-decl name='rte_eth_dcb_rx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='712' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-120' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_nb_tcs' filepath='../lib/librte_ethdev/rte_ethdev.h' line='695' column='1' id='type-id-120'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='ETH_4_TCS' value='4'/>
      <enumerator name='ETH_8_TCS' value='8'/>
    </enum-decl>
    <class-decl name='rte_eth_vmdq_rx_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='776' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-115' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enable_default_pool' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='default_pool' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='enable_loop_back' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='nb_pool_maps' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rx_mode' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool_map' type-id='type-id-116' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='786' column='1'/>
      </data-member>
    </class-decl>

    <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1069' column='1' id='type-id-103'>
      <data-member access='private'>
        <var-decl name='vmdq_dcb_tx_conf' type-id='type-id-121' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1070' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dcb_tx_conf' type-id='type-id-122' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1072' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vmdq_tx_conf' type-id='type-id-123' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1074' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_eth_vmdq_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='718' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-115' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='721' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='724' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-120' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dcb_tc' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vmdq_tx_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='730' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_queue_pools' type-id='type-id-115' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_fdir_conf' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1005' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-124' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pballoc' type-id='type-id-125' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='status' type-id='type-id-126' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drop_queue' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mask' type-id='type-id-127' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flex_conf' type-id='type-id-128' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1012' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_fdir_mode' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='603' column='1' id='type-id-124'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_FDIR_MODE_NONE' value='0'/>
      <enumerator name='RTE_FDIR_MODE_SIGNATURE' value='1'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT' value='2'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_MAC_VLAN' value='3'/>
      <enumerator name='RTE_FDIR_MODE_PERFECT_TUNNEL' value='4'/>
    </enum-decl>
    <enum-decl name='rte_fdir_pballoc_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='984' column='1' id='type-id-125'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_FDIR_PBALLOC_64K' value='0'/>
      <enumerator name='RTE_FDIR_PBALLOC_128K' value='1'/>
      <enumerator name='RTE_FDIR_PBALLOC_256K' value='2'/>
    </enum-decl>
    <enum-decl name='rte_fdir_status_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='993' column='1' id='type-id-126'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_FDIR_NO_REPORT_STATUS' value='0'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS' value='1'/>
      <enumerator name='RTE_FDIR_REPORT_STATUS_ALWAYS' value='2'/>
    </enum-decl>
    <class-decl name='rte_eth_fdir_masks' size-in-bits='544' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='533' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_tci_mask' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv4_mask' type-id='type-id-129' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ipv6_mask' type-id='type-id-130' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='src_port_mask' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='dst_port_mask' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mac_addr_byte_mask' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='tunnel_id_mask' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tunnel_type_mask' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv4_flow' size-in-bits='96' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='342' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dst_ip' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tos' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='ttl' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='proto' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_ipv6_flow' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='381' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ip' type-id='type-id-131' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_ip' type-id='type-id-131' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tc' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='proto' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='hop_limits' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='386' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='128' id='type-id-131'>
      <subrange length='4' type-id='type-id-30' id='type-id-132'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_conf' size-in-bits='5792' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='591' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_payloads' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_flexmasks' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flex_set' type-id='type-id-133' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='flex_mask' type-id='type-id-134' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='596' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_flex_payload_cfg' size-in-bits='288' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='568' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-136' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='src_offset' type-id='type-id-137' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_payload_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='555' column='1' id='type-id-136'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_ETH_PAYLOAD_UNKNOWN' value='0'/>
      <enumerator name='RTE_ETH_RAW_PAYLOAD' value='1'/>
      <enumerator name='RTE_ETH_L2_PAYLOAD' value='2'/>
      <enumerator name='RTE_ETH_L3_PAYLOAD' value='3'/>
      <enumerator name='RTE_ETH_L4_PAYLOAD' value='4'/>
      <enumerator name='RTE_ETH_PAYLOAD_MAX' value='8'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='256' id='type-id-137'>
      <subrange length='16' type-id='type-id-30' id='type-id-138'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='2304' id='type-id-133'>
      <subrange length='8' type-id='type-id-30' id='type-id-119'/>

    </array-type-def>
    <class-decl name='rte_eth_fdir_flex_mask' size-in-bits='144' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='581' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flow_type' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mask' type-id='type-id-140' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='583' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='128' id='type-id-140'>
      <subrange length='16' type-id='type-id-30' id='type-id-138'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='3456' id='type-id-134'>
      <subrange length='24' type-id='type-id-30' id='type-id-141'/>

    </array-type-def>
    <class-decl name='rte_intr_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1031' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lsc' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='rxq' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='rmv' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1037' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_ether_addr' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='60' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr_bytes' type-id='type-id-143' visibility='default' filepath='../lib/librte_net/rte_ether.h' line='61' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='48' id='type-id-143'>
      <subrange length='6' type-id='type-id-30' id='type-id-144'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-90'/>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='8192' id='type-id-91'>
      <subrange length='128' type-id='type-id-30' id='type-id-145'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='8192' id='type-id-93'>
      <subrange length='1024' type-id='type-id-30' id='type-id-146'/>

    </array-type-def>
    <enum-decl name='rte_kernel_driver' filepath='../lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-94'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_KDRV_UNKNOWN' value='0'/>
      <enumerator name='RTE_KDRV_IGB_UIO' value='1'/>
      <enumerator name='RTE_KDRV_VFIO' value='2'/>
      <enumerator name='RTE_KDRV_UIO_GENERIC' value='3'/>
      <enumerator name='RTE_KDRV_NIC_UIO' value='4'/>
      <enumerator name='RTE_KDRV_NONE' value='5'/>
    </enum-decl>
    <class-decl name='rte_vlan_filter_conf' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='427' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ids' type-id='type-id-147' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='428' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='4096' id='type-id-147'>
      <subrange length='64' type-id='type-id-30' id='type-id-97'/>

    </array-type-def>
    <class-decl name='rte_eth_dev_owner' size-in-bits='576' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1490' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-85' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1492' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='256' id='type-id-14'>
      <subrange length='4' type-id='type-id-30' id='type-id-132'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='256' id='type-id-15'>
      <subrange length='4' type-id='type-id-30' id='type-id-132'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-6'/>
    <class-decl name='eth_dev_ops' size-in-bits='6016' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='609' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_configure' type-id='type-id-149' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_start' type-id='type-id-150' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_stop' type-id='type-id-151' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_set_link_up' type-id='type-id-152' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_set_link_down' type-id='type-id-153' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_close' type-id='type-id-154' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dev_reset' type-id='type-id-155' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link_update' type-id='type-id-156' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='is_removed' type-id='type-id-157' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='promiscuous_enable' type-id='type-id-158' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='promiscuous_disable' type-id='type-id-159' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='allmulticast_enable' type-id='type-id-160' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='allmulticast_disable' type-id='type-id-161' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mac_addr_remove' type-id='type-id-162' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='mac_addr_add' type-id='type-id-163' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='mac_addr_set' type-id='type-id-164' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_mc_addr_list' type-id='type-id-165' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mtu_set' type-id='type-id-166' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='stats_get' type-id='type-id-167' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='stats_reset' type-id='type-id-168' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='xstats_get' type-id='type-id-169' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='xstats_reset' type-id='type-id-170' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='xstats_get_names' type-id='type-id-171' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='queue_stats_mapping_set' type-id='type-id-172' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='dev_infos_get' type-id='type-id-173' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rxq_info_get' type-id='type-id-174' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='txq_info_get' type-id='type-id-175' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='rx_burst_mode_get' type-id='type-id-176' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tx_burst_mode_get' type-id='type-id-176' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='fw_version_get' type-id='type-id-177' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dev_supported_ptypes_get' type-id='type-id-178' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='dev_ptypes_set' type-id='type-id-179' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='vlan_filter_set' type-id='type-id-180' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='vlan_tpid_set' type-id='type-id-181' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='vlan_strip_queue_set' type-id='type-id-182' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='vlan_offload_set' type-id='type-id-183' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='vlan_pvid_set' type-id='type-id-184' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='rx_queue_start' type-id='type-id-185' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='rx_queue_stop' type-id='type-id-186' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tx_queue_start' type-id='type-id-185' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tx_queue_stop' type-id='type-id-186' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='rx_queue_setup' type-id='type-id-187' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='rx_queue_release' type-id='type-id-188' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='rx_queue_count' type-id='type-id-189' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='rx_descriptor_done' type-id='type-id-190' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='rx_descriptor_status' type-id='type-id-191' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tx_descriptor_status' type-id='type-id-192' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='rx_queue_intr_enable' type-id='type-id-193' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='rx_queue_intr_disable' type-id='type-id-194' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tx_queue_setup' type-id='type-id-195' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tx_queue_release' type-id='type-id-188' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tx_done_cleanup' type-id='type-id-196' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dev_led_on' type-id='type-id-197' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dev_led_off' type-id='type-id-198' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='flow_ctrl_get' type-id='type-id-199' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='flow_ctrl_set' type-id='type-id-200' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='priority_flow_ctrl_set' type-id='type-id-201' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='uc_hash_table_set' type-id='type-id-202' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='uc_all_hash_table_set' type-id='type-id-203' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='mirror_rule_set' type-id='type-id-204' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='mirror_rule_reset' type-id='type-id-205' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='udp_tunnel_port_add' type-id='type-id-206' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='udp_tunnel_port_del' type-id='type-id-207' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='l2_tunnel_eth_type_conf' type-id='type-id-208' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='l2_tunnel_offload_set' type-id='type-id-209' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='set_queue_rate_limit' type-id='type-id-210' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='rss_hash_update' type-id='type-id-211' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='rss_hash_conf_get' type-id='type-id-212' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='reta_update' type-id='type-id-213' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='reta_query' type-id='type-id-214' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='get_reg' type-id='type-id-215' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='get_eeprom_length' type-id='type-id-216' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='get_eeprom' type-id='type-id-217' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='set_eeprom' type-id='type-id-218' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='get_module_info' type-id='type-id-219' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='get_module_eeprom' type-id='type-id-220' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='filter_ctrl' type-id='type-id-221' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='get_dcb_info' type-id='type-id-222' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='timesync_enable' type-id='type-id-223' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='timesync_disable' type-id='type-id-224' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='timesync_read_rx_timestamp' type-id='type-id-225' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='timesync_read_tx_timestamp' type-id='type-id-226' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='timesync_adjust_time' type-id='type-id-227' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='timesync_read_time' type-id='type-id-228' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='timesync_write_time' type-id='type-id-229' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='read_clock' type-id='type-id-230' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='xstats_get_by_id' type-id='type-id-231' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='xstats_get_names_by_id' type-id='type-id-232' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='tm_ops_get' type-id='type-id-233' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='mtr_ops_get' type-id='type-id-234' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='pool_ops_supported' type-id='type-id-235' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='hairpin_cap_get' type-id='type-id-236' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='rx_hairpin_queue_setup' type-id='type-id-237' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='tx_hairpin_queue_setup' type-id='type-id-238' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <typedef-decl name='eth_dev_configure_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='31' column='1' id='type-id-149'/>
    <typedef-decl name='eth_dev_start_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='34' column='1' id='type-id-150'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <typedef-decl name='eth_dev_stop_t' type-id='type-id-243' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='37' column='1' id='type-id-151'/>
    <typedef-decl name='eth_dev_set_link_up_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='40' column='1' id='type-id-152'/>
    <typedef-decl name='eth_dev_set_link_down_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='43' column='1' id='type-id-153'/>
    <typedef-decl name='eth_dev_close_t' type-id='type-id-243' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='46' column='1' id='type-id-154'/>
    <typedef-decl name='eth_dev_reset_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='49' column='1' id='type-id-155'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <typedef-decl name='eth_link_update_t' type-id='type-id-245' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='155' column='1' id='type-id-156'/>
    <typedef-decl name='eth_is_removed_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='52' column='1' id='type-id-157'/>
    <typedef-decl name='eth_promiscuous_enable_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='78' column='1' id='type-id-158'/>
    <typedef-decl name='eth_promiscuous_disable_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='103' column='1' id='type-id-159'/>
    <typedef-decl name='eth_allmulticast_enable_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='128' column='1' id='type-id-160'/>
    <typedef-decl name='eth_allmulticast_disable_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='153' column='1' id='type-id-161'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <typedef-decl name='eth_mac_addr_remove_t' type-id='type-id-247' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='391' column='1' id='type-id-162'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <typedef-decl name='eth_mac_addr_add_t' type-id='type-id-249' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='394' column='1' id='type-id-163'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <typedef-decl name='eth_mac_addr_set_t' type-id='type-id-251' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='400' column='1' id='type-id-164'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <typedef-decl name='eth_set_mc_addr_list_t' type-id='type-id-253' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='436' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <typedef-decl name='mtu_set_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='315' column='1' id='type-id-166'/>
    <class-decl name='rte_eth_stats' size-in-bits='5632' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='243' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipackets' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opackets' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ibytes' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='obytes' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='imissed' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ierrors' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='oerrors' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rx_nombuf' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='q_ipackets' type-id='type-id-257' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='q_opackets' type-id='type-id-257' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='q_ibytes' type-id='type-id-257' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='q_obytes' type-id='type-id-257' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='q_errors' type-id='type-id-257' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='263' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='1024' id='type-id-257'>
      <subrange length='16' type-id='type-id-30' id='type-id-138'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <typedef-decl name='eth_stats_get_t' type-id='type-id-260' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='159' column='1' id='type-id-167'/>
    <typedef-decl name='eth_stats_reset_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='182' column='1' id='type-id-168'/>
    <class-decl name='rte_eth_xstat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1337' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1339' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <typedef-decl name='eth_xstats_get_t' type-id='type-id-264' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='184' column='1' id='type-id-169'/>
    <typedef-decl name='eth_xstats_reset_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='213' column='1' id='type-id-170'/>
    <class-decl name='rte_eth_xstat_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1349' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-85' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1350' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-268'/>
    <typedef-decl name='eth_xstats_get_names_t' type-id='type-id-268' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='215' column='1' id='type-id-171'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <typedef-decl name='eth_queue_stats_mapping_set_t' type-id='type-id-270' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='224' column='1' id='type-id-172'/>
    <class-decl name='rte_eth_dev_info' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1226' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='type-id-9' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driver_name' type-id='type-id-272' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='if_index' type-id='type-id-36' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='min_mtu' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='max_mtu' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_flags' type-id='type-id-273' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_rx_bufsize' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_rx_pktlen' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_lro_pkt_size' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='max_rx_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='max_tx_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_mac_addrs' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='max_hash_mac_addrs' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='max_vfs' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='max_vmdq_pools' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rx_offload_capa' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tx_offload_capa' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rx_queue_offload_capa' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tx_queue_offload_capa' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reta_size' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='hash_key_size' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='flow_type_rss_offloads' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_rxconf' type-id='type-id-274' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='default_txconf' type-id='type-id-275' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='vmdq_queue_base' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1744'>
        <var-decl name='vmdq_queue_num' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='vmdq_pool_base' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1776'>
        <var-decl name='rx_desc_lim' type-id='type-id-276' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tx_desc_lim' type-id='type-id-276' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='speed_capa' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_rx_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2000'>
        <var-decl name='nb_tx_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='default_rxportconf' type-id='type-id-277' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='default_txportconf' type-id='type-id-277' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='dev_capa' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='switch_info' type-id='type-id-278' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='reserved_64s' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='reserved_ptrs' type-id='type-id-107' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1282' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-280' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-281' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus' type-id='type-id-282' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devargs' type-id='type-id-283' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-9' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-284' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-284'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-285'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-272'/>
    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-287' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alias' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-288' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-289' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-290'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-281'/>
    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-292' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan' type-id='type-id-293' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probe' type-id='type-id-294' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='find_device' type-id='type-id-295' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='plug' type-id='type-id-296' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unplug' type-id='type-id-297' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parse' type-id='type-id-298' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dma_map' type-id='type-id-299' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dma_unmap' type-id='type-id-300' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='conf' type-id='type-id-301' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_iommu_class' type-id='type-id-302' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dev_iterate' type-id='type-id-303' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='hot_unplug_handler' type-id='type-id-304' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sigbus_handler' type-id='type-id-305' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-306' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-307' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <typedef-decl name='rte_bus_scan_t' type-id='type-id-309' filepath='../lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-293'/>
    <typedef-decl name='rte_bus_probe_t' type-id='type-id-309' filepath='../lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-294'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-310'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-313' filepath='../lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-314'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-316' filepath='../lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-295'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <typedef-decl name='rte_bus_plug_t' type-id='type-id-318' filepath='../lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-296'/>
    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-318' filepath='../lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-297'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <typedef-decl name='rte_bus_parse_t' type-id='type-id-320' filepath='../lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-298'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-322' filepath='../lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-299'/>
    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-322' filepath='../lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-300'/>
    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scan_mode' type-id='type-id-323' visibility='default' filepath='../lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_bus_scan_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-323'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
      <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
      <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
    </enum-decl>
    <enum-decl name='rte_iova_mode' filepath='../lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-324'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_IOVA_DC' value='0'/>
      <enumerator name='RTE_IOVA_PA' value='1'/>
      <enumerator name='RTE_IOVA_VA' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-326' filepath='../lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-302'/>
    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev_str' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus_str' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cls_str' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus' type-id='type-id-306' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cls' type-id='type-id-328' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device' type-id='type-id-9' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='class_device' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_class' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='35' column='1' id='type-id-329'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-330' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_iterate' type-id='type-id-303' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1' id='type-id-330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-328' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-331' visibility='default' filepath='../lib/librte_eal/common/include/rte_class.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-331'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-333' filepath='../lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-303'/>
    <qualified-type-def type-id='type-id-327' const='yes' id='type-id-334'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-318' filepath='../lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-304'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-337' filepath='../lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-305'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-338'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-282'/>
    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-340' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-341' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='policy' type-id='type-id-342' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-85' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-343' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-306' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cls' type-id='type-id-328' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bus_str' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cls_str' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='data' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-340'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-283' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-344' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-344'/>
    <enum-decl name='rte_devtype' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-341'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
      <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
      <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
    </enum-decl>
    <enum-decl name='rte_dev_policy' filepath='../lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-342'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
      <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-343'>
      <data-member access='private'>
        <var-decl name='args' type-id='type-id-345' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drv_str' type-id='type-id-272' visibility='default' filepath='../lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-345'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-346'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-273'/>
    <class-decl name='rte_eth_rxconf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='818' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx_thresh' type-id='type-id-347' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rx_free_thresh' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='rx_drop_en' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='rx_deferred_start' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offloads' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved_64s' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='reserved_ptrs' type-id='type-id-107' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='831' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_thresh' size-in-bits='24' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='327' column='1' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pthresh' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='hthresh' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='wthresh' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_txconf' size-in-bits='448' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='837' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tx_thresh' type-id='type-id-347' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tx_rs_thresh' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='tx_free_thresh' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tx_deferred_start' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offloads' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_64s' type-id='type-id-29' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved_ptrs' type-id='type-id-107' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='852' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_desc_lim' size-in-bits='80' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='898' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_max' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='nb_min' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_align' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nb_seg_max' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_mtu_seg_max' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='924' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_portconf' size-in-bits='48' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1189' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='burst_size' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ring_size' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nb_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1192' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_switch_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1204' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-272' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='domain_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='port_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1207' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-350'/>
    <typedef-decl name='eth_dev_infos_get_t' type-id='type-id-350' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='230' column='1' id='type-id-173'/>
    <class-decl name='rte_eth_rxq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1289' column='1' id='type-id-351'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='type-id-26' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conf' type-id='type-id-274' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scattered_rx' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='nb_desc' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1293' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <typedef-decl name='eth_rxq_info_get_t' type-id='type-id-354' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='306' column='1' id='type-id-174'/>
    <class-decl name='rte_eth_txq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1300' column='1' id='type-id-355'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='conf' type-id='type-id-275' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_desc' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1302' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <typedef-decl name='eth_txq_info_get_t' type-id='type-id-358' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='309' column='1' id='type-id-175'/>
    <class-decl name='rte_eth_burst_mode' size-in-bits='8256' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1318' column='1' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='info' type-id='type-id-360' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1322' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='8192' id='type-id-360'>
      <subrange length='1024' type-id='type-id-30' id='type-id-146'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-361'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <typedef-decl name='eth_burst_mode_get_t' type-id='type-id-363' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='312' column='1' id='type-id-176'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <typedef-decl name='eth_fw_version_get_t' type-id='type-id-365' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='299' column='1' id='type-id-177'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <typedef-decl name='eth_dev_supported_ptypes_get_t' type-id='type-id-367' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='234' column='1' id='type-id-178'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <typedef-decl name='eth_dev_ptypes_set_t' type-id='type-id-369' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='249' column='1' id='type-id-179'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <typedef-decl name='vlan_filter_set_t' type-id='type-id-371' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='318' column='1' id='type-id-180'/>
    <enum-decl name='rte_vlan_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='416' column='1' id='type-id-372'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='ETH_VLAN_TYPE_UNKNOWN' value='0'/>
      <enumerator name='ETH_VLAN_TYPE_INNER' value='1'/>
      <enumerator name='ETH_VLAN_TYPE_OUTER' value='2'/>
      <enumerator name='ETH_VLAN_TYPE_MAX' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-374'/>
    <typedef-decl name='vlan_tpid_set_t' type-id='type-id-374' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='323' column='1' id='type-id-181'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <typedef-decl name='vlan_strip_queue_set_t' type-id='type-id-376' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='335' column='1' id='type-id-182'/>
    <typedef-decl name='vlan_offload_set_t' type-id='type-id-245' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='327' column='1' id='type-id-183'/>
    <typedef-decl name='vlan_pvid_set_t' type-id='type-id-371' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='330' column='1' id='type-id-184'/>
    <typedef-decl name='eth_queue_start_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='252' column='1' id='type-id-185'/>
    <typedef-decl name='eth_queue_stop_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='256' column='1' id='type-id-186'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-377'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-380'/>
    <typedef-decl name='eth_rx_queue_setup_t' type-id='type-id-380' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='260' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-382'/>
    <typedef-decl name='eth_queue_release_t' type-id='type-id-382' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='283' column='1' id='type-id-188'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <typedef-decl name='eth_rx_queue_count_t' type-id='type-id-384' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='286' column='1' id='type-id-189'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <typedef-decl name='eth_rx_descriptor_done_t' type-id='type-id-386' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='290' column='1' id='type-id-190'/>
    <typedef-decl name='eth_rx_descriptor_status_t' type-id='type-id-386' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='293' column='1' id='type-id-191'/>
    <typedef-decl name='eth_tx_descriptor_status_t' type-id='type-id-386' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='296' column='1' id='type-id-192'/>
    <typedef-decl name='eth_rx_enable_intr_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='275' column='1' id='type-id-193'/>
    <typedef-decl name='eth_rx_disable_intr_t' type-id='type-id-255' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='279' column='1' id='type-id-194'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-387'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <typedef-decl name='eth_tx_queue_setup_t' type-id='type-id-390' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='268' column='1' id='type-id-195'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <typedef-decl name='eth_tx_done_cleanup_t' type-id='type-id-392' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='303' column='1' id='type-id-196'/>
    <typedef-decl name='eth_dev_led_on_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='385' column='1' id='type-id-197'/>
    <typedef-decl name='eth_dev_led_off_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='388' column='1' id='type-id-198'/>
    <class-decl name='rte_eth_fc_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='942' column='1' id='type-id-393'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='high_water' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='low_water' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pause_time' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='send_xon' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mode' type-id='type-id-394' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_ctrl_frame_fwd' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='autoneg' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='949' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_fc_mode' filepath='../lib/librte_ethdev/rte_ethdev.h' line='930' column='1' id='type-id-394'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_FC_NONE' value='0'/>
      <enumerator name='RTE_FC_RX_PAUSE' value='1'/>
      <enumerator name='RTE_FC_TX_PAUSE' value='2'/>
      <enumerator name='RTE_FC_FULL' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-395'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-397'/>
    <typedef-decl name='flow_ctrl_get_t' type-id='type-id-397' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='355' column='1' id='type-id-199'/>
    <typedef-decl name='flow_ctrl_set_t' type-id='type-id-397' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='359' column='1' id='type-id-200'/>
    <class-decl name='rte_eth_pfc_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='957' column='1' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='type-id-393' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='priority' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <typedef-decl name='priority_flow_ctrl_set_t' type-id='type-id-401' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='363' column='1' id='type-id-201'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <typedef-decl name='eth_uc_hash_table_set_t' type-id='type-id-403' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='404' column='1' id='type-id-202'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <typedef-decl name='eth_uc_all_hash_table_set_t' type-id='type-id-405' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='409' column='1' id='type-id-203'/>
    <class-decl name='rte_eth_mirror_conf' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='670' column='1' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rule_type' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dst_pool' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pool_mask' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vlan' type-id='type-id-407' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='675' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_vlan_mirror' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='661' column='1' id='type-id-407'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vlan_mask' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vlan_id' type-id='type-id-408' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='664' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='1024' id='type-id-408'>
      <subrange length='64' type-id='type-id-30' id='type-id-97'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-409'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <typedef-decl name='eth_mirror_rule_set_t' type-id='type-id-411' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='418' column='1' id='type-id-204'/>
    <typedef-decl name='eth_mirror_rule_reset_t' type-id='type-id-405' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='424' column='1' id='type-id-205'/>
    <class-decl name='rte_eth_udp_tunnel' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1023' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='udp_port' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='prot_type' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1025' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <typedef-decl name='eth_udp_tunnel_port_add_t' type-id='type-id-415' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='428' column='1' id='type-id-206'/>
    <typedef-decl name='eth_udp_tunnel_port_del_t' type-id='type-id-415' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='432' column='1' id='type-id-207'/>
    <class-decl name='rte_eth_l2_tunnel_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='751' column='1' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l2_tunnel_type' type-id='type-id-417' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ether_type' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tunnel_id' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vf_id' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rte_eth_tunnel_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='965' column='1' id='type-id-417'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_TUNNEL_TYPE_NONE' value='0'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN' value='1'/>
      <enumerator name='RTE_TUNNEL_TYPE_GENEVE' value='2'/>
      <enumerator name='RTE_TUNNEL_TYPE_TEREDO' value='3'/>
      <enumerator name='RTE_TUNNEL_TYPE_NVGRE' value='4'/>
      <enumerator name='RTE_TUNNEL_TYPE_IP_IN_GRE' value='5'/>
      <enumerator name='RTE_L2_TUNNEL_TYPE_E_TAG' value='6'/>
      <enumerator name='RTE_TUNNEL_TYPE_VXLAN_GPE' value='7'/>
      <enumerator name='RTE_TUNNEL_TYPE_MAX' value='8'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-418'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <typedef-decl name='eth_l2_tunnel_eth_type_conf_t' type-id='type-id-420' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='494' column='1' id='type-id-208'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <typedef-decl name='eth_l2_tunnel_offload_set_t' type-id='type-id-422' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='498' column='1' id='type-id-209'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <typedef-decl name='eth_set_queue_rate_limit_t' type-id='type-id-424' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='413' column='1' id='type-id-210'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-425'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <typedef-decl name='rss_hash_update_t' type-id='type-id-427' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='377' column='1' id='type-id-211'/>
    <typedef-decl name='rss_hash_conf_get_t' type-id='type-id-427' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='381' column='1' id='type-id-212'/>
    <class-decl name='rte_eth_rss_reta_entry64' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='684' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mask' type-id='type-id-24' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reta' type-id='type-id-408' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='687' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-431'/>
    <typedef-decl name='reta_update_t' type-id='type-id-431' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='367' column='1' id='type-id-213'/>
    <typedef-decl name='reta_query_t' type-id='type-id-431' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='372' column='1' id='type-id-214'/>
    <class-decl name='rte_dev_reg_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='13' column='1' id='type-id-432'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='width' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='version' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <typedef-decl name='eth_get_reg_t' type-id='type-id-435' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='471' column='1' id='type-id-215'/>
    <typedef-decl name='eth_get_eeprom_length_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='475' column='1' id='type-id-216'/>
    <class-decl name='rte_dev_eeprom_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='24' column='1' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='length' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='magic' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <typedef-decl name='eth_get_eeprom_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='478' column='1' id='type-id-217'/>
    <typedef-decl name='eth_set_eeprom_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='482' column='1' id='type-id-218'/>
    <class-decl name='rte_eth_dev_module_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='34' column='1' id='type-id-440'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eeprom_len' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_dev_info.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <typedef-decl name='eth_get_module_info_t' type-id='type-id-443' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='486' column='1' id='type-id-219'/>
    <typedef-decl name='eth_get_module_eeprom_t' type-id='type-id-439' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='490' column='1' id='type-id-220'/>
    <enum-decl name='rte_filter_type' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='28' column='1' id='type-id-444'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_ETH_FILTER_NONE' value='0'/>
      <enumerator name='RTE_ETH_FILTER_MACVLAN' value='1'/>
      <enumerator name='RTE_ETH_FILTER_ETHERTYPE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_FLEXIBLE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_SYN' value='4'/>
      <enumerator name='RTE_ETH_FILTER_NTUPLE' value='5'/>
      <enumerator name='RTE_ETH_FILTER_TUNNEL' value='6'/>
      <enumerator name='RTE_ETH_FILTER_FDIR' value='7'/>
      <enumerator name='RTE_ETH_FILTER_HASH' value='8'/>
      <enumerator name='RTE_ETH_FILTER_L2_TUNNEL' value='9'/>
      <enumerator name='RTE_ETH_FILTER_GENERIC' value='10'/>
      <enumerator name='RTE_ETH_FILTER_MAX' value='11'/>
    </enum-decl>
    <enum-decl name='rte_filter_op' filepath='../lib/librte_ethdev/rte_eth_ctrl.h' line='46' column='1' id='type-id-445'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_ETH_FILTER_NOP' value='0'/>
      <enumerator name='RTE_ETH_FILTER_ADD' value='1'/>
      <enumerator name='RTE_ETH_FILTER_UPDATE' value='2'/>
      <enumerator name='RTE_ETH_FILTER_DELETE' value='3'/>
      <enumerator name='RTE_ETH_FILTER_FLUSH' value='4'/>
      <enumerator name='RTE_ETH_FILTER_GET' value='5'/>
      <enumerator name='RTE_ETH_FILTER_SET' value='6'/>
      <enumerator name='RTE_ETH_FILTER_INFO' value='7'/>
      <enumerator name='RTE_ETH_FILTER_STATS' value='8'/>
      <enumerator name='RTE_ETH_FILTER_OP_MAX' value='9'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <typedef-decl name='eth_filter_ctrl_t' type-id='type-id-447' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='506' column='1' id='type-id-221'/>
    <class-decl name='rte_eth_dcb_info' size-in-bits='16520' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1377' column='1' id='type-id-448'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_tcs' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='prio_tc' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='tc_bws' type-id='type-id-117' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='tc_queue' type-id='type-id-449' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1382' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dcb_tc_queue_mapping' size-in-bits='16384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1360' column='1' id='type-id-449'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tc_rxq' type-id='type-id-450' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='tc_txq' type-id='type-id-450' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1362' column='1' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='nb_queue' type-id='type-id-92' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1364' column='1'/>
      </data-member>
    </class-decl>


    <array-type-def dimensions='2' type-id='type-id-451' size-in-bits='1152' id='type-id-450'>
      <subrange length='64' type-id='type-id-30' id='type-id-97'/>

      <subrange length='8' type-id='type-id-30' id='type-id-119'/>

    </array-type-def>


    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <typedef-decl name='eth_get_dcb_info' type-id='type-id-454' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='518' column='1' id='type-id-222'/>
    <typedef-decl name='eth_timesync_enable_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='441' column='1' id='type-id-223'/>
    <typedef-decl name='eth_timesync_disable_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='444' column='1' id='type-id-224'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-455'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-456' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-457' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-458'/>
    <typedef-decl name='__time_t' type-id='type-id-458' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-456'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-458' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-457'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <typedef-decl name='eth_timesync_read_rx_timestamp_t' type-id='type-id-461' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='447' column='1' id='type-id-225'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-463'/>
    <typedef-decl name='eth_timesync_read_tx_timestamp_t' type-id='type-id-463' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='452' column='1' id='type-id-226'/>
    <typedef-decl name='__int64_t' type-id='type-id-458' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-464'/>
    <typedef-decl name='int64_t' type-id='type-id-464' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-465'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <typedef-decl name='eth_timesync_adjust_time' type-id='type-id-467' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='456' column='1' id='type-id-227'/>
    <typedef-decl name='eth_timesync_read_time' type-id='type-id-463' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='459' column='1' id='type-id-228'/>
    <qualified-type-def type-id='type-id-455' const='yes' id='type-id-468'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <typedef-decl name='eth_timesync_write_time' type-id='type-id-471' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='463' column='1' id='type-id-229'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-472'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <typedef-decl name='eth_read_clock' type-id='type-id-474' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='467' column='1' id='type-id-230'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-475'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-478'/>
    <typedef-decl name='eth_xstats_get_by_id_t' type-id='type-id-478' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='188' column='1' id='type-id-231'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <typedef-decl name='eth_xstats_get_names_by_id_t' type-id='type-id-480' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='219' column='1' id='type-id-232'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-482'/>
    <typedef-decl name='eth_tm_ops_get_t' type-id='type-id-482' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='512' column='1' id='type-id-233'/>
    <typedef-decl name='eth_mtr_ops_get_t' type-id='type-id-482' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='515' column='1' id='type-id-234'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <typedef-decl name='eth_pool_ops_supported_t' type-id='type-id-484' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='522' column='1' id='type-id-235'/>
    <class-decl name='rte_eth_hairpin_cap' size-in-bits='64' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='861' column='1' id='type-id-485'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_nb_queues' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_rx_2_tx' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_tx_2_rx' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='max_nb_desc' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='868' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <typedef-decl name='eth_hairpin_cap_get_t' type-id='type-id-488' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='543' column='1' id='type-id-236'/>
    <class-decl name='rte_eth_hairpin_conf' size-in-bits='1040' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='890' column='1' id='type-id-489'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='peer_count' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='peers' type-id='type-id-490' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='892' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_hairpin_peer' size-in-bits='32' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='879' column='1' id='type-id-491'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='queue' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='881' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-491' size-in-bits='1024' id='type-id-490'>
      <subrange length='32' type-id='type-id-30' id='type-id-47'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-489' const='yes' id='type-id-492'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-493'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <typedef-decl name='eth_rx_hairpin_queue_setup_t' type-id='type-id-495' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='571' column='1' id='type-id-237'/>
    <typedef-decl name='eth_tx_hairpin_queue_setup_t' type-id='type-id-495' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='601' column='1' id='type-id-238'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-496'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-8'/>
    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-497'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-498' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-499' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_intr' type-id='type-id-25' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_efd' type-id='type-id-25' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='efd_counter_size' type-id='type-id-92' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efds' type-id='type-id-500' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='elist' type-id='type-id-501' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213184'>
        <var-decl name='intr_vec' type-id='type-id-502' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-498'>
      <data-member access='private'>
        <var-decl name='vfio_dev_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uio_cfg_fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
      </data-member>
    </union-decl>
    <enum-decl name='rte_intr_handle_type' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-499'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
      <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
      <enumerator name='RTE_INTR_HANDLE_UIO_INTX' value='2'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_LEGACY' value='3'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSI' value='4'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_MSIX' value='5'/>
      <enumerator name='RTE_INTR_HANDLE_ALARM' value='6'/>
      <enumerator name='RTE_INTR_HANDLE_EXT' value='7'/>
      <enumerator name='RTE_INTR_HANDLE_VDEV' value='8'/>
      <enumerator name='RTE_INTR_HANDLE_DEV_EVENT' value='9'/>
      <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
      <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='16384' id='type-id-500'>
      <subrange length='512' type-id='type-id-30' id='type-id-503'/>

    </array-type-def>
    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-504'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-505' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epfd' type-id='type-id-1' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epdata' type-id='type-id-506' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-25' volatile='yes' id='type-id-505'/>
    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-506'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='type-id-25' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fun' type-id='type-id-507' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-7' visibility='default' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-509' filepath='../lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-507'/>

    <array-type-def dimensions='1' type-id='type-id-504' size-in-bits='196608' id='type-id-501'>
      <subrange length='512' type-id='type-id-30' id='type-id-503'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-502'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-10'/>
    <class-decl name='rte_eth_dev_cb_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='type-id-510' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='type-id-511' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_eth_dev_callback' size-in-bits='384' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='175' column='1' id='type-id-512'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-513' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fn' type-id='type-id-514' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ret_param' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='event' type-id='type-id-515' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='active' type-id='type-id-25' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='176' column='1' id='type-id-513'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='type-id-510' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='type-id-511' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.c' line='176' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-511'/>
    <enum-decl name='rte_eth_event_type' filepath='../lib/librte_ethdev/rte_ethdev.h' line='3005' column='1' id='type-id-515'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_ETH_EVENT_UNKNOWN' value='0'/>
      <enumerator name='RTE_ETH_EVENT_INTR_LSC' value='1'/>
      <enumerator name='RTE_ETH_EVENT_QUEUE_STATE' value='2'/>
      <enumerator name='RTE_ETH_EVENT_INTR_RESET' value='3'/>
      <enumerator name='RTE_ETH_EVENT_VF_MBOX' value='4'/>
      <enumerator name='RTE_ETH_EVENT_MACSEC' value='5'/>
      <enumerator name='RTE_ETH_EVENT_INTR_RMV' value='6'/>
      <enumerator name='RTE_ETH_EVENT_NEW' value='7'/>
      <enumerator name='RTE_ETH_EVENT_DESTROY' value='8'/>
      <enumerator name='RTE_ETH_EVENT_IPSEC' value='9'/>
      <enumerator name='RTE_ETH_EVENT_MAX' value='10'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-517'/>
    <typedef-decl name='rte_eth_dev_cb_fn' type-id='type-id-517' filepath='../lib/librte_ethdev/rte_ethdev.h' line='3021' column='1' id='type-id-514'/>
    <class-decl name='rte_eth_rxtx_callback' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='758' column='1' id='type-id-518'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-519' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn' type-id='type-id-520' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='param' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='760' column='1' id='type-id-520'>
      <data-member access='private'>
        <var-decl name='rx' type-id='type-id-521' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='761' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tx' type-id='type-id-522' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='762' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <typedef-decl name='rte_rx_callback_fn' type-id='type-id-524' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1437' column='1' id='type-id-521'/>
    <pointer-type-def type-id='type-id-525' size-in-bits='64' id='type-id-526'/>
    <typedef-decl name='rte_tx_callback_fn' type-id='type-id-526' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1461' column='1' id='type-id-522'/>

    <array-type-def dimensions='1' type-id='type-id-519' size-in-bits='65536' id='type-id-12'>
      <subrange length='1024' type-id='type-id-30' id='type-id-146'/>

    </array-type-def>
    <enum-decl name='rte_eth_dev_state' filepath='../lib/librte_ethdev/rte_ethdev.h' line='1467' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-108'/>
      <enumerator name='RTE_ETH_DEV_UNUSED' value='0'/>
      <enumerator name='RTE_ETH_DEV_ATTACHED' value='1'/>
      <enumerator name='RTE_ETH_DEV_REMOVED' value='2'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='infinite' id='type-id-527'>
      <subrange length='infinite' id='type-id-32'/>

    </array-type-def>
    <var-decl name='rte_eth_devices' type-id='type-id-527' mangled-name='rte_eth_devices' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_core.h' line='884' column='1' elf-symbol-id='rte_eth_devices@@DPDK_20.0'/>
    <function-decl name='rte_eth_dev_pool_ops_supported' mangled-name='rte_eth_dev_pool_ops_supported' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_pool_ops_supported@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5026' column='1'/>
      <parameter type-id='type-id-272' name='pool' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5026' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-528'/>
    <function-decl name='rte_eth_dev_adjust_nb_rx_tx_desc' mangled-name='rte_eth_dev_adjust_nb_rx_tx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_adjust_nb_rx_tx_desc@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4971' column='1'/>
      <parameter type-id='type-id-528' name='nb_rx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4972' column='1'/>
      <parameter type-id='type-id-528' name='nb_tx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4973' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_l2_tunnel_offload_set' mangled-name='rte_eth_dev_l2_tunnel_offload_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_l2_tunnel_offload_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4926' column='1'/>
      <parameter type-id='type-id-418' name='l2_tunnel' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4927' column='1'/>
      <parameter type-id='type-id-25' name='mask' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4928' column='1'/>
      <parameter type-id='type-id-92' name='en' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4929' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_l2_tunnel_eth_type_conf' mangled-name='rte_eth_dev_l2_tunnel_eth_type_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_l2_tunnel_eth_type_conf@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4902' column='1'/>
      <parameter type-id='type-id-418' name='l2_tunnel' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4903' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_dcb_info' mangled-name='rte_eth_dev_get_dcb_info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_dcb_info@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4887' column='1'/>
      <parameter type-id='type-id-452' name='dcb_info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4888' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_eeprom' mangled-name='rte_eth_dev_set_eeprom' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_eeprom@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1'/>
      <parameter type-id='type-id-437' name='info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_eeprom' mangled-name='rte_eth_dev_get_eeprom' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_eeprom@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1'/>
      <parameter type-id='type-id-437' name='info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_eeprom_length' mangled-name='rte_eth_dev_get_eeprom_length' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_eeprom_length@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_reg_info' mangled-name='rte_eth_dev_get_reg_info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4813' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_reg_info@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4813' column='1'/>
      <parameter type-id='type-id-433' name='info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4813' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_write_time' mangled-name='rte_eth_timesync_write_time' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_write_time@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4788' column='1'/>
      <parameter type-id='type-id-469' name='timestamp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4788' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_read_time' mangled-name='rte_eth_timesync_read_time' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_read_time@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4775' column='1'/>
      <parameter type-id='type-id-459' name='timestamp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4775' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_adjust_time' mangled-name='rte_eth_timesync_adjust_time' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_adjust_time@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4762' column='1'/>
      <parameter type-id='type-id-465' name='delta' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4762' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_read_tx_timestamp' mangled-name='rte_eth_timesync_read_tx_timestamp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4748' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_read_tx_timestamp@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4775' column='1'/>
      <parameter type-id='type-id-459' name='timestamp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4775' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_read_rx_timestamp' mangled-name='rte_eth_timesync_read_rx_timestamp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_read_rx_timestamp@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4734' column='1'/>
      <parameter type-id='type-id-459' name='timestamp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4734' column='1'/>
      <parameter type-id='type-id-25' name='flags' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4735' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_disable' mangled-name='rte_eth_timesync_disable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_disable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_timesync_enable' mangled-name='rte_eth_timesync_enable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_timesync_enable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_mc_addr_list' mangled-name='rte_eth_dev_set_mc_addr_list' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_mc_addr_list@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4695' column='1'/>
      <parameter type-id='type-id-90' name='mc_addr_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4696' column='1'/>
      <parameter type-id='type-id-25' name='nb_mc_addr' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4697' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_tx_queue_info_get' mangled-name='rte_eth_tx_queue_info_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_queue_info_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4615' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4615' column='1'/>
      <parameter type-id='type-id-356' name='qinfo' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4616' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_rx_queue_info_get' mangled-name='rte_eth_rx_queue_info_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_rx_queue_info_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4584' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4584' column='1'/>
      <parameter type-id='type-id-352' name='qinfo' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4585' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-518' const='yes' id='type-id-529'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <function-decl name='rte_eth_remove_tx_callback' mangled-name='rte_eth_remove_tx_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_remove_tx_callback@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4550' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4550' column='1'/>
      <parameter type-id='type-id-530' name='user_cb' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4551' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_remove_rx_callback' mangled-name='rte_eth_remove_rx_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_remove_rx_callback@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4550' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4550' column='1'/>
      <parameter type-id='type-id-530' name='user_cb' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4551' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_add_tx_callback' mangled-name='rte_eth_add_tx_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_add_tx_callback@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4465' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4465' column='1'/>
      <parameter type-id='type-id-522' name='fn' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4466' column='1'/>
      <parameter type-id='type-id-7' name='user_param' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4466' column='1'/>
      <return type-id='type-id-530'/>
    </function-decl>
    <function-decl name='rte_eth_add_first_rx_callback' mangled-name='rte_eth_add_first_rx_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_add_first_rx_callback@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4430' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4430' column='1'/>
      <parameter type-id='type-id-521' name='fn' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4431' column='1'/>
      <parameter type-id='type-id-7' name='user_param' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4431' column='1'/>
      <return type-id='type-id-530'/>
    </function-decl>
    <function-decl name='rte_eth_add_rx_callback' mangled-name='rte_eth_add_rx_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_add_rx_callback@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4381' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4381' column='1'/>
      <parameter type-id='type-id-521' name='fn' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4382' column='1'/>
      <parameter type-id='type-id-7' name='user_param' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4382' column='1'/>
      <return type-id='type-id-530'/>
    </function-decl>
    <function-decl name='rte_eth_dev_filter_ctrl' mangled-name='rte_eth_dev_filter_ctrl' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_filter_ctrl@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4367' column='1'/>
      <parameter type-id='type-id-444' name='filter_type' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4367' column='1'/>
      <parameter type-id='type-id-445' name='filter_op' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4368' column='1'/>
      <parameter type-id='type-id-7' name='arg' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4368' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_filter_supported' mangled-name='rte_eth_dev_filter_supported' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_filter_supported@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4353' column='1'/>
      <parameter type-id='type-id-444' name='filter_type' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4354' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_intr_disable' mangled-name='rte_eth_dev_rx_intr_disable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_intr_disable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4338' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_intr_enable' mangled-name='rte_eth_dev_rx_intr_enable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_intr_enable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4338' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_intr_ctl_q' mangled-name='rte_eth_dev_rx_intr_ctl_q' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_intr_ctl_q@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4282' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4282' column='1'/>
      <parameter type-id='type-id-1' name='epfd' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4283' column='1'/>
      <parameter type-id='type-id-1' name='op' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4283' column='1'/>
      <parameter type-id='type-id-7' name='data' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4283' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-531'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <function-decl name='rte_eth_dma_zone_reserve' mangled-name='rte_eth_dma_zone_reserve' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dma_zone_reserve@@DPDK_20.0'>
      <parameter type-id='type-id-532' name='dev' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4175' column='1'/>
      <parameter type-id='type-id-272' name='ring_name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4175' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4176' column='1'/>
      <parameter type-id='type-id-50' name='size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4176' column='1'/>
      <parameter type-id='type-id-36' name='align' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4176' column='1'/>
      <parameter type-id='type-id-1' name='socket_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4177' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_intr_ctl' mangled-name='rte_eth_dev_rx_intr_ctl' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_intr_ctl@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4101' column='1'/>
      <parameter type-id='type-id-1' name='epfd' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4101' column='1'/>
      <parameter type-id='type-id-1' name='op' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4101' column='1'/>
      <parameter type-id='type-id-7' name='data' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4101' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_probing_finish' mangled-name='rte_eth_dev_probing_finish' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_probing_finish@@DPDK_20.0'>
      <parameter type-id='type-id-239' name='dev' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4090' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='_rte_eth_dev_callback_process' mangled-name='_rte_eth_dev_callback_process' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_rte_eth_dev_callback_process@@DPDK_20.0'>
      <parameter type-id='type-id-239' name='dev' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4063' column='1'/>
      <parameter type-id='type-id-515' name='event' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4064' column='1'/>
      <parameter type-id='type-id-7' name='ret_param' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4064' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_callback_unregister' mangled-name='rte_eth_dev_callback_unregister' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_callback_unregister@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4006' column='1'/>
      <parameter type-id='type-id-515' name='event' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4007' column='1'/>
      <parameter type-id='type-id-514' name='cb_fn' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4008' column='1'/>
      <parameter type-id='type-id-7' name='cb_arg' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4008' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_callback_register' mangled-name='rte_eth_dev_callback_register' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_callback_register@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3944' column='1'/>
      <parameter type-id='type-id-515' name='event' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3945' column='1'/>
      <parameter type-id='type-id-514' name='cb_fn' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3946' column='1'/>
      <parameter type-id='type-id-7' name='cb_arg' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3946' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_mirror_rule_reset' mangled-name='rte_eth_mirror_rule_reset' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_mirror_rule_reset@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3922' column='1'/>
      <parameter type-id='type-id-92' name='rule_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3922' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_mirror_rule_set' mangled-name='rte_eth_mirror_rule_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_mirror_rule_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3881' column='1'/>
      <parameter type-id='type-id-409' name='mirror_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3882' column='1'/>
      <parameter type-id='type-id-92' name='rule_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3883' column='1'/>
      <parameter type-id='type-id-92' name='on' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3883' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_set_queue_rate_limit' mangled-name='rte_eth_set_queue_rate_limit' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_set_queue_rate_limit@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3844' column='1'/>
      <parameter type-id='type-id-18' name='queue_idx' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3844' column='1'/>
      <parameter type-id='type-id-18' name='tx_rate' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3845' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_uc_all_hash_table_set' mangled-name='rte_eth_dev_uc_all_hash_table_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_uc_all_hash_table_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3922' column='1'/>
      <parameter type-id='type-id-92' name='rule_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3922' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_uc_hash_table_set' mangled-name='rte_eth_dev_uc_hash_table_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_uc_hash_table_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3778' column='1'/>
      <parameter type-id='type-id-90' name='addr' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3778' column='1'/>
      <parameter type-id='type-id-92' name='on' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3779' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_default_mac_addr_set' mangled-name='rte_eth_dev_default_mac_addr_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_default_mac_addr_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3726' column='1'/>
      <parameter type-id='type-id-90' name='addr' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3726' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_mac_addr_remove' mangled-name='rte_eth_dev_mac_addr_remove' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_mac_addr_remove@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3726' column='1'/>
      <parameter type-id='type-id-90' name='addr' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3726' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_mac_addr_add' mangled-name='rte_eth_dev_mac_addr_add' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_mac_addr_add@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3642' column='1'/>
      <parameter type-id='type-id-90' name='addr' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3642' column='1'/>
      <parameter type-id='type-id-25' name='pool' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3643' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_led_off' mangled-name='rte_eth_led_off' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_led_off@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_led_on' mangled-name='rte_eth_led_on' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_led_on@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_udp_tunnel_port_delete' mangled-name='rte_eth_dev_udp_tunnel_port_delete' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_udp_tunnel_port_delete@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3570' column='1'/>
      <parameter type-id='type-id-413' name='udp_tunnel' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3571' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_udp_tunnel_port_add' mangled-name='rte_eth_dev_udp_tunnel_port_add' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_udp_tunnel_port_add@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3570' column='1'/>
      <parameter type-id='type-id-413' name='udp_tunnel' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3571' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rss_hash_conf_get' mangled-name='rte_eth_dev_rss_hash_conf_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rss_hash_conf_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3534' column='1'/>
      <parameter type-id='type-id-425' name='rss_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3535' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rss_hash_update' mangled-name='rte_eth_dev_rss_hash_update' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rss_hash_update@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3504' column='1'/>
      <parameter type-id='type-id-425' name='rss_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3505' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rss_reta_query' mangled-name='rte_eth_dev_rss_reta_query' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3483' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rss_reta_query@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3483' column='1'/>
      <parameter type-id='type-id-429' name='reta_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3484' column='1'/>
      <parameter type-id='type-id-18' name='reta_size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3485' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rss_reta_update' mangled-name='rte_eth_dev_rss_reta_update' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rss_reta_update@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3483' column='1'/>
      <parameter type-id='type-id-429' name='reta_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3484' column='1'/>
      <parameter type-id='type-id-18' name='reta_size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3485' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_priority_flow_ctrl_set' mangled-name='rte_eth_dev_priority_flow_ctrl_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_priority_flow_ctrl_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3387' column='1'/>
      <parameter type-id='type-id-399' name='pfc_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3388' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_flow_ctrl_set' mangled-name='rte_eth_dev_flow_ctrl_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_flow_ctrl_set@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3371' column='1'/>
      <parameter type-id='type-id-395' name='fc_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3371' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_flow_ctrl_get' mangled-name='rte_eth_dev_flow_ctrl_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_flow_ctrl_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3371' column='1'/>
      <parameter type-id='type-id-395' name='fc_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3371' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_vlan_pvid' mangled-name='rte_eth_dev_set_vlan_pvid' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_vlan_pvid@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1'/>
      <parameter type-id='type-id-18' name='pvid' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1'/>
      <parameter type-id='type-id-1' name='on' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_vlan_offload' mangled-name='rte_eth_dev_get_vlan_offload' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_vlan_offload@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3321' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_vlan_offload' mangled-name='rte_eth_dev_set_vlan_offload' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_vlan_offload@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3249' column='1'/>
      <parameter type-id='type-id-1' name='offload_mask' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3249' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_vlan_ether_type' mangled-name='rte_eth_dev_set_vlan_ether_type' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_vlan_ether_type@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3234' column='1'/>
      <parameter type-id='type-id-372' name='vlan_type' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3235' column='1'/>
      <parameter type-id='type-id-18' name='tpid' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3236' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_vlan_strip_on_queue' mangled-name='rte_eth_dev_set_vlan_strip_on_queue' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_vlan_strip_on_queue@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1'/>
      <parameter type-id='type-id-18' name='pvid' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1'/>
      <parameter type-id='type-id-1' name='on' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3347' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_vlan_filter' mangled-name='rte_eth_dev_vlan_filter' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_vlan_filter@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3174' column='1'/>
      <parameter type-id='type-id-18' name='vlan_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3174' column='1'/>
      <parameter type-id='type-id-1' name='on' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3174' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_mtu' mangled-name='rte_eth_dev_set_mtu' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_mtu@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3141' column='1'/>
      <parameter type-id='type-id-18' name='mtu' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3141' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_mtu' mangled-name='rte_eth_dev_get_mtu' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_mtu@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3129' column='1'/>
      <parameter type-id='type-id-528' name='mtu' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3129' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_macaddr_get' mangled-name='rte_eth_macaddr_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_macaddr_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3117' column='1'/>
      <parameter type-id='type-id-90' name='mac_addr' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3117' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-533'/>
    <function-decl name='rte_eth_dev_get_supported_ptypes' mangled-name='rte_eth_dev_get_supported_ptypes' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_supported_ptypes@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3005' column='1'/>
      <parameter type-id='type-id-25' name='ptype_mask' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3005' column='1'/>
      <parameter type-id='type-id-533' name='ptypes' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3006' column='1'/>
      <parameter type-id='type-id-1' name='num' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3006' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_info_get' mangled-name='rte_eth_dev_info_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2954' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_info_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2954' column='1'/>
      <parameter type-id='type-id-348' name='dev_info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2954' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_fw_version_get' mangled-name='rte_eth_dev_fw_version_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2941' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_fw_version_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2941' column='1'/>
      <parameter type-id='type-id-345' name='fw_version' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2941' column='1'/>
      <parameter type-id='type-id-50' name='fw_size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2941' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_rx_queue_stats_mapping' mangled-name='rte_eth_dev_set_rx_queue_stats_mapping' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_rx_queue_stats_mapping@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2933' column='1'/>
      <parameter type-id='type-id-18' name='rx_queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2933' column='1'/>
      <parameter type-id='type-id-92' name='stat_idx' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2934' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_tx_queue_stats_mapping' mangled-name='rte_eth_dev_set_tx_queue_stats_mapping' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_tx_queue_stats_mapping@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2933' column='1'/>
      <parameter type-id='type-id-18' name='rx_queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2933' column='1'/>
      <parameter type-id='type-id-92' name='stat_idx' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2934' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_xstats_reset' mangled-name='rte_eth_xstats_reset' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_xstats_reset@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_xstats_get' mangled-name='rte_eth_xstats_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_xstats_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2829' column='1'/>
      <parameter type-id='type-id-262' name='xstats' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2829' column='1'/>
      <parameter type-id='type-id-36' name='n' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2830' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_xstats_get_by_id' mangled-name='rte_eth_xstats_get_by_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_xstats_get_by_id@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2737' column='1'/>
      <parameter type-id='type-id-476' name='ids' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2737' column='1'/>
      <parameter type-id='type-id-472' name='values' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2738' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2738' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_xstats_get_names' mangled-name='rte_eth_xstats_get_names' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_xstats_get_names@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2647' column='1'/>
      <parameter type-id='type-id-266' name='xstats_names' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2648' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2649' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_xstats_get_names_by_id' mangled-name='rte_eth_xstats_get_names_by_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_xstats_get_names_by_id@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2539' column='1'/>
      <parameter type-id='type-id-266' name='xstats_names' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2540' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2540' column='1'/>
      <parameter type-id='type-id-472' name='ids' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2541' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_xstats_get_id_by_name' mangled-name='rte_eth_xstats_get_id_by_name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_xstats_get_id_by_name@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2455' column='1'/>
      <parameter type-id='type-id-272' name='xstat_name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2455' column='1'/>
      <parameter type-id='type-id-472' name='id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2456' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_stats_reset' mangled-name='rte_eth_stats_reset' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_stats_reset@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_stats_get' mangled-name='rte_eth_stats_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_stats_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2378' column='1'/>
      <parameter type-id='type-id-258' name='stats' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2378' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-534'/>
    <function-decl name='rte_eth_link_get_nowait' mangled-name='rte_eth_link_get_nowait' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_link_get_nowait@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2358' column='1'/>
      <parameter type-id='type-id-534' name='eth_link' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2358' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_link_get' mangled-name='rte_eth_link_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_link_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2358' column='1'/>
      <parameter type-id='type-id-534' name='eth_link' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2358' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_allmulticast_get' mangled-name='rte_eth_allmulticast_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_allmulticast_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_allmulticast_disable' mangled-name='rte_eth_allmulticast_disable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_allmulticast_disable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_allmulticast_enable' mangled-name='rte_eth_allmulticast_enable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_allmulticast_enable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_promiscuous_get' mangled-name='rte_eth_promiscuous_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_promiscuous_get@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_promiscuous_disable' mangled-name='rte_eth_promiscuous_disable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_promiscuous_disable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_promiscuous_enable' mangled-name='rte_eth_promiscuous_enable' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_promiscuous_enable@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_tx_done_cleanup' mangled-name='rte_eth_tx_done_cleanup' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_done_cleanup@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2218' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2218' column='1'/>
      <parameter type-id='type-id-25' name='free_cnt' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2218' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_eth_dev_tx_buffer' size-in-bits='192' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2822' column='1' id='type-id-535'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error_callback' type-id='type-id-536' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='error_userdata' type-id='type-id-7' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='length' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pkts' type-id='type-id-537' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2827' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-539'/>
    <typedef-decl name='buffer_tx_error_fn' type-id='type-id-539' filepath='../lib/librte_ethdev/rte_ethdev.h' line='2815' column='1' id='type-id-536'/>

    <array-type-def dimensions='1' type-id='type-id-27' size-in-bits='infinite' id='type-id-537'>
      <subrange length='infinite' type-id='type-id-30' id='type-id-32'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-540'/>
    <function-decl name='rte_eth_tx_buffer_init' mangled-name='rte_eth_tx_buffer_init' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_buffer_init@@DPDK_20.0'>
      <parameter type-id='type-id-540' name='buffer' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2201' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2201' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_tx_buffer_set_err_callback' mangled-name='rte_eth_tx_buffer_set_err_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_buffer_set_err_callback@@DPDK_20.0'>
      <parameter type-id='type-id-540' name='buffer' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2192' column='1'/>
      <parameter type-id='type-id-536' name='cbfn' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2193' column='1'/>
      <parameter type-id='type-id-7' name='userdata' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2193' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_tx_buffer_count_callback' mangled-name='rte_eth_tx_buffer_count_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_buffer_count_callback@@DPDK_20.0'>
      <parameter type-id='type-id-81' name='pkts' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2179' column='1'/>
      <parameter type-id='type-id-18' name='unsent' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2179' column='1'/>
      <parameter type-id='type-id-7' name='userdata' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2180' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_eth_tx_buffer_drop_callback' mangled-name='rte_eth_tx_buffer_drop_callback' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_buffer_drop_callback@@DPDK_20.0'>
      <parameter type-id='type-id-81' name='pkts' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2169' column='1'/>
      <parameter type-id='type-id-18' name='unsent' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2169' column='1'/>
      <parameter type-id='type-id-7' name='userdata' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2170' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_eth_tx_queue_setup' mangled-name='rte_eth_tx_queue_setup' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_queue_setup@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1999' column='1'/>
      <parameter type-id='type-id-18' name='tx_queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1999' column='1'/>
      <parameter type-id='type-id-18' name='nb_tx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2000' column='1'/>
      <parameter type-id='type-id-36' name='socket_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2000' column='1'/>
      <parameter type-id='type-id-388' name='tx_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2001' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_rx_queue_setup' mangled-name='rte_eth_rx_queue_setup' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_rx_queue_setup@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1773' column='1'/>
      <parameter type-id='type-id-18' name='rx_queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1773' column='1'/>
      <parameter type-id='type-id-18' name='nb_rx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1774' column='1'/>
      <parameter type-id='type-id-36' name='socket_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1774' column='1'/>
      <parameter type-id='type-id-378' name='rx_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1775' column='1'/>
      <parameter type-id='type-id-26' name='mp' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1776' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_reset' mangled-name='rte_eth_dev_reset' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1733' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_reset@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_close' mangled-name='rte_eth_dev_close' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1703' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_close@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1703' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_link_down' mangled-name='rte_eth_dev_set_link_down' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_link_down@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_link_up' mangled-name='rte_eth_dev_set_link_up' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_link_up@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_stop' mangled-name='rte_eth_dev_stop' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_stop@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1703' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_eth_dev_start' mangled-name='rte_eth_dev_start' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_start@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1605' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_rte_eth_dev_reset' mangled-name='_rte_eth_dev_reset' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_rte_eth_dev_reset@@DPDK_20.0'>
      <parameter type-id='type-id-239' name='dev' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4090' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-541'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <function-decl name='rte_eth_dev_configure' mangled-name='rte_eth_dev_configure' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_configure@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1219' column='1'/>
      <parameter type-id='type-id-18' name='nb_rx_q' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1219' column='1'/>
      <parameter type-id='type-id-18' name='nb_tx_q' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1219' column='1'/>
      <parameter type-id='type-id-542' name='dev_conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1220' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_tx_offload_name' mangled-name='rte_eth_dev_tx_offload_name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_tx_offload_name@@DPDK_20.0'>
      <parameter type-id='type-id-24' name='offload' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1125' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_offload_name' mangled-name='rte_eth_dev_rx_offload_name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_offload_name@@DPDK_20.0'>
      <parameter type-id='type-id-24' name='offload' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1125' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-decl name='rte_eth_speed_bitflag' mangled-name='rte_eth_speed_bitflag' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1076' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_speed_bitflag@@DPDK_20.0'>
      <parameter type-id='type-id-25' name='speed' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1076' column='1'/>
      <parameter type-id='type-id-1' name='duplex' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1076' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rte_eth_dev_tx_queue_stop' mangled-name='rte_eth_dev_tx_queue_stop' filepath='../lib/librte_ethdev/rte_ethdev.c' line='993' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_tx_queue_stop@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4338' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_tx_queue_start' mangled-name='rte_eth_dev_tx_queue_start' filepath='../lib/librte_ethdev/rte_ethdev.c' line='954' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_tx_queue_start@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4338' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_queue_stop' mangled-name='rte_eth_dev_rx_queue_stop' filepath='../lib/librte_ethdev/rte_ethdev.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_queue_stop@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4338' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_queue_start' mangled-name='rte_eth_dev_rx_queue_start' filepath='../lib/librte_ethdev/rte_ethdev.c' line='880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_queue_start@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4337' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4338' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_port_by_name' mangled-name='rte_eth_dev_get_port_by_name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_port_by_name@@DPDK_20.0'>
      <parameter type-id='type-id-272' name='name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='801' column='1'/>
      <parameter type-id='type-id-528' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='801' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_name_by_port' mangled-name='rte_eth_dev_get_name_by_port' filepath='../lib/librte_ethdev/rte_ethdev.c' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_name_by_port@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='782' column='1'/>
      <parameter type-id='type-id-345' name='name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='782' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_count_total' mangled-name='rte_eth_dev_count_total' filepath='../lib/librte_ethdev/rte_ethdev.c' line='771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_count_total@@DPDK_20.0'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='rte_eth_dev_count_avail' mangled-name='rte_eth_dev_count_avail' filepath='../lib/librte_ethdev/rte_ethdev.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_count_avail@@DPDK_20.0'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_sec_ctx' mangled-name='rte_eth_dev_get_sec_ctx' filepath='../lib/librte_ethdev/rte_ethdev.c' line='750' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_sec_ctx@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='750' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='rte_eth_dev_socket_id' mangled-name='rte_eth_dev_socket_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='743' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_socket_id@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='743' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_find_next_owned_by' mangled-name='rte_eth_find_next_owned_by' filepath='../lib/librte_ethdev/rte_ethdev.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_find_next_owned_by@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='594' column='1'/>
      <parameter type-id='type-id-475' name='owner_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='594' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='rte_eth_dev_is_valid_port' mangled-name='rte_eth_dev_is_valid_port' filepath='../lib/librte_ethdev/rte_ethdev.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_is_valid_port@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='743' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_release_port' mangled-name='rte_eth_dev_release_port' filepath='../lib/librte_ethdev/rte_ethdev.c' line='545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_release_port@@DPDK_20.0'>
      <parameter type-id='type-id-239' name='eth_dev' filepath='../lib/librte_ethdev/rte_ethdev.c' line='545' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_attach_secondary' mangled-name='rte_eth_dev_attach_secondary' filepath='../lib/librte_ethdev/rte_ethdev.c' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_attach_secondary@@DPDK_20.0'>
      <parameter type-id='type-id-272' name='name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='517' column='1'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='rte_eth_dev_allocate' mangled-name='rte_eth_dev_allocate' filepath='../lib/librte_ethdev/rte_ethdev.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_allocate@@DPDK_20.0'>
      <parameter type-id='type-id-272' name='name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='464' column='1'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='rte_eth_dev_allocated' mangled-name='rte_eth_dev_allocated' filepath='../lib/librte_ethdev/rte_ethdev.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_allocated@@DPDK_20.0'>
      <parameter type-id='type-id-272' name='name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='422' column='1'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='rte_eth_find_next' mangled-name='rte_eth_find_next' filepath='../lib/librte_ethdev/rte_ethdev.c' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_find_next@@DPDK_20.0'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='330' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-543'/>
    <function-decl name='rte_eth_iterator_cleanup' mangled-name='rte_eth_iterator_cleanup' filepath='../lib/librte_ethdev/rte_ethdev.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_iterator_cleanup@@DPDK_20.0'>
      <parameter type-id='type-id-543' name='iter' filepath='../lib/librte_ethdev/rte_ethdev.c' line='320' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rte_eth_iterator_next' mangled-name='rte_eth_iterator_next' filepath='../lib/librte_ethdev/rte_ethdev.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_iterator_next@@DPDK_20.0'>
      <parameter type-id='type-id-543' name='iter' filepath='../lib/librte_ethdev/rte_ethdev.c' line='291' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='rte_eth_iterator_init' mangled-name='rte_eth_iterator_init' filepath='../lib/librte_ethdev/rte_ethdev.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_iterator_init@@DPDK_20.0'>
      <parameter type-id='type-id-543' name='iter' filepath='../lib/librte_ethdev/rte_ethdev.c' line='190' column='1'/>
      <parameter type-id='type-id-272' name='devargs_str' filepath='../lib/librte_ethdev/rte_ethdev.c' line='190' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='ethdev_uninit_t' type-id='type-id-241' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='353' column='1' id='type-id-544'/>
    <function-decl name='rte_eth_dev_destroy' mangled-name='rte_eth_dev_destroy' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_destroy@@EXPERIMENTAL'>
      <parameter type-id='type-id-239' name='ethdev' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4263' column='1'/>
      <parameter type-id='type-id-544' name='ethdev_uninit' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4264' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='ethdev_bus_specific_init' type-id='type-id-482' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='318' column='1' id='type-id-545'/>
    <typedef-decl name='ethdev_init_t' type-id='type-id-482' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='317' column='1' id='type-id-546'/>
    <function-decl name='rte_eth_dev_create' mangled-name='rte_eth_dev_create' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_create@@EXPERIMENTAL'>
      <parameter type-id='type-id-9' name='device' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4200' column='1'/>
      <parameter type-id='type-id-272' name='name' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4200' column='1'/>
      <parameter type-id='type-id-50' name='priv_data_size' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4201' column='1'/>
      <parameter type-id='type-id-545' name='ethdev_bus_specific_init' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4202' column='1'/>
      <parameter type-id='type-id-7' name='bus_init_params' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4203' column='1'/>
      <parameter type-id='type-id-546' name='ethdev_init' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4204' column='1'/>
      <parameter type-id='type-id-7' name='init_params' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4204' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rte_eth_devargs' size-in-bits='1056' is-struct='yes' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='287' column='1' id='type-id-547'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ports' type-id='type-id-548' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_ports' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='representor_ports' type-id='type-id-548' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='nb_representor_ports' type-id='type-id-18' visibility='default' filepath='../lib/librte_ethdev/rte_ethdev_driver.h' line='294' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='512' id='type-id-548'>
      <subrange length='32' type-id='type-id-30' id='type-id-47'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-549'/>
    <function-decl name='rte_eth_devargs_parse' mangled-name='rte_eth_devargs_parse' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_devargs_parse@@EXPERIMENTAL'>
      <parameter type-id='type-id-272' name='dargs' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5162' column='1'/>
      <parameter type-id='type-id-549' name='eth_da' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5162' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_switch_domain_free' mangled-name='rte_eth_switch_domain_free' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_switch_domain_free@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='743' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_switch_domain_alloc' mangled-name='rte_eth_switch_domain_alloc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_switch_domain_alloc@@EXPERIMENTAL'>
      <parameter type-id='type-id-528' name='domain_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='5061' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_hairpin_capability_get' mangled-name='rte_eth_dev_hairpin_capability_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4994' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_hairpin_capability_get@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4994' column='1'/>
      <parameter type-id='type-id-486' name='cap' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4995' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_read_clock' mangled-name='rte_eth_read_clock' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_read_clock@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4801' column='1'/>
      <parameter type-id='type-id-472' name='clock' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4801' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_module_eeprom' mangled-name='rte_eth_dev_get_module_eeprom' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_module_eeprom@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1'/>
      <parameter type-id='type-id-437' name='info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4849' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_get_module_info' mangled-name='rte_eth_dev_get_module_info' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4861' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_get_module_info@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4861' column='1'/>
      <parameter type-id='type-id-441' name='modinfo' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4862' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_tx_burst_mode_get' mangled-name='rte_eth_tx_burst_mode_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_burst_mode_get@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4671' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4671' column='1'/>
      <parameter type-id='type-id-361' name='mode' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4672' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_rx_burst_mode_get' mangled-name='rte_eth_rx_burst_mode_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_rx_burst_mode_get@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4671' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4671' column='1'/>
      <parameter type-id='type-id-361' name='mode' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4672' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_rx_intr_ctl_q_get_fd' mangled-name='rte_eth_dev_rx_intr_ctl_q_get_fd' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_rx_intr_ctl_q_get_fd@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4138' column='1'/>
      <parameter type-id='type-id-18' name='queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='4138' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_set_ptypes' mangled-name='rte_eth_dev_set_ptypes' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_set_ptypes@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3031' column='1'/>
      <parameter type-id='type-id-25' name='ptype_mask' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3031' column='1'/>
      <parameter type-id='type-id-533' name='set_ptypes' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3032' column='1'/>
      <parameter type-id='type-id-36' name='num' filepath='../lib/librte_ethdev/rte_ethdev.c' line='3032' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_tx_hairpin_queue_setup' mangled-name='rte_eth_tx_hairpin_queue_setup' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_tx_hairpin_queue_setup@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2098' column='1'/>
      <parameter type-id='type-id-18' name='tx_queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2098' column='1'/>
      <parameter type-id='type-id-18' name='nb_tx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2099' column='1'/>
      <parameter type-id='type-id-493' name='conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2100' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_rx_hairpin_queue_setup' mangled-name='rte_eth_rx_hairpin_queue_setup' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_rx_hairpin_queue_setup@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2098' column='1'/>
      <parameter type-id='type-id-18' name='tx_queue_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2098' column='1'/>
      <parameter type-id='type-id-18' name='nb_tx_desc' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2099' column='1'/>
      <parameter type-id='type-id-493' name='conf' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2100' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_is_removed' mangled-name='rte_eth_dev_is_removed' filepath='../lib/librte_ethdev/rte_ethdev.c' line='1750' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_is_removed@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='2393' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-550'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-551'/>
    <function-decl name='rte_eth_dev_owner_get' mangled-name='rte_eth_dev_owner_get' filepath='../lib/librte_ethdev/rte_ethdev.c' line='721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_owner_get@@EXPERIMENTAL'>
      <parameter type-id='type-id-550' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='721' column='1'/>
      <parameter type-id='type-id-551' name='owner' filepath='../lib/librte_ethdev/rte_ethdev.c' line='721' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_owner_delete' mangled-name='rte_eth_dev_owner_delete' filepath='../lib/librte_ethdev/rte_ethdev.c' line='691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_owner_delete@@EXPERIMENTAL'>
      <parameter type-id='type-id-475' name='owner_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='691' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_owner_unset' mangled-name='rte_eth_dev_owner_unset' filepath='../lib/librte_ethdev/rte_ethdev.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_owner_unset@@EXPERIMENTAL'>
      <parameter type-id='type-id-550' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='674' column='1'/>
      <parameter type-id='type-id-475' name='owner_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='674' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-552'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-553'/>
    <function-decl name='rte_eth_dev_owner_set' mangled-name='rte_eth_dev_owner_set' filepath='../lib/librte_ethdev/rte_ethdev.c' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_owner_set@@EXPERIMENTAL'>
      <parameter type-id='type-id-550' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='658' column='1'/>
      <parameter type-id='type-id-553' name='owner' filepath='../lib/librte_ethdev/rte_ethdev.c' line='659' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_dev_owner_new' mangled-name='rte_eth_dev_owner_new' filepath='../lib/librte_ethdev/rte_ethdev.c' line='605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_dev_owner_new@@EXPERIMENTAL'>
      <parameter type-id='type-id-472' name='owner_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='605' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rte_eth_find_next_sibling' mangled-name='rte_eth_find_next_sibling' filepath='../lib/librte_ethdev/rte_ethdev.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rte_eth_find_next_sibling@@EXPERIMENTAL'>
      <parameter type-id='type-id-18' name='port_id' filepath='../lib/librte_ethdev/rte_ethdev.c' line='363' column='1'/>
